{
    "train": [
        [
            "What's my monthly income and the total amount of tax deductions from it?",
            "income,taxes",
            "anaphora"
        ],
        [
            "Please give me my salary figure, as well as the specifics on my federal taxes.",
            "income,taxes",
            "ellipsis"
        ],
        [
            "I need to know how much I make at my job as well as how much tax i pay from my earnings.",
            "income,taxes",
            "ellipsis"
        ],
        [
            "Can you tell me what my total income is for the pay period and whether I pay a lot of taxes on it?",
            "income,taxes",
            "anaphora"
        ],
        [
            "Please, tell me what my income is and how much tax there is on it?",
            "income,taxes",
            "anaphora"
        ],
        [
            "Please, tell me the amount of my income, as well the amount of income tax.",
            "income,taxes",
            "ellipsis"
        ],
        [
            "What is my total annual income, and do I pay a lot of taxes on it ?",
            "income,taxes",
            "anaphora"
        ],
        [
            "What is my current gross salary, and what amount am i taxed on it?",
            "income,taxes",
            "anaphora"
        ],
        [
            "I want to know my income, and how much tax I should pay on it",
            "income,taxes",
            "anaphora"
        ],
        [
            "What is my income, and how much tax do I pay on it?",
            "income,taxes",
            "anaphora"
        ],
        [
            "Text robby \"hello\" and send him my location.",
            "text,share_location",
            "anaphora"
        ],
        [
            "Send a message to mom \"be there soon\", as well as my gps coordinates with home base.",
            "text,share_location",
            "ellipsis"
        ],
        [
            "Send a text to my cousin linda that says happy birthday, and share my location with her.",
            "text,share_location",
            "anaphora"
        ],
        [
            "Text mom \"where are you\" and share my location with her.",
            "text,share_location",
            "anaphora"
        ],
        [
            "Text Christy what she wants for dinner and share my location with her.",
            "text,share_location",
            "anaphora"
        ],
        [
            "Text him, I mean Josh, and tell him that I need a delivery. Then let Ben and Jerry know where I am.",
            "text,share_location",
            "cataphora"
        ],
        [
            "Text mom that I'll talk to her later and share my location with her.",
            "text,share_location",
            "anaphora"
        ],
        [
            "Text dad asking where he is and share my location with her, please.",
            "text,share_location",
            "anaphora"
        ],
        [
            "Send a message to Natalie in the form of a text and share my location with her.",
            "text,share_location",
            "anaphora"
        ],
        [
            "Could you send a text to Marty and say I am running behind and let him know where I am located?",
            "text,share_location",
            "anaphora"
        ],
        [
            "Check my bank balance and my credit score.",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "What is my bank balance and my credit score?",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "I'll check my bank balance, you my credit score.",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "How do I see my checking account balance and my credit score?",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "Give me the balance of my savings, and my credit score.",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "I want to check my balance on my chase mastercard as well as my current credit rating.",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "I want to check my balance, and my credit rating, too.",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "I wanna know my bank balance, as well as my credit score.",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "I would like to inquire about my bank balance, as well as about my credit rating.",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "I want to see my checking balance at chase, and my credit score, too",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "Please help me locate them, I mean my lost luggage and my phone.",
            "lost_luggage,find_phone",
            "cataphora"
        ],
        [
            "Where are they? My phone and my luggage I mean. I left them somewhere.",
            "lost_luggage,find_phone",
            "cataphora"
        ],
        [
            "I couldn't find them, both my luggage and phone have been lost.",
            "lost_luggage,find_phone",
            "cataphora"
        ],
        [
            "Help me search for my lost luggage, and phone.",
            "lost_luggage,find_phone",
            "ellipsis"
        ],
        [
            "While flying america airlines I lost my luggage at o'hare and my phone, too",
            "lost_luggage,find_phone",
            "ellipsis"
        ],
        [
            "Can you find out what happened to them? My lost luggage and my phone, I misplaced them.",
            "lost_luggage,find_phone",
            "cataphora"
        ],
        [
            "I am looking for my lost luggage, and for my phone.",
            "lost_luggage,find_phone",
            "ellipsis"
        ],
        [
            "Has anyone seen my lost luggage, and my cellphone?",
            "lost_luggage,find_phone",
            "ellipsis"
        ],
        [
            "I don't know where I left my luggage, and my phone.",
            "lost_luggage,find_phone",
            "ellipsis"
        ],
        [
            "Help me find my luggage and my phone.",
            "lost_luggage,find_phone",
            "ellipsis"
        ],
        [
            "I tried to use my credit card yesterday and it did not work, how long will it take to replace it ?",
            "card_declined,replacement_card_duration",
            "anaphora"
        ],
        [
            "Why did my card get declined at the dentist office, and when will my new one arrive?",
            "card_declined,replacement_card_duration",
            "anaphora"
        ],
        [
            "Please tell me why Walgreen's wouldn't take my card, and when will my new one arrive?",
            "card_declined,replacement_card_duration",
            "anaphora"
        ],
        [
            "Why did Macy's decline my card and when can I expect it to arrive if I order a new one?",
            "card_declined,replacement_card_duration",
            "cataphora"
        ],
        [
            "Is my card working properly? If it was stolen, how long will it take to replace?",
            "card_declined,replacement_card_duration",
            "anaphora"
        ],
        [
            "What was the problem with my card yesterday? If I ordered a new one, how long until it comes?",
            "card_declined,replacement_card_duration",
            "cataphora"
        ],
        [
            "I was at sears trying to buy clothes and my card got declined. How long does it take to get a new one?",
            "card_declined,replacement_card_duration",
            "cataphora"
        ],
        [
            "It turns out my card was declined at Fry's, and I would like to know why. How soon will I be sent a new one?",
            "card_declined,replacement_card_duration",
            "anaphora"
        ],
        [
            "Why was my card not accepted? How long will it take to replace it if it was stolen?",
            "card_declined,replacement_card_duration",
            "anaphora"
        ],
        [
            "I need to know why my card was declined yesterday and how long it will take to mail a new one if I need it.",
            "card_declined,replacement_card_duration",
            "anaphora"
        ],
        [
            "Bella needs to be called and Hayley to be sent my location.",
            "make_call,share_location",
            "ellipsis"
        ],
        [
            "Would you give Jenny a call and my boyfriend my gps coordinates?",
            "make_call,share_location",
            "ellipsis"
        ],
        [
            "Dial sarah and then inform her of my current location.",
            "make_call,share_location",
            "anaphora"
        ],
        [
            "Place a call to bill, then share my location with him.",
            "make_call,share_location",
            "anaphora"
        ],
        [
            "Give liz a call and tom my location.",
            "make_call,share_location",
            "ellipsis"
        ],
        [
            "Connect me to him; I mean my son, and then let him know my location.",
            "make_call,share_location",
            "cataphora"
        ],
        [
            "Although I want to call her, it's not just that. I also want to share my location with Sarah.",
            "make_call,share_location",
            "cataphora"
        ],
        [
            "Phone sarah, then share my location with her.",
            "make_call,share_location",
            "anaphora"
        ],
        [
            "Call his family and give them my location.",
            "make_call,share_location",
            "anaphora"
        ],
        [
            "I would like to call my mother and share my location with her.",
            "make_call,share_location",
            "anaphora"
        ],
        [
            "Show me my credit score and ways to improve it.",
            "credit_score,improve_credit_score",
            "ellipsis"
        ],
        [
            "Provide me with my credit score and with ways to build it.",
            "credit_score,improve_credit_score",
            "ellipsis"
        ],
        [
            "What is my credit score and what can I do to keep it from dropping ?",
            "credit_score,improve_credit_score",
            "anaphora"
        ],
        [
            "Look up my credit score and tell me ways to improve it.",
            "credit_score,improve_credit_score",
            "anaphora"
        ],
        [
            "Show me my credit score and ways to increase it.",
            "credit_score,improve_credit_score",
            "ellipsis"
        ],
        [
            "Tell me my credit score and how to improve it.",
            "credit_score,improve_credit_score",
            "anaphora"
        ],
        [
            "Help me find my credit score and ways to increase it.",
            "credit_score,improve_credit_score",
            "ellipsis"
        ],
        [
            "Inform me of my credit score and give me the steps to raise it.",
            "credit_score,improve_credit_score",
            "anaphora"
        ],
        [
            "Can you tell me my credit score and what do I should to stop it from decreasing?",
            "credit_score,improve_credit_score",
            "anaphora"
        ],
        [
            "I gotta know my credit score and how to keep it high.",
            "credit_score,improve_credit_score",
            "anaphora"
        ],
        [
            "When is my card going to expire and how soon will I be sent a new one?",
            "expiration_date,replacement_card_duration",
            "anaphora"
        ],
        [
            "Can you check when my visa card expires, as well as when my replacement card will get mailed?",
            "expiration_date,replacement_card_duration",
            "ellipsis"
        ],
        [
            "Tell me the expiry month of my card, and the transit time on a new one?",
            "expiration_date,replacement_card_duration",
            "ellipsis"
        ],
        [
            "Tell me the month that my credit card will expire and when I will get my new one?",
            "expiration_date,replacement_card_duration",
            "ellipsis"
        ],
        [
            "I want to know the expiry month of my card and how long it will take to get a new one?",
            "expiration_date,replacement_card_duration",
            "anaphora"
        ],
        [
            "When does my card expire and what date will it be here?",
            "expiration_date,replacement_card_duration",
            "anaphora"
        ],
        [
            "What is the month of my card's expiration date and how long does it take you to mail me a new one?",
            "expiration_date,replacement_card_duration",
            "anaphora"
        ],
        [
            "Ηow long is the validity of my credit card for, and the shipping time for my replacement card?",
            "expiration_date,replacement_card_duration",
            "ellipsis"
        ],
        [
            "When is the expiration date for my visa card and what is the time frame to get a new card mailed to me?",
            "expiration_date,replacement_card_duration",
            "ellipsis"
        ],
        [
            "Do I need a new card and when will it come in the mail?",
            "expiration_date,replacement_card_duration",
            "anaphora"
        ],
        [
            "Please give me the outstanding balance on my water bill, and the minimum amount I can pay on my phone bill",
            "bill_balance,min_payment",
            "ellipsis"
        ],
        [
            "Find out the outstanding balance of my invoice, as well as the minimum I can pay.",
            "bill_balance,min_payment",
            "ellipsis"
        ],
        [
            "Tell me the balance of my plumbing bill and the lowest amount I can pay on my cable bill, too.",
            "bill_balance,min_payment",
            "ellipsis"
        ],
        [
            "I need to know the balance of my cable bill and the minimum payment on the bill.",
            "bill_balance,min_payment",
            "ellipsis"
        ],
        [
            "How much is my electric bill and what is the minimum I can pay on it?",
            "bill_balance,min_payment",
            "anaphora"
        ],
        [
            "Find out the outstanding balance of my bill and what the minumum payment is.",
            "bill_balance,min_payment",
            "ellipsis"
        ],
        [
            "What's the water bill and the minimum payment for my power bill?",
            "bill_balance,min_payment",
            "ellipsis"
        ],
        [
            "How much is my electricity bill, as well as its minimum payment?",
            "bill_balance,min_payment",
            "anaphora"
        ],
        [
            "Ηow much is my rent and what is the minimum I can pay on it?",
            "bill_balance,min_payment",
            "anaphora"
        ],
        [
            "How much is my water bill this month and how low can we bring it to?",
            "bill_balance,min_payment",
            "anaphora"
        ],
        [
            "Is it safe to travel to Norway, and what timezone is Detroit in?",
            "travel_alert,timezone",
            "cataphora"
        ],
        [
            "Is it safe to travel to China, and what timezone is Beijing in?",
            "travel_alert,timezone",
            "cataphora"
        ],
        [
            "I need to know the travel alerts for Kenya and its current timezone, if possible.",
            "travel_alert,timezone",
            "anaphora"
        ],
        [
            "Is it safe to travel to Kenya, also may I inquire about its timezone?",
            "travel_alert,timezone",
            "cataphora"
        ],
        [
            "How dangerous is it in Spain, also what timezone is it in?",
            "travel_alert,timezone",
            "anaphora"
        ],
        [
            "Any travel advice for travelling to Portugal and could you find its applicable timezone?",
            "travel_alert,timezone",
            "anaphora"
        ],
        [
            "Are there any travel warnings for London ? Also, search for its timezone.",
            "travel_alert,timezone",
            "anaphora"
        ],
        [
            "Can I safely travel to Brazil, and what is its timezone?",
            "travel_alert,timezone",
            "anaphora"
        ],
        [
            "Does Russia have any travel alerts I should be aware of, and what timezone is it in?",
            "travel_alert,timezone",
            "anaphora"
        ],
        [
            "Is there a travel alert for France, and what is its timezone?",
            "travel_alert,timezone",
            "anaphora"
        ],
        [
            "I need help since someone stole my card and how long will it take to get a new one?",
            "report_lost_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "I can't locate my mastercard and i want to report it as lost, please. So how many days till I get a new one to replace the stolen one?",
            "report_lost_card,replacement_card_duration",
            "anaphora"
        ],
        [
            "Report my card as lost, and how long will it take to receive a new one?",
            "report_lost_card,replacement_card_duration",
            "anaphora"
        ],
        [
            "My visa card got stolen, can I replace it soon?",
            "report_lost_card,replacement_card_duration",
            "anaphora"
        ],
        [
            "Μy card is lost, how do I report it and when can I expect my new one to get here?",
            "report_lost_card,replacement_card_duration",
            "anaphora"
        ],
        [
            "Ι need help since someone stole my card, so can I replace it soon?",
            "report_lost_card,replacement_card_duration",
            "anaphora"
        ],
        [
            "Ι need to report that my card is lost and inquire about the transit time to replace it.",
            "report_lost_card,replacement_card_duration",
            "anaphora"
        ],
        [
            "Ι lost my card. How do I report it and what would be the estimated time to get a new one mailed to me?",
            "report_lost_card,replacement_card_duration",
            "anaphora"
        ],
        [
            "My card is lost. Could you please report it? Also, if I were to order a new one, how long would it take?",
            "report_lost_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "My credit card is lost. What do I do? Besides, how long does it take to get a new one?",
            "report_lost_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "Before telling me the date it was last inspected, i mean my car, with what kind of gas can I fill it?",
            "last_maintenance,gas_type",
            "cataphora"
        ],
        [
            "After telling me when was the last time it was in the shop, I mean my car. Also, what gas does it need?",
            "last_maintenance,gas_type",
            "cataphora"
        ],
        [
            "Find me the date of my last oil change, and the kind of gas that this car uses.",
            "last_maintenance,gas_type",
            "ellipsis"
        ],
        [
            "I need to know when I last took my car to the shop, and what kind of gas can I use in this car?",
            "last_maintenance,gas_type",
            "ellipsis"
        ],
        [
            "How long's it been since I had my car serviced and what kind of gas should I use to fill it?",
            "last_maintenance,gas_type",
            "anaphora"
        ],
        [
            "When was my car last at the mechanics and what gas does it need?",
            "last_maintenance,gas_type",
            "anaphora"
        ],
        [
            "Please tell me the last time I took my car to the shop. Also, what kind of gas does it take?",
            "last_maintenance,gas_type",
            "anaphora"
        ],
        [
            "What date did I last have a technician check out my vehicle and what kind of gas does it take?",
            "last_maintenance,gas_type",
            "anaphora"
        ],
        [
            "When did I last have it fixed ? I mean my car, what type of fuel does it use, too?",
            "last_maintenance,gas_type",
            "cataphora"
        ],
        [
            "When was the last time I serviced my car and what type of fuel does it use ?",
            "last_maintenance,gas_type",
            "anaphora"
        ],
        [
            "Help me search for my phone, and then use it to call Tom.",
            "find_phone,make_call",
            "anaphora"
        ],
        [
            "Can you help me find my phone and use it to dial Sarah?",
            "find_phone,make_call",
            "anaphora"
        ],
        [
            "I am looking for my phone. Then, could you use it to call my mother?",
            "find_phone,make_call",
            "anaphora"
        ],
        [
            "Can you help me locate my phone and call tom's?",
            "find_phone,make_call",
            "ellipsis"
        ],
        [
            "You need to help me find my cellphone and call steven's.",
            "find_phone,make_call",
            "ellipsis"
        ],
        [
            "Siri, find my iphone and use it to call work.",
            "find_phone,make_call",
            "anaphora"
        ],
        [
            "Help me locate my phone and use it to call work.",
            "find_phone,make_call",
            "anaphora"
        ],
        [
            "Call my phone, I can't find it. When you find it, call Mark.",
            "find_phone,make_call",
            "ellipsis"
        ],
        [
            "Since I can't find it, I need help locating my phone. Also, can you call a taxi?",
            "find_phone,make_call",
            "cataphora"
        ],
        [
            "I lost it, and I need help finding my phone. Also, can you make a phone call to Dave?",
            "find_phone,make_call",
            "cataphora"
        ],
        [
            "It is needed, the name of your creator. Also, who do you work for?",
            "who_made_you,who_do_you_work_for",
            "cataphora"
        ],
        [
            "Tell me who constructed you, as well as who is your employeer.",
            "who_made_you,who_do_you_work_for",
            "ellipsis"
        ],
        [
            "Please provide the name of the creator of this ai, as well as the name of the manager of this ai.",
            "who_made_you,who_do_you_work_for",
            "ellipsis"
        ],
        [
            "Tell me your company, as well as your supervisor",
            "who_made_you,who_do_you_work_for",
            "ellipsis"
        ],
        [
            "Give me the name of the person who created you, as well as the name of your employer.",
            "who_made_you,who_do_you_work_for",
            "ellipsis"
        ],
        [
            "What's the name of the company that designed you, and what about your boss's?",
            "who_made_you,who_do_you_work_for",
            "ellipsis"
        ],
        [
            "What is your creator's name, and what about your boss's ?",
            "who_made_you,who_do_you_work_for",
            "ellipsis"
        ],
        [
            "What company do you work for and which one coded you?",
            "who_made_you,who_do_you_work_for",
            "anaphora"
        ],
        [
            "You work for which person exactly and which one programmed you?",
            "who_made_you,who_do_you_work_for",
            "anaphora"
        ],
        [
            "You work for which company exactly and which one programmed you?",
            "who_made_you,who_do_you_work_for",
            "anaphora"
        ],
        [
            "Can you tell me the date my credit card is due, as well as how to pay my bill?",
            "bill_due,pay_bill",
            "ellipsis"
        ],
        [
            "When is my water bill due, because I want to pay it.",
            "bill_due,pay_bill",
            "anaphora"
        ],
        [
            "I want to know when I owe the rent so that I can pay it.",
            "bill_due,pay_bill",
            "anaphora"
        ],
        [
            "What day is the bill due and is it possible to pay it?",
            "bill_due,pay_bill",
            "anaphora"
        ],
        [
            "When is the bill due and what's the best way to pay it?",
            "bill_due,pay_bill",
            "anaphora"
        ],
        [
            "What is the due date for the bill and can you pay it now?",
            "bill_due,pay_bill",
            "anaphora"
        ],
        [
            "When do I have to pay it by? I want to settle my electric bill promptly.",
            "bill_due,pay_bill",
            "cataphora"
        ],
        [
            "When should i pay it by? I want to pay my bill immediately.",
            "bill_due,pay_bill",
            "cataphora"
        ],
        [
            "When is it due? I want to pay my rent, now.",
            "bill_due,pay_bill",
            "cataphora"
        ],
        [
            "What day is it due? I would like to pay my cellphone bill soon.",
            "bill_due,pay_bill",
            "cataphora"
        ],
        [
            "I may have had fraud committed on my account and I need to put a hold on it.",
            "report_fraud,freeze_account",
            "anaphora"
        ],
        [
            "I want to report fraudulent activity on my amex card, and also to freeze my bank account.",
            "report_fraud,freeze_account",
            "ellipsis"
        ],
        [
            "I need help investigating a suspicious transaction, as well as freezing my bank account.",
            "report_fraud,freeze_account",
            "ellipsis"
        ],
        [
            "I see a fraudulent transaction from netflix on my account. I need you to freeze it.",
            "report_fraud,freeze_account",
            "anaphora"
        ],
        [
            "I think there's fraud on my account. I would appreciate it, if you put a stop on it.",
            "report_fraud,freeze_account",
            "anaphora"
        ],
        [
            "There's a shady charge from comcast on my account and i need you to block it now.",
            "report_fraud,freeze_account",
            "anaphora"
        ],
        [
            "It looks like someone made an unauthorized amazon purchase on my account and i need to pause it.",
            "report_fraud,freeze_account",
            "anaphora"
        ],
        [
            "Help me tell visa about a fraud attempt on it, I mean my account, because i need it frozen.",
            "report_fraud,freeze_account",
            "cataphora"
        ],
        [
            "I spotted a fraudulent transaction from microsoft on it, I mean my account, which I need it frozen.",
            "report_fraud,freeze_account",
            "cataphora"
        ],
        [
            "There is a fraudulent charge for paypal on it, so I would like to place a hold on my bank account immediately.",
            "report_fraud,freeze_account",
            "cataphora"
        ],
        [
            "I want to report a broken card, as well as to know when my new one will come in.",
            "damaged_card,replacement_card_duration",
            "ellipsis"
        ],
        [
            "I need to report my bent card, and request a new credit card.",
            "damaged_card,replacement_card_duration",
            "ellipsis"
        ],
        [
            "My card got snapped in half. How long does it take to get a new one?",
            "damaged_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "Due to damage, my card is unusable; how long will it take for a new one to be mailed to me?",
            "damaged_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "Please report that I split my card, and could you provide the typical time it takes for a new one to arrive?",
            "damaged_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "My card doesn't function anymore and when is the earliest date I can get my new one?",
            "damaged_card,replacement_card_duration",
            "anaphora"
        ],
        [
            "Report that my card has been wrecked and how long does it take for the new card to come in the mail?",
            "damaged_card,replacement_card_duration",
            "anaphora"
        ],
        [
            "My card isn't working. How many days does it take to receive my replacement card?",
            "damaged_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "I broke it, i mean my card, so when can I expect my replacement?",
            "damaged_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "I broke it, i mean my card, so do you know when my replacement will arrive?",
            "damaged_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "Tell me the procedure for changing oil in a car and how soon should I have it changed.",
            "oil_change_how,oil_change_when",
            "anaphora"
        ],
        [
            "Is it easy to change the oil in my car and when will I need to change it again?",
            "oil_change_how,oil_change_when",
            "anaphora"
        ],
        [
            "Teach me how to change my oil and how often should I have it changed.",
            "oil_change_how,oil_change_when",
            "anaphora"
        ],
        [
            "Can you show me how to change the oil in my car and how often I should do so, too",
            "oil_change_how,oil_change_when",
            "ellipsis"
        ],
        [
            "Can you tell me how to change the oil in my car and when should I have it changed?",
            "oil_change_how,oil_change_when",
            "ellipsis"
        ],
        [
            "I need a manual on how to change the oil and how often I need to.",
            "oil_change_how,oil_change_when",
            "ellipsis"
        ],
        [
            "Teach me how to change my oil and when I have to.",
            "oil_change_how,oil_change_when",
            "ellipsis"
        ],
        [
            "I would like to know how to perform an oil change and when I need to do it, too",
            "oil_change_how,oil_change_when",
            "ellipsis"
        ],
        [
            "How do I change the oil in a car and how can I tell if I need to.",
            "oil_change_how,oil_change_when",
            "ellipsis"
        ],
        [
            "In addition to knowing the procedure for changing it, I also want to know when I have to change the oil.",
            "oil_change_how,oil_change_when",
            "cataphora"
        ],
        [
            "On which day will I get paid and which one will I take off work?",
            "payday,pto_used",
            "anaphora"
        ],
        [
            "Remind me of the date of my last paycheck, as well as the usage of my vacation days.",
            "payday,pto_used",
            "ellipsis"
        ],
        [
            "Find my next payday, and the total number of vacation days I've used, too.",
            "payday,pto_used",
            "ellipsis"
        ],
        [
            "Tell me my next payday and the amount of vacation days I've used for vacation, too.",
            "payday,pto_used",
            "anaphora"
        ],
        [
            "Let me know when I'm going to be paid and what the total vacation days I've gone through.",
            "payday,pto_used",
            "ellipsis"
        ],
        [
            "Please find the receipt date for my last paycheck, as well as the extent of the pto I've taken so far.",
            "payday,pto_used",
            "ellipsis"
        ],
        [
            "How many days until my next payday and how many of them I have taken off?",
            "payday,pto_used",
            "anaphora"
        ],
        [
            "\nHow many days have I taken off so far, and how many until my next payday?",
            "payday,pto_used",
            "ellipsis"
        ],
        [
            "Check to see how many days off I have used, and how many until my next payday?",
            "payday,pto_used",
            "ellipsis"
        ],
        [
            "How many vacation days have I used up and how many until my next payday?",
            "payday,pto_used",
            "ellipsis"
        ],
        [
            "What does my shopping list involve, because I need everything on it to be ordered.",
            "shopping_list,order",
            "anaphora"
        ],
        [
            "Read me my shopping list, then I want everything on it to be ordered.",
            "shopping_list,order",
            "anaphora"
        ],
        [
            "Show me my shopping list and order all the things on it.",
            "shopping_list,order",
            "anaphora"
        ],
        [
            "I need to know what is on my shopping list and I'd like to order everything on it.",
            "shopping_list,order",
            "anaphora"
        ],
        [
            "What are the contents of my shopping list? I want to order everything on it.",
            "shopping_list,order",
            "anaphora"
        ],
        [
            "Can you tell what's on my shopping list and order all the things on it.",
            "shopping_list,order",
            "anaphora"
        ],
        [
            "Tell me all the books that are on my shopping list and purchase them all.",
            "shopping_list,order",
            "ellipsis"
        ],
        [
            "Tell me all the things that are on the shopping list, and buy them.",
            "shopping_list,order",
            "ellipsis"
        ],
        [
            "Provide me with the items on my shopping list, and proceed to order them.",
            "shopping_list,order",
            "ellipsis"
        ],
        [
            "What did I include on it, I mean on the shopping list, because I want all the things to be ordered.",
            "shopping_list,order",
            "cataphora"
        ],
        [
            "Find out the expiry date of my credit card, and the current status of my new credit card application.",
            "expiration_date,application_status",
            "ellipsis"
        ],
        [
            "Do you know the expiry date of my visa card, as well as the status of my new credit card application?",
            "expiration_date,application_status",
            "ellipsis"
        ],
        [
            "Tell me the expiration month of my card, and the status of my credit card application.",
            "expiration_date,application_status",
            "ellipsis"
        ],
        [
            "Tell me the remaining days till my credit card expires, and when will my new credit card application will be processed.",
            "expiration_date,application_status",
            "ellipsis"
        ],
        [
            "What is the validity of my credit card and how long it takes to process my new credit card application?",
            "expiration_date,application_status",
            "cataphora"
        ],
        [
            "Give me the expiration date for my current credit card and the status of my new visa card application.",
            "expiration_date,application_status",
            "ellipsis"
        ],
        [
            "Please let me know when I need to renew my credit card, and the status of the new application I filed.",
            "expiration_date,application_status",
            "ellipsis"
        ],
        [
            "While needing to do some things on it, please find the expiration month listed and check the status of my credit card application.",
            "expiration_date,application_status",
            "cataphora"
        ],
        [
            "Whats the expiration date on it, I mean my credit card and could you check and find out the current status of my credit card application?",
            "expiration_date,application_status",
            "cataphora"
        ],
        [
            "On it, I mean my credit card, what's the expiration date? Plus, could you check and find out the current status of my credit card application?",
            "expiration_date,application_status",
            "cataphora"
        ],
        [
            "Tell me the gas mileage on my car, and the recommended time frame to change my oil.",
            "mpg,oil_change_when",
            "ellipsis"
        ],
        [
            "Is it possible to retrieve my current mpg on my car and then tell me how do I know when I need an oil change?",
            "mpg,oil_change_when",
            "cataphora"
        ],
        [
            "Retrieve my current mpg on my car, and also the average time between oil changes.",
            "mpg,oil_change_when",
            "ellipsis"
        ],
        [
            "Can you tell me the mpg of this car, and the date of its next oil change?",
            "mpg,oil_change_when",
            "ellipsis"
        ],
        [
            "With my car, what's the fuel economy and when is it due for an oil change.",
            "mpg,oil_change_when",
            "anaphora"
        ],
        [
            "What mpg does my car get and when should I change its oil?",
            "mpg,oil_change_when",
            "anaphora"
        ],
        [
            "What mpg does my car get and when should I change the oil in it?",
            "mpg,oil_change_when",
            "anaphora"
        ],
        [
            "Does my car get good mpg in the city and how long does its oil last?",
            "mpg,oil_change_when",
            "anaphora"
        ],
        [
            "How expensive is it to fuel this car and when is it appropriate to change my car's oil?",
            "mpg,oil_change_when",
            "cataphora"
        ],
        [
            "How much does it take to fuel this car and when should I change the oil in my car?",
            "mpg,oil_change_when",
            "cataphora"
        ],
        [
            "Get me the apr on my visa card and can I raise the limit on it?",
            "apr,credit_limit_change",
            "anaphora"
        ],
        [
            "What's the annual rate on my discover card and is it possible to raise the limit on it?",
            "apr,credit_limit_change",
            "anaphora"
        ],
        [
            "How much do I pay in apr on my amex card and can I raise the limit on it?",
            "apr,credit_limit_change",
            "anaphora"
        ],
        [
            "What is the apr on my american express card and can I increase the limit on it?",
            "apr,credit_limit_change",
            "anaphora"
        ],
        [
            "What's my apr on it, i mean my mastercard, and can I increase my limit on it?",
            "apr,credit_limit_change",
            "cataphora"
        ],
        [
            "How much is my apr on it, I mean my mastercard, and may I raise my limit on it?",
            "apr,credit_limit_change",
            "cataphora"
        ],
        [
            "Do you know my credit card's apr, as well as a way to get a higher limit on my bank of america card?",
            "apr,credit_limit_change",
            "ellipsis"
        ],
        [
            "Is it possible to give me my credit card's apr and to increase the credit limit on my discover card?",
            "apr,credit_limit_change",
            "cataphora"
        ],
        [
            "Tell me the apr of my credit card, and if I can get a higher limit on my visa.",
            "apr,credit_limit_change",
            "ellipsis"
        ],
        [
            "What is the apr on my visa card and is it possible to increase its credit limit?",
            "apr,credit_limit_change",
            "anaphora"
        ],
        [
            "Give me the apr for my credit card, and the credit limit for my citibank card.",
            "apr,credit_limit",
            "ellipsis"
        ],
        [
            "I need to know the apr for my visa card, as well as the credit limit on my discover card.",
            "apr,credit_limit",
            "ellipsis"
        ],
        [
            "Please tell my credit card's apr, and my visa card's limit.",
            "apr,credit_limit",
            "ellipsis"
        ],
        [
            "Can you inform me what my apr is on my visa card, and provide its maximum credit limit?",
            "apr,credit_limit",
            "anaphora"
        ],
        [
            "Tell me the apr of my hy-vee card, and the maximum credit limit.",
            "apr,credit_limit",
            "ellipsis"
        ],
        [
            "Could you provide the apr for the credit card, as well as the credit limit associated with it?",
            "apr,credit_limit",
            "ellipsis"
        ],
        [
            "I want to know the apr on my amex card, as well as the credit limit on my visa card.",
            "apr,credit_limit",
            "ellipsis"
        ],
        [
            "I need to know the apr for my visa card and what's the limit on it.",
            "apr,credit_limit",
            "anaphora"
        ],
        [
            "I'd like to know the apr on my visa card and its credit limit.",
            "apr,credit_limit",
            "anaphora"
        ],
        [
            "What is the apr on my discover card and how much am I allowed to spend on it ?",
            "apr,credit_limit",
            "anaphora"
        ],
        [
            "Let me know the credit limit for my credit card and is it possible to increase the credit limit on my mastercard?",
            "credit_limit,credit_limit_change",
            "cataphora"
        ],
        [
            "What's my current limit on my mastercard and is it possible to get a new credit limit of $10,000?",
            "credit_limit,credit_limit_change",
            "cataphora"
        ],
        [
            "What is my credit limit? I need to increase it for my visa credit card, can you assist me?",
            "credit_limit,credit_limit_change",
            "anaphora"
        ],
        [
            "Would you tell me my spending limit, because I want it changed.",
            "credit_limit,credit_limit_change",
            "anaphora"
        ],
        [
            "Give me my credit limit, and then increase it to $1000.",
            "credit_limit,credit_limit_change",
            "anaphora"
        ],
        [
            "I need to know my spending limit on my visa and can I get a credit increase on it?",
            "credit_limit,credit_limit_change",
            "anaphora"
        ],
        [
            "What's the credit limit on my visa, because I want help to change it.",
            "credit_limit,credit_limit_change",
            "anaphora"
        ],
        [
            "What's my current limit on my visa and tell me if I can get a higher limit on it.",
            "credit_limit,credit_limit_change",
            "anaphora"
        ],
        [
            "What I want to know is the credit limit on it, my current card I mean. I would also like to inquire about the possibility of increasing the credit limit on my Target card.",
            "credit_limit,credit_limit_change",
            "cataphora"
        ],
        [
            "On it, what I mean is my mastercard, what is my spending limit and may I have a higher limit on this mastercard?",
            "credit_limit,credit_limit_change",
            "cataphora"
        ],
        [
            "Please let me know when my car was last checked and if I can schedule its service.",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "When did I last take my car to the mechanic, because I have to schedule its service.",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "Tell me when my car last had its oil changed, and please schedule a time to get it changed.",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "Find out how long it has been since my car was last in the shop. I need to schedule its service, too.",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "Find the date of the last oil swap for my car, because I need to schedule its maintenance.",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "Find the date of my last oil change, then a mechanic.",
            "last_maintenance,schedule_maintenance",
            "ellipsis"
        ],
        [
            "Give me the date of my most recent oil change and arrange an appointment for a new one.",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "When was my car last in the shop, I want to schedule its service.",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "Please tell me the last time I took my car to the shop and how do I schedule its maintenance?",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "When did I last have it in the shop? My car needs fixing, so I want to schedule a car maintenance.",
            "last_maintenance,schedule_maintenance",
            "cataphora"
        ],
        [
            "I would like to know why my card was declined and are there extra fees for using it in mexico?",
            "card_declined,international_fees",
            "anaphora"
        ],
        [
            "Is my card working properly and will I pay extra if I use it in Juarez?",
            "card_declined,international_fees",
            "anaphora"
        ],
        [
            "Can you tell me why my card was declined and will I get charged extra for using it in Denver?",
            "card_declined,international_fees",
            "anaphora"
        ],
        [
            "It was declined yesterday, I mean my card, and I want to know why. If I use my card in Tahiti, will I get charged extra?",
            "card_declined,international_fees",
            "cataphora"
        ],
        [
            "Let me know why my card got declined the other day and is there a charge to use it in Japan?",
            "card_declined,international_fees",
            "anaphora"
        ],
        [
            "Find out what happened and it got declined yesterday, my card, I mean. Also, will I be charged if I use my card in dublin?",
            "card_declined,international_fees",
            "cataphora"
        ],
        [
            "Find out the issue with my card yesterday, as well as the international transactions fees on my industrial bank card.",
            "card_declined,international_fees",
            "ellipsis"
        ],
        [
            "I want to know the reason why whole foods declined my card, as well as the fee for international transactions on my visa card",
            "card_declined,international_fees",
            "ellipsis"
        ],
        [
            "How come my card was not accepted yesterday? Will I be charged if I use it in france?",
            "card_declined,international_fees",
            "anaphora"
        ],
        [
            "In addition to why it didn't work yesterday, what are the fees for using my card in Toronto?",
            "card_declined,international_fees",
            "cataphora"
        ],
        [
            "Access my job portal and inform me of the number of days I've taken off, as well as whether there is a holiday scheduled for next week.",
            "pto_used,next_holiday",
            "ellipsis"
        ],
        [
            "About how many vacation days have I had and when is my next one?",
            "pto_used,next_holiday",
            "anaphora"
        ],
        [
            "What's the total number of vacation days I've gone through, and when is my next one?",
            "pto_used,next_holiday",
            "anaphora"
        ],
        [
            "How many days did I take off and were any of them for holidays this month?",
            "pto_used,next_holiday",
            "anaphora"
        ],
        [
            "I need to know how many days so far I've taken off and how many more until my next paid day off?",
            "pto_used,next_holiday",
            "ellipsis"
        ],
        [
            "How many vacation days have I used up and how many until my next paid day off?",
            "pto_used,next_holiday",
            "ellipsis"
        ],
        [
            "Tell me how many days I've taken off at this point and how many until I am off again.",
            "pto_used,next_holiday",
            "ellipsis"
        ],
        [
            "How many days have I taken off so far and how many until the next holiday?",
            "pto_used,next_holiday",
            "ellipsis"
        ],
        [
            "How many days have I taken off this year and how many till we are off again?",
            "pto_used,next_holiday",
            "ellipsis"
        ],
        [
            "Tell me how many days i've taken off at this point and how many days until my next day off.",
            "pto_used,next_holiday",
            "ellipsis"
        ],
        [
            "How do you say \"i need coffee\" in dutch, also switch your language setting to it.",
            "translate,change_language",
            "anaphora"
        ],
        [
            "How do they say \"who is your father\" in german and then switch your language to it.",
            "translate,change_language",
            "anaphora"
        ],
        [
            "Can you translate \"milk\" for me and then switch your language to it?",
            "translate,change_language",
            "anaphora"
        ],
        [
            "Can you translate \"cat\" into russian for me and switch your language setting to it.",
            "translate,change_language",
            "anaphora"
        ],
        [
            "Translate \"hello\" for me into french and is it possible to only talk in spanish?",
            "translate,change_language",
            "cataphora"
        ],
        [
            "Do you know how to say \"where is the restroom\" in french and is it possible to only talk in mexican?",
            "translate,change_language",
            "cataphora"
        ],
        [
            "What is the equivalent of \"life is good\" in French, and please provide your responses in it from now on.",
            "translate,change_language",
            "anaphora"
        ],
        [
            "Can you translate \"hi\" for me into spanish and please change your language setting to it.",
            "translate,change_language",
            "anaphora"
        ],
        [
            "How can I thank somebody in italian? I want you to talk to me in it from now on.",
            "translate,change_language",
            "anaphora"
        ],
        [
            "How do they say \"what's up\" in chinese, please speak to me in it.",
            "translate,change_language",
            "anaphora"
        ],
        [
            "Please check the amount of gas I have, then the type of fuel to use with this car.",
            "gas,gas_type",
            "ellipsis"
        ],
        [
            "How much gas does my car have, and which type of it do I need to use?",
            "gas,gas_type",
            "anaphora"
        ],
        [
            "I need to know how much gas I have. Oh, look up the type of fuel I need for it, too.",
            "gas,gas_type",
            "anaphora"
        ],
        [
            "Tell me the amount of gas I have, and the type of gas this car uses.",
            "gas,gas_type",
            "ellipsis"
        ],
        [
            "Tell me the amount of gas I have remaining, and also the type of gasoline this car requires.",
            "gas,gas_type",
            "ellipsis"
        ],
        [
            "What is the amount of gas is left in my car, and also what kind of gas should I use to fill it up?",
            "gas,gas_type",
            "anaphora"
        ],
        [
            "How much gas does my car have, and which type of gas does it require?",
            "gas,gas_type",
            "anaphora"
        ],
        [
            "Does my car have enough gas to get to Chicago and does it need specific fuel?",
            "gas,gas_type",
            "anaphora"
        ],
        [
            "How much gas is left in the tank, and what kind of gas should I put in it ?",
            "gas,gas_type",
            "anaphora"
        ],
        [
            "Can my car get to dallas with the gas currently in my tank and what gas does it use?",
            "gas,gas_type",
            "anaphora"
        ],
        [
            "Could you please schedule a meeting with Carrie and Lisa and am I meeting with them today?",
            "schedule_meeting,meeting_schedule",
            "anaphora"
        ],
        [
            "How can I set a meeting with Ben and do I have one scheduled with him today?",
            "schedule_meeting,meeting_schedule",
            "ellipsis"
        ],
        [
            "Help me schedule a meeting and are there any on the schedule for today?",
            "schedule_meeting,meeting_schedule",
            "ellipsis"
        ],
        [
            "Set up a meeting with Frank at 2pm tomorrow and do I have a meeting with him today?",
            "schedule_meeting,meeting_schedule",
            "anaphora"
        ],
        [
            "Is it possible to schedule a meeting between 10 and 11 and do I have any meetings with Stan today?",
            "schedule_meeting,meeting_schedule",
            "cataphora"
        ],
        [
            "Is it possible to book a meeting room between 10 and 11 and are there any meetings for today on my calendar?",
            "schedule_meeting,meeting_schedule",
            "cataphora"
        ],
        [
            "Show me how to schedule a meeting and did I schedule any for today?",
            "schedule_meeting,meeting_schedule",
            "ellipsis"
        ],
        [
            "Can you schedule a meeting with John for tomorrow at 12 and do you see any meetings with him on my schedule today?",
            "schedule_meeting,meeting_schedule",
            "anaphora"
        ],
        [
            "Can you create a meeting with Steve tomorrow at the office and what time is my meeting with him today?",
            "schedule_meeting,meeting_schedule",
            "anaphora"
        ],
        [
            "Can you schedule a meeting with George at the office and do I have any with Stan today?",
            "schedule_meeting,meeting_schedule",
            "ellipsis"
        ],
        [
            "Add \"schedule appraiser appointment\" to my to do list and did I remember to add milk to the shopping one?",
            "todo_list_update,shopping_list",
            "anaphora"
        ],
        [
            "Add \"meeting with Carla\" on my to do list and provide the list of items on my shopping one.",
            "todo_list_update,shopping_list",
            "anaphora"
        ],
        [
            "Delete everything on my to do list, then show me my shopping one.",
            "todo_list_update,shopping_list",
            "anaphora"
        ],
        [
            "Remove all items from todo list and what kind of items are on my shopping one?",
            "todo_list_update,shopping_list",
            "anaphora"
        ],
        [
            "Add dishes to my todo list and could you also let me know what's on my shopping one?",
            "todo_list_update,shopping_list",
            "anaphora"
        ],
        [
            "Remove laundry from my todo list, and shampoo from my shopping list.",
            "todo_list_update,shopping_list",
            "ellipsis"
        ],
        [
            "Delete everything from the task list, and corn from my shopping list.",
            "todo_list_update,shopping_list",
            "ellipsis"
        ],
        [
            "Add cleaning on task list, and soda on my shopping list.",
            "todo_list_update,shopping_list",
            "ellipsis"
        ],
        [
            "Add laundry to my todo list, and cherrios to the grocery list.",
            "todo_list_update,shopping_list",
            "ellipsis"
        ],
        [
            "Delete ice cream from my shopping list, as well as an event from my calendar.",
            "todo_list_update,shopping_list",
            "ellipsis"
        ],
        [
            "Could you find me a recipe for sugar cookies, and also provide information about the number of calories in them?",
            "recipe,calories",
            "anaphora"
        ],
        [
            "How do I make the perfect omelette, and what is the calorie count for it?",
            "recipe,calories",
            "anaphora"
        ],
        [
            "What's a good recipe for Chicken Divan, and could you also provide the calorie count for its chicken breast?",
            "recipe,calories",
            "anaphora"
        ],
        [
            "Find me a recipe for teriyaki chicken, and then inform me of its calorie count.",
            "recipe,calories",
            "anaphora"
        ],
        [
            "What's the best way to roast this chicken, and could you provide the calorie count for it?",
            "recipe,calories",
            "anaphora"
        ],
        [
            "How do I cook fried eggs and what's the calorie content of them?",
            "recipe,calories",
            "anaphora"
        ],
        [
            "Can you find me a recipe for chocolate cake, and could you also provide the calorie count for it?",
            "recipe,calories",
            "anaphora"
        ],
        [
            "Give me an apple pie recipe, along with the calorie content of a medium size apple.",
            "recipe,calories",
            "ellipsis"
        ],
        [
            "Could you find me a pasta recipe, and provide the total calories for two servings of it?",
            "recipe,calories",
            "anaphora"
        ],
        [
            "Provide a tuna salad recipe and the calorie content of the tuna.",
            "recipe,calories",
            "ellipsis"
        ],
        [
            "Find my phone, and then unsync from it.",
            "find_phone,sync_device",
            "anaphora"
        ],
        [
            "I need assistance finding my phone, and desyncing it.",
            "find_phone,sync_device",
            "anaphora"
        ],
        [
            "While finding it, please first unsync from my phone.",
            "find_phone,sync_device",
            "cataphora"
        ],
        [
            "Since I don't remember where it is, could you find my phone? Also, connect with it.",
            "find_phone,sync_device",
            "cataphora"
        ],
        [
            "My phone cannot be found. Can you connect to it, now?",
            "find_phone,sync_device",
            "anaphora"
        ],
        [
            "Since I don't know where it is, could you locate my phone and also help me connect to it?",
            "find_phone,sync_device",
            "cataphora"
        ],
        [
            "Since I misplaced it, could you find my phone, please? Could you also try unsyncing it now?",
            "find_phone,sync_device",
            "cataphora"
        ],
        [
            "Since it cannot be found, could you please try finding my phone? After that, go ahead and unsync my phone.",
            "find_phone,sync_device",
            "cataphora"
        ],
        [
            "Can you track the location of my phone and also remove the sync from it?",
            "find_phone,sync_device",
            "anaphora"
        ],
        [
            "Alexa, could you please tell me the location of my phone and connect to it?",
            "find_phone,sync_device",
            "anaphora"
        ],
        [
            "Could you tell me your name, and is it possible for me to change it to Bob?",
            "what_is_your_name,change_ai_name",
            "cataphora"
        ],
        [
            "Is there a specific name I should call you, as I'd like to change it to Theodore?",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "Please tell me your name; I need to change it to Amanda.",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "Ai, what's your name, because from now on it will be \"buttercup\".",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "I must know it, because from now on, your name will be \"josh\"",
            "what_is_your_name,change_ai_name",
            "cataphora"
        ],
        [
            "When referring to you, what name should I use? Can you go by a different one?",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "What's your name, AI ? Because from now it will be \"Queen\".",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "Tell me your name, because from now on it will be \"lord vader\".",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "State your name, then allow me to change it to Dina.",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "Please tell me your name, and then change it to Samantha.",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "How do they say \"where's the bathroom\" in spanish and find all the \"a\"s in it.",
            "translate,spelling",
            "anaphora"
        ],
        [
            "How do they say \"no\" in German and can you spell it?",
            "translate,spelling",
            "anaphora"
        ],
        [
            "Can you give me a translation for \"hello\" in brazil, as well as a spelling for \"antipathy\" in mandarin?",
            "translate,spelling",
            "ellipsis"
        ],
        [
            "Give me the translation of 'potato' in spanish, then the spelling.",
            "translate,spelling",
            "ellipsis"
        ],
        [
            "I want to learn a phrase in Russian and then its spelling in Spanish.",
            "translate,spelling",
            "ellipsis"
        ],
        [
            "Can you translate milk into spanish for me? What's the correct way to spell that?",
            "translate,spelling",
            "anaphora"
        ],
        [
            "Tell me how to say, ''it is a beautiful morning''in italian, along with its spelling.",
            "translate,spelling",
            "anaphora"
        ],
        [
            "Can you tell me how to say \" do not speak much spanish\", in spanish. How do you spell it, too?",
            "translate,spelling",
            "anaphora"
        ],
        [
            "Can you translate \"bowl\" into russian for me and then provide me with its spelling?",
            "translate,spelling",
            "anaphora"
        ],
        [
            "Can you translate \"hello\" into swedish for me and then provide me with its complete spelling?",
            "translate,spelling",
            "anaphora"
        ],
        [
            "What's the current song that we are listening to at this time, and could you also skip to the next one?",
            "what_song,next_song",
            "anaphora"
        ],
        [
            "I need to know what this song is called. Could you give me the next one, too?",
            "what_song,next_song",
            "anaphora"
        ],
        [
            "Can you tell me the title of this song and then move to the next one?",
            "what_song,next_song",
            "anaphora"
        ],
        [
            "What's the song that am I hearing? Then, hop to the next one.",
            "what_song,next_song",
            "anaphora"
        ],
        [
            "What song is playing? I want to listen to another one.",
            "what_song,next_song",
            "anaphora"
        ],
        [
            "Give me the title of this track and then play the next one.",
            "what_song,next_song",
            "anaphora"
        ],
        [
            "After telling me its name, this song, I mean, play the next one.",
            "what_song,next_song",
            "cataphora"
        ],
        [
            "While wanting to know its name, i mean of the song that is on the speakers, play the next one.",
            "what_song,next_song",
            "cataphora"
        ],
        [
            "While needing to know its title, i mean of the song that it is playing, I want to hear the next one.",
            "what_song,next_song",
            "cataphora"
        ],
        [
            "Can you tell me the name of this song and then move to the next one?",
            "what_song,next_song",
            "anaphora"
        ],
        [
            "How long does it take to cook? I've had the pizza in the fridge since Monday, so is it safe to eat?",
            "cook_time,food_last",
            "cataphora"
        ],
        [
            "How long should I cook the frozen pizza? Also, I'd like to know how long I can keep it in the freezer before it goes bad.",
            "cook_time,food_last",
            "anaphora"
        ],
        [
            "How long do noodles need to cook? Additionally, if I have garlic from Sunday, is it still safe to use?",
            "cook_time,food_last",
            "cataphora"
        ],
        [
            "Ηοw long should I cook this pizza and how long can I leave it in the fridge?",
            "cook_time,food_last",
            "anaphora"
        ],
        [
            "How long should I cook the steak for and what is its expiration date?",
            "cook_time,food_last",
            "anaphora"
        ],
        [
            "How long should I fry these eggs and when will they go bad?",
            "cook_time,food_last",
            "anaphora"
        ],
        [
            "How long will this chicken take to cook? Can I eat it if it has been in the fridge since Monday?",
            "cook_time,food_last",
            "anaphora"
        ],
        [
            "How much time do I need to make this chicken? Will it have gone bad if it has been in the fridge since Monday?",
            "cook_time,food_last",
            "anaphora"
        ],
        [
            "How long does it take to roast my chicken? Can I expect its breast to be good before the expiration date?",
            "cook_time,food_last",
            "anaphora"
        ],
        [
            "How long do I cook pork? What is the recommended length of time I can leave it in the fridge?",
            "cook_time,food_last",
            "anaphora"
        ],
        [
            "Please change my name to Loverboy. You must tell me yours now.",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "I go by the name Jim. Give me yours now.",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "Change the name that you call me and who gave you yours?",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "My name is Bob and I need to know yours now.",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "Please change my name, then tell me yours.",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "My name is John. Oh, what's yours?",
            "change_user_name,what_is_your_name",
            "anaphora"
        ],
        [
            "My name is Stu, not Sue! Tell me yours now.",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "My name is Steve! Can I have yours please?",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "Please change my name to Loverboy. State yours.",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "The name I go by is sandy. What's yours?",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "I would like to know my current location. Could you please let Eric know about it?",
            "current_location,share_location",
            "anaphora"
        ],
        [
            "Aunt Sunny will be receiving my gps coordinates. Help me find them.",
            "current_location,share_location",
            "anaphora"
        ],
        [
            "Give my location right now to them. My family needs to know where I'm located, so please let me know.",
            "current_location,share_location",
            "cataphora"
        ],
        [
            "Can you tell me the address where i am right now? Then, give it to Bill and Craig,",
            "current_location,share_location",
            "anaphora"
        ],
        [
            "Please tell me my location using gps, then Darren and Stacey.",
            "current_location,share_location",
            "ellipsis"
        ],
        [
            "I need to know my current gps coordinates, then give them to base camp.",
            "current_location,share_location",
            "anaphora"
        ],
        [
            "While needing to find them, I mean my gps coordinates. Then, I also want to share my location with Melissa and Doug.",
            "current_location,share_location",
            "cataphora"
        ],
        [
            "Show me how to find my location, and share it with Noel.",
            "current_location,share_location",
            "anaphora"
        ],
        [
            "I would like them to be informed of my location, I mean Ms johannson and Ms Alba, so please share my location with them.",
            "current_location,share_location",
            "cataphora"
        ],
        [
            "How can I find my current location, cause i need you to let her know where i am. I mean, Miranda needs to know.",
            "current_location,share_location",
            "cataphora"
        ],
        [
            "Is it possible to rent a car from LaGuardia from Tuesday to Friday and schedule a Delta flight from Madison to Atlanta?",
            "car_rental,book_flight",
            "cataphora"
        ],
        [
            "Can you help me booked a car in london and i'd like a flight from itto orlando on southwest for under $400?",
            "car_rental,book_flight",
            "anaphora"
        ],
        [
            "Is it possible to rent a Ford in Austin from May 5th to May 7th of this year and to find a Southwest flight from Ft. Lauderdale to Houston?",
            "car_rental,book_flight",
            "cataphora"
        ],
        [
            "Book me a car rental in Dallas and I want to fly from it to phoenix.",
            "car_rental,book_flight",
            "anaphora"
        ],
        [
            "Where can i rent a car in chicago and also I want to book a flight from it to dc for Monday, returning on Wednesday.",
            "car_rental,book_flight",
            "anaphora"
        ],
        [
            "Please book a car rental in Seattle and a flight from NYC to LA on March 1, returning on March 5.",
            "car_rental,book_flight",
            "ellipsis"
        ],
        [
            "I need to book a car in Boston from March 2 until March 4 and then a flight out of Denver to Houston on Friday for under $250.",
            "car_rental,book_flight",
            "ellipsis"
        ],
        [
            "I want a BMW SUV from March 2nd to the 6th in Dallas and a flight from Tijuana to Guadalajara on Volaris.",
            "car_rental,book_flight",
            "ellipsis"
        ],
        [
            "Is a car rental available out of lax from Tuesday to Thursday and a flight from Ft.Lauderdale to Houston on Southwest?",
            "car_rental,book_flight",
            "ellipsis"
        ],
        [
            "A rental car needs to be booked in nashville and a flight from houston to phoenix with american airlines, too",
            "car_rental,book_flight",
            "ellipsis"
        ],
        [
            "Show me my grocery transactions, and the apr on my mastercard.",
            "transactions,apr",
            "ellipsis"
        ],
        [
            "I want to see my recent transaction on my citi card, and the annual rate on my discover card.",
            "transactions,apr",
            "ellipsis"
        ],
        [
            "Pull up my recent transactions on my mastercard and the apr on my chase visa.",
            "transactions,apr",
            "ellipsis"
        ],
        [
            "Please show me my recent transaction on my debit card, as well as the apr on my american express card.",
            "transactions,apr",
            "ellipsis"
        ],
        [
            "Find the list of transactions on my First Hawaiian Bank account and the annual rate on my Discover card.",
            "transactions,apr",
            "ellipsis"
        ],
        [
            "Bring up the transactions on my Amazon credit card and the APR on my debit card.",
            "transactions,apr",
            "ellipsis"
        ],
        [
            "What are my recent transactions on my credit card? Also, check its APR.",
            "transactions,apr",
            "anaphora"
        ],
        [
            "Please show me the transactions I made on the first of this month using my debit card and check the APR on it as well.",
            "transactions,apr",
            "anaphora"
        ],
        [
            "What were my last five transactions on my Visa card, and could you please tell me its APR as well?",
            "transactions,apr",
            "anaphora"
        ],
        [
            "What were my last five transactions on my Discover card? Also, I need to know its apr.",
            "transactions,apr",
            "anaphora"
        ],
        [
            "Tell me the limit on my amex card and set its pin to 1234.",
            "credit_limit_change,pin_change",
            "anaphora"
        ],
        [
            "I want my credit limit changed, as well as my pin on my savings account.",
            "credit_limit_change,pin_change",
            "ellipsis"
        ],
        [
            "Help me change my credit limit, as well as my pin.",
            "credit_limit_change,pin_change",
            "ellipsis"
        ],
        [
            "While increasing its card's limit, swap my amex card's pin to 1234, too",
            "credit_limit_change,pin_change",
            "cataphora"
        ],
        [
            "Is it possible to increase my Visa card limit? I also need to set my Visa card PIN to 1274.",
            "credit_limit_change,pin_change",
            "cataphora"
        ],
        [
            "How would I go about raising the card limit on my gold card? Then, change its pin to 1234 on account ending with digits 4994",
            "credit_limit_change,pin_change",
            "anaphora"
        ],
        [
            "Can I get a higher credit limit on my american express? Also, how do I update its pin number for my account?",
            "credit_limit_change,pin_change",
            "anaphora"
        ],
        [
            "Is there a way to increase the credit limit on my american express card? I want to change its pin number.",
            "credit_limit_change,pin_change",
            "cataphora"
        ],
        [
            "Can I have my credit limit changed, and my pin number on my visa card?",
            "credit_limit_change,pin_change",
            "ellipsis"
        ],
        [
            "Is it possible to have a higher limit on my visa and a new pin on my college fund account?",
            "credit_limit_change,pin_change",
            "cataphora"
        ],
        [
            "I think my luggage has been lost, as well as my pin for my retirement account.",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "I believe that my luggage was lost, as well as my pin for my bofa account.",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "It looks as though my luggage has been lost, and my pin, too.",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "I think my luggage got lost, and my pin number, too.",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "I need my lost luggage to be found, as well as my pin number.",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "It seems my luggage was lost, as well as my pin number.",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "what's the procedure to deal with lost luggage, and with pin?",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "I seem to have lost the pin on my bank account, as well as my luggage on panam flight.",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "What is the next step if my luggage was lost, as well as my pin?",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "My luggage is missing, as well as my pin number for my northfield account.",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "What is ai's age and where do you trace its roots?",
            "how_old_are_you,where_are_you_from",
            "anaphora"
        ],
        [
            "What is the age of Siri and its place of origin?",
            "how_old_are_you,where_are_you_from",
            "anaphora"
        ],
        [
            "What is the age of Alexa and its native home?",
            "how_old_are_you,where_are_you_from",
            "anaphora"
        ],
        [
            "What's your birthday and your hometown?",
            "how_old_are_you,where_are_you_from",
            "ellipsis"
        ],
        [
            "Lemme know when you were born and where?",
            "how_old_are_you,where_are_you_from",
            "ellipsis"
        ],
        [
            "Can you tell me when you were born and where?",
            "how_old_are_you,where_are_you_from",
            "ellipsis"
        ],
        [
            "I'd love to hear when you were born and where?",
            "how_old_are_you,where_are_you_from",
            "ellipsis"
        ],
        [
            "I am needing to know when you were born, as well as where.",
            "how_old_are_you,where_are_you_from",
            "ellipsis"
        ],
        [
            "What is the age of the ai and its birthplace?",
            "how_old_are_you,where_are_you_from",
            "anaphora"
        ],
        [
            "When were you given birth and where ?",
            "how_old_are_you,where_are_you_from",
            "ellipsis"
        ],
        [
            "Show me where my order is, and my phone, too.",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "Can you find my package, as well as my cellphone?",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "Would you track my package, and my phone?",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "Where is my order, as well as my phone?",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "Are you able to figure out where my package is and to track my phone?",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "Are you able to tack my package, as well as to link to my phone?",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "Check the status of my order, as well as the location of my phone.",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "Could you please track my package and my phone?",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "Can you check if my order was delivered, and also if my phone was found?",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "I'd like help finding my order, and my phone.",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "Read to me my to do list and add the chore of \"vacuuming\" to it.",
            "todo_list,todo_list_update",
            "anaphora"
        ],
        [
            "Tell me the content of my to do list today and then nuke all items on it.",
            "todo_list,todo_list_update",
            "anaphora"
        ],
        [
            "Can you tell me the tasks on my to-do list. Add \"do laundry\"on them",
            "todo_list,todo_list_update",
            "anaphora"
        ],
        [
            "Can you tell me the tasks on my to-do list and add \"do laundry\" to it?",
            "todo_list,todo_list_update",
            "anaphora"
        ],
        [
            "Do I have a car wash scheduled on my to do list? Add \"schedule appraiser\" to it",
            "todo_list,todo_list_update",
            "anaphora"
        ],
        [
            "Please remind me of the tasks on my to do list. Then, erase all items on it.",
            "todo_list,todo_list_update",
            "anaphora"
        ],
        [
            "After reminding me of the tasks on my to do list, then making it blank.",
            "todo_list,todo_list_update",
            "ellipsis"
        ],
        [
            "Did I add \"purchase tickets\" to the penguin game to my todo list, if not will you?",
            "todo_list,todo_list_update",
            "ellipsis"
        ],
        [
            "Did I add buy flowers to my chore list today, if not, will you?",
            "todo_list,todo_list_update",
            "ellipsis"
        ],
        [
            "Check my to do list to see if feeding the fish is on it. If not, then add it.",
            "todo_list,todo_list_update",
            "ellipsis"
        ],
        [
            "Change your language to french, as well as your accent to british.",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "I need to change the language to french, and the accent to female british.",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "Switch the language for your responses, and change your accent to the male british one.",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "Alter your language to dutch, and your accent to british.",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "I need your language setting to be Russian, and your accent to be British.",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "Replace my language to chinese, your accent to british.",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "How can I adjust the spoken language, as well as the accent?",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "Please make your language to french, as well as your voice to female.",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "I want your language changed to Italian, as well as the accent to British.",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "Is there an option to speak only in Mandarin, and in a male voice, too?",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "What time is it in north Korea and i'd like to know its timezone.",
            "time,timezone",
            "anaphora"
        ],
        [
            "I need to know what time is it in florida and its timezone, too.",
            "time,timezone",
            "anaphora"
        ],
        [
            "What time is it in las Vegas and what is its timezone?",
            "time,timezone",
            "anaphora"
        ],
        [
            "What time is it right now in Paris and how about its timezone?",
            "time,timezone",
            "anaphora"
        ],
        [
            "What time is it in New york and also what timezone is it in?",
            "time,timezone",
            "anaphora"
        ],
        [
            "Tell me what time is it in Russia, as well as its timezone?",
            "time,timezone",
            "anaphora"
        ],
        [
            "Do you have the time in Paris, as well as the timezone in France?",
            "time,timezone",
            "ellipsis"
        ],
        [
            "Give me the time in Punta gorda, Florida and the timezone in Denver.",
            "time,timezone",
            "ellipsis"
        ],
        [
            "Do you know the current time in Southern California, as well as the timezone in San Francisco?",
            "time,timezone",
            "ellipsis"
        ],
        [
            "Let me know the current time in the central timezone, and the timezone in Miami.",
            "time,timezone",
            "ellipsis"
        ],
        [
            "Find things to do in Nashville and travel alerts for it, too.",
            "travel_suggestion,travel_alert",
            "ellipsis"
        ],
        [
            "Give me some tourist suggestions for Jalisco, as well as the travel alerts.",
            "travel_suggestion,travel_alert",
            "ellipsis"
        ],
        [
            "Provide me with ideas of things we can do in charlotte, then the places that there are travel alerts for.",
            "travel_suggestion,travel_alert",
            "anaphora"
        ],
        [
            "What are some fun things I can partake in Atlanta and what are today's travel alerts for it?",
            "travel_suggestion,travel_alert",
            "anaphora"
        ],
        [
            "What festivals are there to see in Paris? I need a list of vaccinations for a trip to this city.",
            "travel_suggestion,travel_alert",
            "anaphora"
        ],
        [
            "What do tourists do in Tokyo and how many vaccinations will I need to travel to this city?",
            "travel_suggestion,travel_alert",
            "anaphora"
        ],
        [
            "What is there to do besides drink in Germany? Do I need specific shots before traveling to this country?",
            "travel_suggestion,travel_alert",
            "anaphora"
        ],
        [
            "Where is the best winery in the south of France? What shots do I need before heading to this region?",
            "travel_suggestion,travel_alert",
            "anaphora"
        ],
        [
            "What's fun to do in Jamaica? Would I need any immunization if I go to this country island?",
            "travel_suggestion,travel_alert",
            "anaphora"
        ],
        [
            "Before I leave for Mexico should I get some more vaccinations? What are some hot travel destinations for it?",
            "travel_suggestion,travel_alert",
            "anaphora"
        ],
        [
            "What do I have on my calendar list for easter, and what do I on my reminder list for my niece's graduation?",
            "calendar,reminder",
            "ellipsis"
        ],
        [
            "What do I have on my calendar for march 11 and also what are in my reminders list for this month?",
            "calendar,reminder",
            "anaphora"
        ],
        [
            "Please give me an overview of my calendar list, and a rundown of my reminder list.",
            "calendar,reminder",
            "ellipsis"
        ],
        [
            "Tell me what does my calendar list for easter look like, and what does my reminder list for our neighbor's anniversary, too",
            "calendar,reminder",
            "ellipsis"
        ],
        [
            "Can you tell me what reminders I've set, as well as what calendars I've scheduled, too,",
            "calendar,reminder",
            "ellipsis"
        ],
        [
            "Check my reminders for mop and floor, as well as my calendar for 30th birthday party.",
            "calendar,reminder",
            "ellipsis"
        ],
        [
            "Show me the reminder for Saturday and the calendar for this day.",
            "calendar,reminder",
            "anaphora"
        ],
        [
            "Let me know what's on my list of calendars and on my list of reminders, too.",
            "calendar,reminder",
            "ellipsis"
        ],
        [
            "Search my reminder for mop the floor, as well as my calendar for birthday party.",
            "calendar,reminder",
            "ellipsis"
        ],
        [
            "I wanted to remember some things, what were they? Let me know my march 2 calendar, too",
            "calendar,reminder",
            "anaphora"
        ],
        [
            "How many reward points have stacked up for my amex card. I would like to hear its latest transactions, too.",
            "rewards_balance,transactions",
            "anaphora"
        ],
        [
            "Check my points for visa card, then my transaction for First Hawaiian bank.",
            "rewards_balance,transactions",
            "ellipsis"
        ],
        [
            "What is the number of points I have earned with my MasterCard? Could you also provide me with the last transactions for it?",
            "rewards_balance,transactions",
            "anaphora"
        ],
        [
            "How can I check the balance and recent transactions on my Kohl's Rewards card?",
            "rewards_balance,transactions",
            "ellipsis"
        ],
        [
            "How many points did I earn on my Visa card? Also, please provide me with the details of its transactions from last month.",
            "rewards_balance,transactions",
            "anaphora"
        ],
        [
            "Where can I find my gold card rewards, as well as my recent transaction history?",
            "rewards_balance,transactions",
            "ellipsis"
        ],
        [
            "Check my rewards on my MasterCard and my transactions on my Citi card.",
            "rewards_balance,transactions",
            "ellipsis"
        ],
        [
            "Find out my rewards balance on my Chase card and my transactions on my First Bank card, too.",
            "rewards_balance,transactions",
            "ellipsis"
        ],
        [
            "Show my rewards for my visa card, and my transactions for my first bank card.",
            "rewards_balance,transactions",
            "ellipsis"
        ],
        [
            "What do I have to do to see my rewards on my Chase card and my transactions on my Amex card?",
            "rewards_balance,transactions",
            "ellipsis"
        ],
        [
            "When was my car last looked at? Also, could you please check its tire pressure?",
            "last_maintenance,tire_pressure",
            "anaphora"
        ],
        [
            "When was my car last in the shop? Could you also let me know its tire pressure?",
            "last_maintenance,tire_pressure",
            "anaphora"
        ],
        [
            "When did I last take my car in for maintenance, and what is its the current tire pressure?",
            "last_maintenance,tire_pressure",
            "anaphora"
        ],
        [
            "How long ago did my car get looked at? Are its tires under-inflated?",
            "last_maintenance,tire_pressure",
            "anaphora"
        ],
        [
            "Tell me the last time I had my car checked out at sam's repair shop. I would like an evaluation of its tire pressure.",
            "last_maintenance,tire_pressure",
            "anaphora"
        ],
        [
            "Check my calendar for the date that it was last serviced, I mean my car. Then tell me its tire pressure.",
            "last_maintenance,tire_pressure",
            "cataphora"
        ],
        [
            "When was it in the shop? The car is riding funny, does the tire pressure feel low to you, too?",
            "last_maintenance,tire_pressure",
            "cataphora"
        ],
        [
            "What date was it last at the mechanics, as the car feels wobbly. Then, check the tire pressure of my car",
            "last_maintenance,tire_pressure",
            "cataphora"
        ],
        [
            "Let me know when my car was last inspected and its current tire pressure.",
            "last_maintenance,tire_pressure",
            "ellipsis"
        ],
        [
            "When did I last get my car tuned up? Also, please let me know how low the air is in its tires.",
            "last_maintenance,tire_pressure",
            "anaphora"
        ],
        [
            "Tell me the date of my last car check-up and the number of miles per gallon this car gets on the highway.",
            "last_maintenance,mpg",
            "ellipsis"
        ],
        [
            "Find the last time I changed my oil and the gas mileage for my vehicle.",
            "last_maintenance,mpg",
            "ellipsis"
        ],
        [
            "When did I last have my vehicle checked ? Also please tell me its fuel economy.",
            "last_maintenance,mpg",
            "anaphora"
        ],
        [
            "When did I last bring my car in to get looked over, and what is its miles per gallon?",
            "last_maintenance,mpg",
            "anaphora"
        ],
        [
            "What was the date when Ι last had my car inspected? Also, please retrieve my current mpg on it.",
            "last_maintenance,mpg",
            "anaphora"
        ],
        [
            "Find out the last time I had my car checked, and its fuel economy.",
            "last_maintenance,mpg",
            "ellipsis"
        ],
        [
            "Please tell me the last time I took my car to the shop. What's its mpg, too?",
            "last_maintenance,mpg",
            "anaphora"
        ],
        [
            "When did I last have it fixed? My car, I mean. Ηow many miles per gallon does it get in the city?",
            "last_maintenance,mpg",
            "cataphora"
        ],
        [
            "When was the last time it got serviced? What is the city mpg for this car?",
            "last_maintenance,mpg",
            "cataphora"
        ],
        [
            "When did I take it to the mechanic? Also, does my car get good mpg on the highway?",
            "last_maintenance,mpg",
            "cataphora"
        ],
        [
            "Please text my mom and let her know I will be home soon. Additionally, please remove her birthday from the calendar.",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "Write a text to Jake and add his birthday party for Friday at 5.",
            "text,calendar_update",
            "anphora"
        ],
        [
            "Compose a text to Mom, telling her I'll talk to her later, and add her birthday to my calendar on April 12.",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "I want you to add my dentist's visit to the calendar for friday, then text my boss and tell him I'm on my way.",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "Please send a text to Phil and ask him about playing golf this weekend. Also, add \"delete my golf tournament event\" for tomorrow.",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "Can you text Kayla and Arthur and tell them I'm running late, after removing dinner with her from my calendar on March 1st?",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "Can you text my son, Christopher, and let him know I am on my way before removing the meeting with Carla from the calendar?",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "Can you text him that I'm on my way before Christopher gets on his nerves? Also, please add the meeting with Carla to my schedule for July 4th.",
            "text,calendar_update",
            "cataphora"
        ],
        [
            "Start a new text to Maureen and tell her I got Mom's Christmas present. Then, remove her birthday from the calendar.",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "Send a text to my cousin, Linda, that says 'Happy birthday,' then remove \"Celebrate anniversary\" from my calendar.",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "How long has it been since my car was at AutoZone? Inform me about the amount of gas it has.",
            "last_maintenance,gas",
            "anaphora"
        ],
        [
            "Find the date of the last oil swap for my car, and my current gas level.",
            "last_maintenance,gas",
            "ellipsis"
        ],
        [
            "Check my calendar for the date that my car was last serviced. Does it have enough gas to get to Chicago, too?",
            "last_maintenance,gas",
            "anaphora"
        ],
        [
            "When was my car last repaired, and what is the total amount of gas in it?",
            "last_maintenance,gas",
            "anaphora"
        ],
        [
            "Before telling me how long it's been since my car was at AutoZone, could you also let me know how much it costs to get it filled up?",
            "last_maintenance,gas",
            "anaphora"
        ],
        [
            "After letting me know when I last took my car to Paul's Auto, how much gas is in it?",
            "last_maintenance,gas",
            "anaphora"
        ],
        [
            "So when was the car in the shop? Does it have enough gas to get to Chicago?",
            "last_maintenance,gas",
            "anaphora"
        ],
        [
            "Please tell me the last time I took my car to the shop, as well as the amount of gas in my car right now.",
            "last_maintenance,gas",
            "ellipsis"
        ],
        [
            "When was the last time I took my car to the shop, and is the level of fuel in it enough to get me to work?",
            "last_maintenance,gas",
            "anaphora"
        ],
        [
            "After providing information about the last time I had it serviced, I also require an update on the amount of gas in my car.",
            "last_maintenance,gas",
            "cataphora"
        ],
        [
            "I need to know how to convert liters into pints, as well as dollars into yen.",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "Convert inch to cm, and yen into dollars.",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "Tell me how many meters are in 2 inches, and how many dollars in one mexican peso.",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "What is the conversion for pints to quarts, and for dollars to francs?",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "How do you convert ounces to pounds, as well as pounds to euros?",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "Convert inches to centimeters, as well as krugerrands to saudi riyal.",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "Convert cm to inch and kurus to euros.",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "I want to convert feet to inches, as well as dollars to francs.",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "Make a conversion between ounces and grams, as well as between dollars and pesos.",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "I need to know inches to centimeters conversion, and the dollar to peso, too.",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "When did I take my car to the mechanic, cause it's dead. Tell me how to jump start it.",
            "last_maintenance,jump_start",
            "anaphora"
        ],
        [
            "What was the date when I last had my car inspected because I want to replace its battery?",
            "last_maintenance,jump_start",
            "anaphora"
        ],
        [
            "When did I last have my vehicle checked? I need to do something about its dead battery.",
            "last_maintenance,jump_start",
            "anaphora"
        ],
        [
            "When did I last have my car fixed? What is the way to jump-start it?",
            "last_maintenance,jump_start",
            "anaphora"
        ],
        [
            "After reminding me when my car got serviced last, how do I jump-start its battery?",
            "last_maintenance,jump_start",
            "anaphora"
        ],
        [
            "How long has it been since my last auto maintenance, and how can I start it using a jump start?",
            "last_maintenance,jump_start",
            "anaphora"
        ],
        [
            "While telling when I last carried it to the shop, tell me also how to jump start my car, too.",
            "last_maintenance,jump_start",
            "cataphora"
        ],
        [
            "How long ago did it get looked at, because I need to give my car a jump?",
            "last_maintenance,jump_start",
            "cataphora"
        ],
        [
            "Find out how long it has been since my car was last in the shop and the number for AAA to help with its dead battery.",
            "last_maintenance,jump_start",
            "ellipsis"
        ],
        [
            "What was the last time I had it at the dealer for repairs, because help is needed to jump-start my car?",
            "last_maintenance,jump_start",
            "cataphora"
        ],
        [
            "I need you to find me a recipe for fried shrimp, and a meal suggestion for french dinner.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "Find a chow mein recipe for me, and a simple chinese recipe for dinner, too.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "Give me a recipe for german chocolate cake, as well as suggestion for a dinner recipe.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "I need a recipe for beef, as well as an indian dish for lunch.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "I need a recipe for beef, as well as a suggestion for dinner.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "I'd like to find recipe for pie, as well as dinner suggestions for thai food.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "I need a recipe for cake, as well as a dinner suggestion for mexican food.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "Find a good recipe for meatloaf, and a suggestion for a Peruvian meal.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "Give me a recipe for a beef casserole, and a good suggestion for Norse cuisine.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "Can you recommend a chow mein recipe, then a dish from Ethiopia?",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "I'm reporting fraudulent activity on my card, and I also cracked it. Could you order a new one?",
            "report_fraud,damaged_card",
            "anaphora"
        ],
        [
            "My card has purchases I don't recognize, and its plastic numbers are falling off.",
            "report_fraud,damaged_card",
            "anaphora"
        ],
        [
            "How do I report a fraudulent charge on it? My card is damaged and unusable, too.",
            "report_fraud,damaged_card",
            "cataphora"
        ],
        [
            "Report fraud on my card. Besides, it is damaged so I cannot use it.",
            "report_fraud,damaged_card",
            "anaphora"
        ],
        [
            "I think a thief used it, and then my card split in half, can I make a report?",
            "report_fraud,damaged_card",
            "cataphora"
        ],
        [
            "Besides thinking someone made an illegal charge to it, my card is not working, and I need to let them know.",
            "report_fraud,damaged_card",
            "cataphora"
        ],
        [
            "I didn't make these purchases on it; My card's magnetic strip is not working, too",
            "report_fraud,damaged_card",
            "cataphora"
        ],
        [
            "After reporting fraudulent activity on my card, I want you to know that the atm chewed it up.",
            "report_fraud,damaged_card",
            "anaphora"
        ],
        [
            "I need to report it, please, that there's been some fraudulent activity on my card, and that my card got melted in the dryer.",
            "report_fraud,damaged_card",
            "cataphora"
        ],
        [
            "I need to make a report due to fraudulent activity on my card, and I cannot use it since it is damaged.",
            "report_fraud,damaged_card",
            "anaphora"
        ],
        [
            "Set a 10-minute timer, then a 5 AM alarm, please.",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "Can you set a timer for 5 minutes and a 5 AM alarm, please?",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "Set a 3-minute timer, then a 7 AM alarm for me.",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "I set a timer for 10 minutes, you an alarm for three in the morning",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "I would like a 15 minute timer set, as well as an 6 AM alarm.",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "Ι'm cooking an egg, set timer for 3 mins, then an alarm to start work and another alarm to stop",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "Will you please set a 10-minute timer and a 6 AM alarm?",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "I need to set a timer, you an alarm for 9pm please",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "I set a timer for 10 minutes, you an alarm for three in the morning",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "set a timer for 35 minutes, I, an alarm for 5 am",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "Schedule the temperature in the ac, then my alarm.",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "Activate my furnace, then my alarm please",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "Set my oven to 350 please, then my alarm for 6am, please",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "turn tv on, I, an alarm",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "turn the fan on, I the alarm",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "turn lights on in my bedroom, I,the alarm",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "I would appreciate it if you help me turn the car on and also the alarm.",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "will you please get my furnace turned on; I my alarm",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "turn on the living room lights; I, the alarm",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "Can you see if I have my doors locked, as well as the alarm set.",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "Look for funny jokes, as well as for fun facts about tigers.",
            "tell_joke,fun_fact",
            "ellipsis"
        ],
        [
            "Will you tell a joke and a fact I may not know?",
            "tell_joke,fun_fact",
            "ellipsis"
        ],
        [
            "Do you know any good jokes about zebras, any unique trivia about beats headphones?",
            "tell_joke,fun_fact",
            "ellipsis"
        ],
        [
            "Before telling me something funny about rats, list some neat stuff about them.",
            "tell_joke,fun_fact",
            "anaphora"
        ],
        [
            "Tell me a joke about dogs and also what's a cool and interesting thing about them.",
            "tell_joke,fun_fact",
            "anaphora"
        ],
        [
            "Tell me something funny about cats and what would be a fun fact about them.",
            "tell_joke,fun_fact",
            "anaphora"
        ],
        [
            "Would you tell me a joke, then a random fact?",
            "tell_joke,fun_fact",
            "ellipsis"
        ],
        [
            "I would like to hear a funny joke, and also a fun fact.",
            "tell_joke,fun_fact",
            "ellipsis"
        ],
        [
            "Do you know any good jokes about lawyers, any trivia about the ocean?",
            "tell_joke,fun_fact",
            "ellipsis"
        ],
        [
            "Do you know any truly funny jokes aboutfood, any fun facts about the ocean?",
            "tell_joke,fun_fact",
            "ellipsis"
        ],
        [
            "I need to find my phone and my location.",
            "find_phone,current_location",
            "ellipsis"
        ],
        [
            "I am looking for my phone, as well as for my location.",
            "find_phone,current_location",
            "ellipsis"
        ],
        [
            "The location of my phone is unknown to me, as well as my current location.",
            "find_phone,current_location",
            "ellipsis"
        ],
        [
            "Find my phone, I, my current location",
            "find_phone,current_location",
            "ellipsis"
        ],
        [
            "Can you find my cellphone, as well as my current location?",
            "find_phone,current_location",
            "ellipsis"
        ],
        [
            "Please locate both my phone and me.",
            "find_phone,current_location",
            "ellipsis"
        ],
        [
            "Find my phone, and me.",
            "find_phone,current_location",
            "ellipsis"
        ],
        [
            "i can't find my cell and my location, so I need help locating them",
            "find_phone,current_location",
            "anaphora"
        ],
        [
            "I'd like help finding my phone, and my location, too.",
            "find_phone,current_location",
            "ellipsis"
        ],
        [
            "My phone is currently lost. Can you first find it, and share my location?",
            "find_phone,current_location",
            "anaphora"
        ],
        [
            "Show me a calendar, as well as my present location.",
            "date,current_location",
            "ellipsis"
        ],
        [
            "Show me the date, and my location.",
            "date,current_location",
            "ellipsis"
        ],
        [
            "I need to know today's date, as well as my location.",
            "date,current_location",
            "ellipsis"
        ],
        [
            "Please share today's date, as well as my current location.",
            "date,current_location",
            "ellipsis"
        ],
        [
            "Can you tell me the date today, as well as my present location right now?",
            "date,current_location",
            "ellipsis"
        ],
        [
            "I'd like to know the date tomorrow, as well as the location now.",
            "date,current_location",
            "ellipsis"
        ],
        [
            "Give me the date today, and my location now.",
            "date,current_location",
            "ellipsis"
        ],
        [
            "What will be the date tomorrow, and my location now?",
            "date,current_location",
            "ellipsis"
        ],
        [
            "Do you know the date, as well as my location?",
            "date,current_location",
            "ellipsis"
        ],
        [
            "Can you remind me of the date, and of my location, too?",
            "date,current_location",
            "ellipsis"
        ],
        [
            "I can't find my visa card and Ι want to report it as lost. Plus, how soon until you send me a replacement card?",
            "report_lost_card,replacement_card_duration"
        ],
        [
            "Can you report my td bank card as lost and how long will a new card take to come in the mail?",
            "report_lost_card,replacement_card_duration"
        ],
        [
            "My american saving bank was stolen. Furthermore, what date will my replacement card arrive on?",
            "report_lost_card,replacement_card_duration"
        ],
        [
            "I lost my purple credit card and need to report it. So, when can I expect my replacement card?",
            "report_lost_card,replacement_card_duration"
        ],
        [
            "I need to report a lost card, also will my credit card be mailed soon?",
            "report_lost_card,replacement_card_duration"
        ],
        [
            "What kind of gas mileage do I get, also when do I need my oil changed?",
            "mpg,oil_change_when"
        ],
        [
            "Ηow does this car do on its fuel, moreover how much longer until i need to get my oil changed?",
            "mpg,oil_change_when"
        ],
        [
            "How is this car's mpg on the highway, and when's the next time I gotta change my oil?",
            "mpg,oil_change_when"
        ],
        [
            "What's the car's mpg, and when's the next time I should get my oil changed?",
            "mpg,oil_change_when"
        ],
        [
            "\nHow's this car's fuel efficiency, and how can I tell when it's time to change my oil?",
            "mpg,oil_change_when"
        ],
        [
            "Τell me something funny about politics and what would be a fun fact about cats, too?",
            "tell_joke,fun_fact"
        ],
        [
            "Can you make me laugh and tell me a fun fact about computer?",
            "tell_joke,fun_fact"
        ],
        [
            "What funny joke do you know? Also, tell me interesting facts about lighthouses!",
            "tell_joke,fun_fact"
        ],
        [
            "Indicate something funny on the topic of food and tell me some amazing trivia about radios.",
            "tell_joke,fun_fact"
        ],
        [
            "Tell me a joke about cars and explain some trivia about Lebron James.",
            "tell_joke,fun_fact"
        ],
        [
            "Display my location on a map and also share my gps coordinates with my brother.",
            "current_location,share_location"
        ],
        [
            "Can you tell me how to figure out my current location? My friend Steve needs my gps coordinates. So, send Steve the location",
            "current_location,share_location"
        ],
        [
            "Please give me my gps coordinates and inform bill and craig of my location.",
            "current_location,share_location"
        ],
        [
            "Please tell me my present gps coordinates and share my location with my boss and my lawyer, too.",
            "current_location,share_location"
        ],
        [
            "Check out my location up on the map and let Shih Chieh see my location.",
            "current_location,share_location"
        ],
        [
            "Show me my transactions on clothes at macys. Also, what apr do I have with my credit card?",
            "transactions,apr"
        ],
        [
            "Can you list all of my online transactions for the month of January and also I need to know the apr on my credit union visa.",
            "transactions,apr"
        ],
        [
            "Show me my transactions on clothes at macys and what is the credit card apr at the moment, too?",
            "transactions,apr"
        ],
        [
            "I want to see my entertainment transactions and tell me how the apr on my hy-vee card is, too.",
            "transactions,apr"
        ],
        [
            "I want to see my entertainment transactions and can you look into whether my card has good apr or not?",
            "transactions,apr"
        ],
        [
            "Check my Discover card reward points balance and read me the last five transactions.",
            "rewards_balance,transactions"
        ],
        [
            "What is my Wells Fargo card's rewards balance, and show me the car transaction.",
            "rewards_balance,transactions"
        ],
        [
            "Have I earned a lot of points on my Capital one card, besides can you show me utility-related transactions?",
            "rewards_balance,transactions"
        ],
        [
            "What's the current reward amount on my visa and please show me my recent transaction.",
            "rewards_balance,transactions"
        ],
        [
            "Give my my current points on my marriot rewards card and also can I see my transactions on the 7th?",
            "rewards_balance,transactions"
        ],
        [
            "What day did I change my oil, also how many mpg does this car get?",
            "last_maintenance,mpg"
        ],
        [
            "When was the last time I had an oil change and what is the mpg on this car?",
            "last_maintenance,mpg"
        ],
        [
            "What was the date when I last had my car inspected, besides how good is the fuel usage for this vehicle?",
            "last_maintenance,mpg"
        ],
        [
            "Check to see when my car was last in the shop, and how much is my mpg?",
            "last_maintenance,mpg"
        ],
        [
            "When did I take my car to the mechanic and please look up at this car's mpg.",
            "last_maintenance,mpg"
        ],
        [
            "I want to know how old you are. Moreover, what town were you born in?",
            "how_old_are_you,where_are_you_from"
        ],
        [
            "How long have you been alive for ? Tell me where you're made.",
            "how_old_are_you,where_are_you_from"
        ],
        [
            "How old are you today and in what state were you born?",
            "how_old_are_you,where_are_you_from"
        ],
        [
            "Do you know exactly when you were born and where did you originate from?",
            "how_old_are_you,where_are_you_from"
        ],
        [
            "I want to know your age and did you grow up here?",
            "how_old_are_you,where_are_you_from"
        ],
        [
            "What time is it in russia and what timezone is Boise in?",
            "time,timezone"
        ],
        [
            "I need to know what time it is in Florida and in which timezone is Jamaica.",
            "time,timezone"
        ],
        [
            "Can you tell me the time and what is the time zone of France?",
            "time,timezone"
        ],
        [
            "What time is it in the central standard timezone and which timezone is Colombia?",
            "time,timezone"
        ],
        [
            "What is the current time in China and Detroit is in what timezone?",
            "time,timezone"
        ],
        [
            "My card's magnetic strip is not working, and I'd like to know how long it takes for a new card to be mailed to me.",
            "damaged_card,replacement_card_duration"
        ],
        [
            "Ι bent my card, can you report it to my bank and what's the average time it takes for a new card to arrive?",
            "damaged_card,replacement_card_duration"
        ],
        [
            "Unfortunately, my card is damaged and unusable and what would be the estimated time from to get a new card mailed to me?",
            "damaged_card,replacement_card_duration"
        ],
        [
            "My damage card is not working and when will you send me a replacement card?",
            "damaged_card,replacement_card_duration"
        ],
        [
            "My card got damaged, and I need to report it. Also, when will my replacement card be mailed?",
            "damaged_card,replacement_card_duration"
        ],
        [
            "I want to know my credit card apr and what is the spending limit I have.",
            "apr,credit_limit"
        ],
        [
            "Can you look into whether my card has good apr or not. Also, what's my limit on my amex card?",
            "apr,credit_limit"
        ],
        [
            "What is the apr for my credit card and look up the credit limit for my visa.",
            "apr,credit_limit"
        ],
        [
            "Tell me what my credit card's apr is. Additionaly, how high is my credit limit for my wells fargo card?",
            "apr,credit_limit"
        ],
        [
            "Can you tell me the apr on my visa card and what is the credit limit for my usaa card?",
            "apr,credit_limit"
        ],
        [
            "How long has it been since my car was at AutoZone, and I need to schedule an appointment for an oil change.",
            "last_maintenance,schedule_maintenance"
        ],
        [
            "When did I take my car to the mechanic? Also, I don't know why my check engine light is on, I need a mechanic.",
            "last_maintenance,schedule_maintenance"
        ],
        [
            "I can't remember when my car was last serviced, can you find out for me ? I need to schedule a car repair, too",
            "last_maintenance,schedule_maintenance"
        ],
        [
            "When did last go to the auto repair shop. Also, book an oil change please.",
            "last_maintenance,schedule_maintenance"
        ],
        [
            "Tell me the last time my car was in the shop, and I need a mechanic because my check engine light is on, and I don't know why.",
            "last_maintenance,schedule_maintenance"
        ],
        [
            "When did I last have my car checked, and what is my current gas level?",
            "last_maintenance,gas"
        ],
        [
            "How long has it been since my car was looked at and does my car have enough gas to get to atlantic city?",
            "last_maintenance,gas"
        ],
        [
            "Check my calendar for the date that my care was last serviced and can I make it to tampa without needing to get more gas?",
            "last_maintenance,gas"
        ],
        [
            "When was my last maintenance on my car in the shop and do I have enough fuel to get to dollar tree?",
            "last_maintenance,gas"
        ],
        [
            "When did I take my car to the mechanic and how does my gas tank look?",
            "last_maintenance,gas"
        ],
        [
            "I wish to know why my card was declined yesterday, plus how long is the shipping for my replacement card?",
            "card_declined,replacement_card_duration"
        ],
        [
            "Find out why my card was declined and how long does it take to replace a lost card?",
            "card_declined,replacement_card_duration"
        ],
        [
            "Yesterday, my card was declined. Also, I would like to know how long to replace a credit card?",
            "card_declined,replacement_card_duration"
        ],
        [
            "My card was declined at the store yesterday, what happened and how long does it take to replace a lost card?",
            "card_declined,replacement_card_duration"
        ],
        [
            "Please help me figure out why my card was declined yesterday. Also, when will you send me a replacement card?",
            "card_declined,replacement_card_duration"
        ],
        [
            "What is my credit limit at and am I allowed to increase the credit limit on my mastercard?",
            "credit_limit,credit_limit_change"
        ],
        [
            "Please tell me my spending limit and get my credit limit changed, too",
            "credit_limit,credit_limit_change"
        ],
        [
            "How can I check my credit card limit, and please change the credit limit.",
            "credit_limit,credit_limit_change"
        ],
        [
            "What is the limit on my credit? Also, I'd like to increase my credit limit up to four thousand.",
            "credit_limit,credit_limit_change"
        ],
        [
            "What is the current credit limit I have on my wells fargo mastercard and also may I have a higher limit on my mastercard?",
            "credit_limit,credit_limit_change"
        ],
        [
            "What does my shopping list contain? Also, I don't have cookies, so could you please order some more for me?",
            "shopping_list,order"
        ],
        [
            "Did I include milk on the shopping list. Also please get everything on my shopping list.",
            "shopping_list,order"
        ],
        [
            "What are the contents of my shopping list? Also, I do not have cookies so will you order me some more?",
            "shopping_list,order"
        ],
        [
            "Do I need to buy milk at the store, and I'm also out of cat food, so please order more.",
            "shopping_list,order"
        ],
        [
            "What did I add to my shopping list this time, and I'm running low on mouthwash, so please create an order for me.",
            "shopping_list,order"
        ],
        [
            "How do you say \"cat\" in Spanish, and I don't know how to spell \"spaghetti\" either.",
            "translate,spelling"
        ],
        [
            "What is \"thank you\" in spanish, and I need to know how to spell \"conscience\"",
            "translate,spelling"
        ],
        [
            "Translate 'hello' for me into french and can you spell \"diatribe\" ?",
            "translate,spelling"
        ],
        [
            "How should I say 'hello' in french and how do you spell out 'newspaper'?",
            "translate,spelling"
        ],
        [
            "What is the Spanish word for hello, and please count the number of letter \"a\" in \"happiness\"",
            "translate,spelling"
        ],
        [
            "Please call Christie's number, and inform coach of my location.",
            "make_call,share_location"
        ],
        [
            "Call Randy and let my wife know my exact location.",
            "make_call,share_location"
        ],
        [
            "Call Justin and provide Adam with my GPS coordinates.",
            "make_call,share_location"
        ],
        [
            "Call Christie and share my location with mom.",
            "make_call,share_location"
        ],
        [
            "I want to call robby and share my gps coordinates with Kelly.",
            "make_call,share_location"
        ],
        [
            "Well, first I didn't get your name and second, I want your new name to be Joshua.",
            "what_is_your_name,change_ai_name"
        ],
        [
            "Can I call you by any name, because I want you to change the ai name.",
            "what_is_your_name,change_ai_name"
        ],
        [
            "What name do you like to go by? I need to change your name, do you have a new name that you like?",
            "what_is_your_name,change_ai_name"
        ],
        [
            "Could you please tell me your name? After that, I'd like to consider changing it.",
            "what_is_your_name,change_ai_name"
        ],
        [
            "What's your first name and please respond to me when I reference Skynet.",
            "what_is_your_name,change_ai_name"
        ],
        [
            "You can call me james and what name would you like me to call you, too.",
            "change_user_name,what_is_your_name"
        ],
        [
            "Please change my name and also what do you want me to call you?",
            "change_user_name,what_is_your_name"
        ],
        [
            "Can you call me something else and then state your name?",
            "change_user_name,what_is_your_name"
        ],
        [
            "You can call me Alan and do you have a preference regarding what I should call you?",
            "change_user_name,what_is_your_name"
        ],
        [
            "Just call me AI. Also what is the name I should use to refer to you?",
            "change_user_name,what_is_your_name"
        ],
        [
            "What do I have to do today? Moreover, hurry up and just erase everything from the todo list",
            "todo_list,todo_list_update"
        ],
        [
            "Is taking out the trash on my to do list? Plus, add washing dishes to my to do list.",
            "todo_list,todo_list_update"
        ],
        [
            "What do I have on my need to do list and also erase \"get a haircut\" from my to do list, please.",
            "todo_list,todo_list_update"
        ],
        [
            "Do I have any birthdays on my todo list and add \"washing dishes\" to my to do list.",
            "todo_list,todo_list_update"
        ],
        [
            "I need to hear my todo list and add \"laundry\" to my list of things to do.",
            "todo_list,todo_list_update"
        ],
        [
            "I need my luggage that your airline lost it was flight abc123 and now it's suddenly missing, so I need to locate my phone.",
            "lost_luggage,find_phone"
        ],
        [
            "I'm waiting for my luggage in the airport now but it's been a while and it's still not arrive, and my phone is currently lost.",
            "lost_luggage,find_phone"
        ],
        [
            "What if I lost my luggage? Plus, can you help me find my cell?",
            "lost_luggage,find_phone"
        ],
        [
            "Can you help me find my luggage it was lost on delta flight abc123 from houston and can you help locate my phone, too?",
            "lost_luggage,find_phone"
        ],
        [
            "Where is my luggage, I was on delta flight ab123 out of dc. Also, please help me locate my phone.",
            "lost_luggage,find_phone"
        ],
        [
            "I want to report fraudulent activity on my card and I cracked my rewards card. Also, can I get a different one?",
            "report_fraud,damaged_card"
        ],
        [
            "Not only disable my card account but also contact the company to report fraudulent activity, as my card fell in the toilet, and now the chip does not work.",
            "report_fraud,damaged_card"
        ],
        [
            "I need to report some fraudulent card activity and also my card has a deep crease through the middle,so I would like to report it.",
            "report_fraud,damaged_card"
        ],
        [
            "I need to make a report due to fraudulent activity on my card, plus I damaged the card; can you replace the card?",
            "report_fraud,damaged_card"
        ],
        [
            "My card has purchases I don't recognize. Call the card company and ask them to replace my card",
            "report_fraud,damaged_card"
        ],
        [
            "I want to know how I can increase my credit spending by $250, and I also want to change the pin on my Bank of America account to be 1234.",
            "credit_limit_change,pin_change"
        ],
        [
            "Can you change the limit on my credit please? Also, it turns out I can't remember what my pin is for my bank of america checking account.",
            "credit_limit_change,pin_change"
        ],
        [
            "May I have a higher limit on my mastercard?; seem to have lost the pin for my retirement account,too.",
            "credit_limit_change,pin_change"
        ],
        [
            "Can I increase the credit limit for my american express card? Furthermore, change my pin to 1234 on account ending with digits 4994.",
            "credit_limit_change,pin_change"
        ],
        [
            "Since you told me that you can increase the amount I can spend on my Visa, do it. Then can you switch the pin on my Wells Fargo account to 9982?",
            "credit_limit_change,pin_change"
        ],
        [
            "What are the steps to change the oil in my car and how much longer until I need to get my oil changed?",
            "oil_change_how,oil_change_when"
        ],
        [
            "How do you change car oil; when do you think I should change my oil, too?",
            "oil_change_how,oil_change_when"
        ],
        [
            "What oil should i use? Plus, how do I change it and what is the time frame for changing oil?",
            "oil_change_how,oil_change_when"
        ],
        [
            "How do I change the oil in my passat and how long until I need to change my oil?",
            "oil_change_how,oil_change_when"
        ],
        [
            "How do I change my car oil and when should my oil get changed?",
            "oil_change_how,oil_change_when"
        ],
        [
            "What could I do for fun in Kentucky. Also, how safe is it to travel to mongolia ?",
            "travel_suggestion,travel_alert"
        ],
        [
            "Are there any fun tourist activities in Australia? Furthermore, does north korea have any travel alerts I should be aware of?",
            "travel_suggestion,travel_alert"
        ],
        [
            "Is there anything fun to do in berlin; is there a travel alert for greece, too?",
            "travel_suggestion,travel_alert"
        ],
        [
            "Give me some ideas on what I can do in Seattle for fun; can you tell me if there's a travel alert for that country, too?",
            "travel_suggestion,travel_alert"
        ],
        [
            "When visiting chicago, what things can i do there?; have there been any travel alerts issued for france?",
            "travel_suggestion,travel_alert"
        ],
        [
            "When was the car in the shop, and do the tires need air?",
            "last_maintenance,tire_pressure"
        ],
        [
            "How long has it been since my car was last in the shop ? Moreover, do the tires need air?",
            "last_maintenance,tire_pressure"
        ],
        [
            "I need to know when I last took my car in for a check up and how low is the pressure in my tires",
            "last_maintenance,tire_pressure"
        ],
        [
            "What date was my oil last changed? — are my tires properly inflated with air?",
            "last_maintenance,tire_pressure"
        ],
        [
            "When was my car in the shop; measure tire pressure.",
            "last_maintenance,tire_pressure"
        ],
        [
            "What's the artist's name of this song; go ahead and skip this song and play the next one",
            "what_song,next_song"
        ],
        [
            "What tune is this, plus I want to listen to another song",
            "what_song,next_song"
        ],
        [
            "What's this song ? ; switch to the next song on this playlist please",
            "what_song,next_song"
        ],
        [
            "Do you know what this song is and can we stop this song and play the next one?",
            "what_song,next_song"
        ],
        [
            "What's this song called and can we stop this song and play the next song?",
            "what_song,next_song"
        ],
        [
            "Set a brand new timer for eight seconds. Also, I need an alarm set.",
            "timer,alarm"
        ],
        [
            "Start a timer for two minute — sound the alarm at 6 am tomorrow",
            "timer,alarm"
        ],
        [
            "First, set a timer for 5 minutes, and then put in an alarm for 5 pm.",
            "timer,alarm"
        ],
        [
            "After setting a timer for 35 minutes, also create an alarm for 6 am",
            "timer,alarm"
        ],
        [
            "I gotta have a 10-minute timer, and please turn on the alarm.",
            "timer,alarm"
        ],
        [
            "Please remove \"laundry\" from my list of chores and I need to know what is on my shopping list.",
            "todo_list_update,shopping_list"
        ],
        [
            "Add \"clean bathroom\" to my to-do list, and also show me my shopping list.",
            "todo_list_update,shopping_list"
        ],
        [
            "First, take off everything from my to-do list. Then, can you please tell me what I have on my shopping list?",
            "todo_list_update,shopping_list"
        ],
        [
            "Will you please put \"change the light bulbs\" on my list of things to do, provided it's not already there, and could you let me know what items are currently available on the shopping list?",
            "todo_list_update,shopping_list"
        ],
        [
            "For a fresh start, let's nuke all the items on my to-do list. By the way, did I remember to put milk on the shopping list?",
            "todo_list_update,shopping_list"
        ],
        [
            "Do you have a veggie lasagna recipe? Additionally, what do you think would make a good dinner?",
            "recipe,meal_suggestion"
        ],
        [
            "Please give me instructions on making blueberry pie and suggest a meal from thailand to me",
            "recipe,meal_suggestion"
        ],
        [
            "Are there any instructions available on how to make buttermilk pancakes? Also, could you please provide me with a suggestion for a thai meal?",
            "recipe,meal_suggestion"
        ],
        [
            "I need a recipe on how to make beef stew. Also, give me an italian meal suggestion",
            "recipe,meal_suggestion"
        ],
        [
            "Provide me with a quick recipe for spiral ham. Do you happen to have any good dinner ideas?",
            "recipe,meal_suggestion"
        ],
        [
            "Please speak to me in Chinese and preferably using a female voice.",
            "change_language,change_accent"
        ],
        [
            "I want to use spanish as my language and switch over to the female voice.",
            "change_language,change_accent"
        ],
        [
            "Please speak to me in Chinese, and I specifically request to use the female voice for the conversation.",
            "change_language,change_accent"
        ],
        [
            "Is there an option to speak only in Mandarin? Additionally, could you please use a male voice?",
            "change_language,change_accent"
        ],
        [
            "I want you to address me in italian and please start using female voice,",
            "change_language,change_accent"
        ],
        [
            "Read my calendar events and can you read me my list of reminders?",
            "calendar,reminder"
        ],
        [
            "What do I have on my calendar today, the 3rd. Also, check if getting a light bulb is on my list of reminders.",
            "calendar,reminder"
        ],
        [
            "What's on my calendar for the 18th of march; can you remind me what i was trying to remember?",
            "calendar,reminder"
        ],
        [
            "Τell me what my calendar looks like for march 12th. Is checking the mail on my list of reminder, too?",
            "calendar,reminder"
        ],
        [
            "What do I have on my calendar for monday the 1st of march ? Moreover, what reminders do I have?",
            "calendar,reminder"
        ],
        [
            "Tell me what the date will be tomorrow? Please tell me my current location,too",
            "date,current_location"
        ],
        [
            "I would like to know tomorrow's date — Where am i right this moment",
            "date,current_location"
        ],
        [
            "What's the current date and also show me where I am.",
            "date,current_location"
        ],
        [
            "Tell me the date 650 days from now and in the place i am, what are my gps coordinates?",
            "date,current_location"
        ],
        [
            "Tell me the date today and check out my location up on the map.",
            "date,current_location"
        ],
        [
            "Can you assist me with car rental bookings in Seattle? Additionally, I would like you to make a Delta reservation for a flight from Madison to Atlanta.",
            "car_rental,book_flight"
        ],
        [
            "Not only contact Avis and see if they have cars available, but also get me roundtrip flight information for flights from Dallas to Houston for june 8 and june 17.",
            "car_rental,book_flight"
        ],
        [
            "Ι'd like to rent an automobile in pittsburgh from this Tuesday until next Thursday. Plus, find me a flight from tijuana to Guadalajara on Volaris.",
            "car_rental,book_flight"
        ],
        [
            "Will you help me reserve a rental car for my trip to Dallas ? I'm looking for a roundtrip flight from aaf to dia for february 23rd to february 28th, too",
            "car_rental,book_flight"
        ],
        [
            "I'd like to rent a ford in Denver, Colorado between january 1st to the 3rd. Moreover, get me a flight booked from Houston to Phoenix with american airlines",
            "car_rental,book_flight"
        ],
        [
            "What is the next step if my luggage was lost? I would like to change the pin on my savings account, too",
            "lost_luggage,pin_change"
        ],
        [
            "I arrived on delta flight ab123 from juno but my luggage doesn't appear to have come with me. Help me remember my pin number, too",
            "lost_luggage,pin_change"
        ],
        [
            "My luggage is nowhere in sight, it might be lost. Furthermore, I cannot remember what my pin is for my bank of america checking account this moment.",
            "lost_luggage,pin_change"
        ],
        [
            "I need my luggage found, I was on delta flight ab123 out of san francisco. — My checking account needs a new pin number",
            "lost_luggage,pin_change"
        ],
        [
            "Is there someone I can talk to, since I am in the airport waiting for my luggage which never came? Also, I need to change my pin number for my account.",
            "lost_luggage,pin_change"
        ],
        [
            "When was i paid last and what's the total of days i've taken for me time so far?",
            "payday,pto_used"
        ],
        [
            "Fist tell me when i received my last paycheck. Then, tell me the exact amount of pto I have used",
            "payday,pto_used"
        ],
        [
            "When was my last payday and also how many days of pto have I used?",
            "payday,pto_used"
        ],
        [
            "Tell me when my next paycheck will be here and how many of my vacation days have I depleted",
            "payday,pto_used"
        ],
        [
            "When was I last paid; how much pto have I depleted",
            "payday,pto_used"
        ],
        [
            "When is the expiration date for my visa card ? Plus, tell me the present status of the credit card application I submitted.",
            "expiration_date,application_status"
        ],
        [
            "What's the expiry month of my card and what is the status of the application for a credit card I put in?",
            "expiration_date,application_status"
        ],
        [
            "Can you tell me if my credit card expires in the near future ? Plus, in what status is my credit card application?",
            "expiration_date,application_status"
        ],
        [
            "I need to know the date of expiration for my credit card and do I have any updates about my credit card application?",
            "expiration_date,application_status"
        ],
        [
            "Can you tell me the expiration date for my mastercard, because i'm desperate to know about my cc processing.",
            "expiration_date,application_status"
        ],
        [
            "I need to know how many days so far I've taken off and what holiday comes next.",
            "pto_used,next_holiday"
        ],
        [
            "How much time have I taken off this year and do I have a day off coming up soon?",
            "pto_used,next_holiday"
        ],
        [
            "Including the day I missed because of snow, how much time have I take off work so far ? Plus, what's the next day i am scheduled off?",
            "pto_used,next_holiday"
        ],
        [
            "Look up the amount of pto I have already used. Furthermore, when is the next office holiday?",
            "pto_used,next_holiday"
        ],
        [
            "How many days off have i taken? Also, when will I be off again?",
            "pto_used,next_holiday"
        ],
        [
            "How does my gas tank look? Tell me the right kind of gas for this car, too.",
            "gas,gas_type"
        ],
        [
            "tell me how much gas i have and also give me the kind of gas needed for this car.",
            "gas,gas_type"
        ],
        [
            "Am I low on gas? Plus, does it matter what kind of gas I fill up my car with.",
            "gas,gas_type"
        ],
        [
            "How many miles before I run out of gas ? Is unleaded ok or should I use premium?",
            "gas,gas_type"
        ],
        [
            "Inform me as to how much gas my car has, then tell me the gas I need to fill this car up with.",
            "gas,gas_type"
        ],
        [
            "Is there a travel alert for canada? Is austin in the central timezone, too?",
            "travel_alert,timezone"
        ],
        [
            "I need to know about travel alerts for mexico. Plus, which timezone is england in?",
            "travel_alert,timezone"
        ],
        [
            "Is there a travel alert in argentina and in what timezone does baton rouge fall?",
            "travel_alert,timezone"
        ],
        [
            "I am going to australia and I want to be notified of any travel alert. Also, in paris, what's the timezone?",
            "travel_alert,timezone"
        ],
        [
            "Is it safe to travel to china? I want to know france's timezone,too",
            "travel_alert,timezone"
        ],
        [
            "What's the exact date that my chase card will no longer work and how soon will I be sent a new card.",
            "expiration_date,replacement_card_duration"
        ],
        [
            "What is the expiration date on my card? Plus, how soon will you mail me a new card?",
            "expiration_date,replacement_card_duration"
        ],
        [
            "When does my amex expire and also how long til my new card arrives by mail?",
            "expiration_date,replacement_card_duration"
        ],
        [
            "Can you tell me if my credit card expires in the near future? Furthermore, can I replace a stolen card soon?",
            "expiration_date,replacement_card_duration"
        ],
        [
            "When's my visa card expiring? What is the quickest way to get a new card, too?",
            "expiration_date,replacement_card_duration"
        ],
        [
            "I was at target trying to buy a mug and my card was declined. Also, do I get charged more for using my card in canada?",
            "card_declined,international_fees"
        ],
        [
            "Why was my card declined and is there a surcharge for using my card in mexico?",
            "card_declined,international_fees"
        ],
        [
            "Why did my card get rejected yesterday? Plus, will I get a fee for international transactions with my visa card?",
            "card_declined,international_fees"
        ],
        [
            "Why was my card declined yesterday and also tell me if there is any transaction fee using royal card in europe.",
            "card_declined,international_fees"
        ],
        [
            "Tell me why was my card declined at the zoo — Does the national card have international transactions fees and how much?",
            "card_declined,international_fees"
        ],
        [
            "Can you schedule a meeting with Steve at the office? Moreover, do I have any meetings with Dave today?",
            "schedule_meeting,meeting_schedule"
        ],
        [
            "Can you schedule a meeting with George for 4 and do I have any meetings today between 4 and 5?",
            "schedule_meeting,meeting_schedule"
        ],
        [
            "I want to know if there is meeting room available at 8 and also what's on my meeting schedule today.",
            "schedule_meeting,meeting_schedule"
        ],
        [
            "Can you schedule a meeting with george for 4. Also, when do I have meetings today?",
            "schedule_meeting,meeting_schedule"
        ],
        [
            "Are there any meeting rooms free from 10:00 am until 10:30 am? Plus, let me hear all meetings for today.",
            "schedule_meeting,meeting_schedule"
        ],
        [
            "Send a text and tell chris that I'm not working today and let Cora and Nancy know where I am now.",
            "text,share_location"
        ],
        [
            "Send mom a text asking where are you and can you tell Bill and Craig where I am, too?",
            "text,share_location"
        ],
        [
            "Not only send Chris a text message that says stop for milk on your way home, but also have Miranda know about my current location.",
            "text,share_location"
        ],
        [
            "Text William and ask him to pick up organic apples tonight and then share my gps coordinates with my brother, too.",
            "text,share_location"
        ],
        [
            "Send a message to mom \"be there soon\" and please tell Wanda where I am now.",
            "text,share_location"
        ],
        [
            "Do you know the procedure to cook apple pie and also tell me the amount of calories in muffins?",
            "recipe,calories"
        ],
        [
            "I need a quick recipe for spiral ham and how many calories are in spaghetti and meat sauce?",
            "recipe,calories"
        ],
        [
            "I'm looking for a good beef recipe. By the way, do you happen to know the calorie count if I choose to eat cereal?",
            "recipe,calories"
        ],
        [
            "How do I make a taco that's worth eating and what is the calorie going to be if i'm eating cereal?",
            "recipe,calories"
        ],
        [
            "Find a recipe for german chocolate cake. Oh, tell me also, if you know how many calories in gum.",
            "recipe,calories"
        ],
        [
            "On what day do I have to pay my nordstrom bill. ahead and pay my american express bill now.",
            "bill_due,pay_bill"
        ],
        [
            "So, what's the due date for the renting bill? By the way, can you assist me in paying my electric bill?",
            "bill_due,pay_bill"
        ],
        [
            "I want to know when a bill is due. Besides I want to pay my water bill.",
            "bill_due,pay_bill"
        ],
        [
            "What's the due date for my american express payment? Oh, can you help me pay a bill, too?",
            "bill_due,pay_bill"
        ],
        [
            "How do I find when my cable bill is due? Do I need to pay this month's tv subscription fee, too?",
            "bill_due,pay_bill"
        ],
        [
            "To come into existence as you are, what led to your formation? Are you not self-employed?",
            "who_made_you,who_do_you_work_for"
        ],
        [
            "what company manufactured you. By the way are you working for another person or entity?",
            "who_made_you,who_do_you_work_for"
        ],
        [
            "I'd like to know who made you. Is there another entity you work for?",
            "who_made_you,who_do_you_work_for"
        ],
        [
            "Which company can i credit your design to? Plus, who directs your labor?",
            "who_made_you,who_do_you_work_for"
        ],
        [
            "The creator of your ai, what is their name, and also do you work for someone else or no?",
            "who_made_you,who_do_you_work_for"
        ],
        [
            "Translate \"hello\" to english. Besides can we speak in english rather than zulu?",
            "translate,change_language"
        ],
        [
            "Translate \"hello\" into french for me and also you should respond in english.",
            "translate,change_language"
        ],
        [
            "Can you tell me how to say \" I do not speak much spanish\" in spanish ? Please, respond to me in spanish.",
            "translate,change_language"
        ],
        [
            "Translate hello to french. Then, I want you to address me in italian",
            "translate,change_language"
        ],
        [
            "How would I say \"goodbye\" if I were norwegian? Change your language to spanish, too",
            "translate,change_language"
        ],
        [
            "I don't know where I left my phone. Also, tell me the current location.",
            "find_phone,current_location"
        ],
        [
            "Give me a hand finding my mobile device. I need to know my location,too.",
            "find_phone,current_location"
        ],
        [
            "I would like some help finding my phone and place a marker for me where I am on the map.",
            "find_phone,current_location"
        ],
        [
            "Please help me both locate my phone and look me up on the map.",
            "find_phone,current_location"
        ],
        [
            "Can you tell me where I left my phone? By the way, bring up my location.",
            "find_phone,current_location"
        ],
        [
            "I need some air; get the fan going and I want an alarm set up.",
            "smart_home,alarm"
        ],
        [
            "Not only activate my furnace please, but also make sure my alarm is set for three thirty in the morning.",
            "smart_home,alarm"
        ],
        [
            "Put fan on and please set up an alarm to go off tomorrow at daybreak.",
            "smart_home,alarm"
        ],
        [
            "Dim the main lights please and make up a new alarm, too.",
            "smart_home,alarm"
        ],
        [
            "After you turn on the lights in the garage, make an alarm 6am.",
            "smart_home,alarm"
        ],
        [
            "While you provide me with the apr for my Mastercard, may I inquire if it is possible to increase my credit limit to $1000?",
            "apr,credit_limit_change"
        ],
        [
            "While you check the apr on my Disney Visa, could you also verify if I can increase the credit limit for my Western Union credit card?",
            "apr,credit_limit_change"
        ],
        [
            "While give me the apr for my mastercard. can i up my credit limit to $1000?",
            "apr,credit_limit_change"
        ],
        [
            "What is the credit card apr? Could you increase my credit limit, too?",
            "apr,credit_limit_change"
        ],
        [
            "What is the apr on my chase freedom card. And, can I have my credit limit changed?",
            "apr,credit_limit_change"
        ],
        [
            "Please help me find my cellphone and could you also unsync my phone?",
            "find_phone,sync_device"
        ],
        [
            "Can you help me find my cell and then unsync phone from home system?",
            "find_phone,sync_device"
        ],
        [
            "Can you please first locate my phone and then unlink my phone?",
            "find_phone,sync_device"
        ],
        [
            "I seemed to have misplaced my phone. Also, could you link with my phone?",
            "find_phone,sync_device"
        ],
        [
            "Please help me find my phone, because I lost it. Then, go ahead and disconnect from my phone.",
            "find_phone,sync_device"
        ],
        [
            "AI find my phone. Also, it is important to call Katie.",
            "find_phone,make_call"
        ],
        [
            "I lost my phone and need assistance. Plus, I am going to call the Landlord.",
            "find_phone,make_call"
        ],
        [
            "Where is my phone now ? By the way, call Jim.",
            "find_phone,make_call"
        ],
        [
            "Please help me find my phone and it is important that I call same.",
            "find_phone,make_call"
        ],
        [
            "My phone is lost, can you help me? Please dial George's phone number, too.",
            "find_phone,make_call"
        ],
        [
            "Text christy and ask her what she wants for dinner. Also, I need anniversary dinner added to my schedule for march 7.",
            "text,calendar_update"
        ],
        [
            "Set up a new text message and also I want you to add staff meeting to my calendar for march 1 at 10:00 am.",
            "text,calendar_update"
        ],
        [
            "Send ally a text message the message is that \"i just landed\". Additionally, take the event called \"surprise party\" off my calendar for june 2.",
            "text,calendar_update"
        ],
        [
            "Please send a text to Phil and ask him if he wants to play golf this weekend. Plus, I must add \"farm trip\" to my calendar for friday.",
            "text,calendar_update"
        ],
        [
            "Give a text to my cousin Linda that says \"happy birthday\" and add mom's birthday to my calendar on April 12.",
            "text,calendar_update"
        ],
        [
            "How much time does it take to boil an egg ? Besides, when will lettuce in the fridge go bad?",
            "cook_time,food_last"
        ],
        [
            "What time should I cook noodles for? By the way I've got some chips from monday, will they still be ok to eat?",
            "cook_time,food_last"
        ],
        [
            "How long does a roast take? Also, when will lettuce in the fridge go bad?",
            "cook_time,food_last"
        ],
        [
            "So, noodles need to cook for how long ? Plus, am I good to eat this burger from the fridge that i got two mondays ago?",
            "cook_time,food_last"
        ],
        [
            "How long do I cook the chicken roast? Furthermore, the milk will expire when?",
            "cook_time,food_last"
        ],
        [
            "My water and electricity bill is how much ? Also, can I get the minimum payment for my credit card?",
            "bill_balance,min_payment"
        ],
        [
            "Can you find out how much I owe on my bills and also how little can I pay on my car bill?",
            "bill_balance,min_payment"
        ],
        [
            "Can you check the balance on the water bill and what's the minimum amount I owe on the car payment?",
            "bill_balance,min_payment"
        ],
        [
            "How much do I owe on my cable bill ? Plus, could you tell me the minimum payment on my mortgage ?",
            "bill_balance,min_payment"
        ],
        [
            "My water and electricity bill is how much? Plus, I would like the minimum to pay on power bill.",
            "bill_balance,min_payment"
        ],
        [
            "What in the world is my credit rating and what can i do to keep my score from dropping?",
            "credit_score,improve_credit_score"
        ],
        [
            "How do i look up my credit score. Also, show me some ways to build my credit score.",
            "credit_score,improve_credit_score"
        ],
        [
            "Can you figure out how to find my credit score? Give me a recommendation to improve my credit score, too.",
            "credit_score,improve_credit_score"
        ],
        [
            "I wish to know my credit rating. Oh, is it true that opening a new account can decrease your credit score?",
            "credit_score,improve_credit_score"
        ],
        [
            "What in the world is my credit rating ? Furthermore, what are some ways I can do to improve my credit score?",
            "credit_score,improve_credit_score"
        ],
        [
            "When did I last have my vehicle serviced ? Besides, what are some ways to jump start a car ?",
            "last_maintenance,jump_start"
        ],
        [
            "Tell me the last time the car was in shop. Also, can you tell me how to jump start the car?",
            "last_maintenance,jump_start"
        ],
        [
            "When was my last maintenance on my car in the shop ? Furthermore, whats the best way to jump start a battery",
            "last_maintenance,jump_start"
        ],
        [
            "i need to know when i last carried my car to the shop and also my car battery has died, what should i do now?",
            "last_maintenance,jump_start"
        ],
        [
            "I can't remember when my car was last serviced. So can you find out for me ? Besides, do you have instructions on jump starting a chevy?",
            "last_maintenance,jump_start"
        ],
        [
            "When did I go to the mechanic and is unleaded ok or should i use premium?",
            "last_maintenance,gas_type"
        ],
        [
            "When did I take to car to the auto shop and look up the kind of fuel I use in my car, too.",
            "last_maintenance,gas_type"
        ],
        [
            "Can you find the date of my last oil change and also what kind of gas should go in this car?",
            "last_maintenance,gas_type"
        ],
        [
            "Last time car was in shop. Also, what kind of gas should I use to fill the car?",
            "last_maintenance,gas_type"
        ],
        [
            "Can you find the date of my last oil change and then tell me what type of gas do I need to use in this car?",
            "last_maintenance,gas_type"
        ],
        [
            "Calculate my total income from my job. Also, how much is the irs going to get from me?",
            "income,taxes"
        ],
        [
            "What do I earn from my job and can you also tell me how much tax I have to pay on this income?",
            "income,taxes"
        ],
        [
            "How much do I make per day and what does my federal tax return look like?",
            "income,taxes"
        ],
        [
            "Not only look up to find how much I earn annually, but also give me the specifics on my federal taxes.",
            "income,taxes"
        ],
        [
            "What does my income amount to and what's the damage on my federal tax return ?",
            "income,taxes"
        ],
        [
            "Can you update me on my last amazon orders and then help me locate my phone?",
            "order_status,find_phone"
        ],
        [
            "Where was my package last at? Help me find my phone, too",
            "order_status,find_phone"
        ],
        [
            "Track my package, please and can you call my cellphone, too?",
            "order_status,find_phone"
        ],
        [
            "What is the status of my delivery order ? Plus, please help me figure out where my lost phone is.",
            "order_status,find_phone"
        ],
        [
            "Has my order been shipped yet ? Oh, I lost my phone, too and I need assistance.",
            "order_status,find_phone"
        ],
        [
            "What is the available balance in savings and what's my credit rating?",
            "balance,credit_score"
        ],
        [
            "While you provide me with the savings account balance at Chase Bank, could you also guide me on how to locate my current credit score?",
            "balance,credit_score"
        ],
        [
            "How much money is in my checking account? I want to find out what my credit score is, too.",
            "balance,credit_score"
        ],
        [
            "Do you know how much I have in checking? I need to know what my credit score is, too.",
            "balance,credit_score"
        ],
        [
            "What's the balance on my bank account ? I wish to know my credit rating, too.",
            "balance,credit_score"
        ],
        [
            "I have a fraudulent transaction from Wal Mart on my account. Besides, pause my account.",
            "report_fraud,freeze_account"
        ],
        [
            "I need to make a report due to fraudulent activity on my card. Plus, freeze my account.",
            "report_fraud,freeze_account"
        ],
        [
            "How do I report fraud on my discover card? Block my chase account right away.",
            "report_fraud,freeze_account"
        ],
        [
            "I am certain that this charge is fraudulent. Consequently, would you be able to put a stop on my bank account?",
            "report_fraud,freeze_account"
        ],
        [
            "Despite the help I need with fraudulent charges on my card, I urgently need a block put on my Chase account.",
            "report_fraud,freeze_account"
        ],
        [
            "How many ounces in a gallon and what is the equal number of dollars I can exchange for 50 pesos?",
            "measurement_conversion,exchange_rate"
        ],
        [
            "What amount of millimeters are in 50 kilometers and how many dollars can I exchange for 200 pounds?",
            "measurement_conversion,exchange_rate"
        ],
        [
            "How do you convert millimeters to decimeters and i must know five dollars in yen and rubles",
            "measurement_conversion,exchange_rate"
        ],
        [
            "How many liters are in 500 gallons and what's the currency conversion between rubles and yen?",
            "measurement_conversion,exchange_rate"
        ],
        [
            "Ηow would you convert yards to inches and how many dollars can I exchange for 75 euros?",
            "measurement_conversion,exchange_rate"
        ],
        [
            "What type of pizzas are available for dinner?",
            "meal_suggestion"
        ],
        [
            "Give me italian meal ideas.",
            "meal_suggestion"
        ],
        [
            "Suggest a meal from burma to me.",
            "meal_suggestion"
        ],
        [
            "What thoughts do you have about making dinnner tonight?",
            "meal_suggestion"
        ],
        [
            "Please give me instructions on making blueberry pie",
            "recipe"
        ],
        [
            "Give me a beef recipe.",
            "recipe"
        ],
        [
            "How do you create pork chili?",
            "recipe"
        ],
        [
            "What do you need to do to make sushi?",
            "recipe"
        ],
        [
            "Create a link with my phone.",
            "sync_device"
        ],
        [
            "I am going to go ahead and pair this with my new phone.",
            "sync_device"
        ],
        [
            "Could you connect with my phone?",
            "sync_device"
        ],
        [
            "Please turn off your wifi from my phone.",
            "sync_device"
        ],
        [
            "Are there any transaction fees associated with my usaa card if i am in india?",
            "international_fees"
        ],
        [
            "Do I incur extra fees if I use my card in London?",
            "international_fees"
        ],
        [
            "What kind of international transaction fees are related to my amex?",
            "international_fees"
        ],
        [
            "Can I see all the international transaction fees on my amex?",
            "international_fees"
        ],
        [
            "Check up on the status of my online order.",
            "order_status"
        ],
        [
            "Could you check to see if my order has been delivered?",
            "order_status"
        ],
        [
            "I need to track my package.",
            "order_status"
        ],
        [
            "Show me where my order is.",
            "order_status"
        ],
        [
            "What is the turn around for a new card?",
            "replacement_card_duration"
        ],
        [
            "When will my card come?",
            "replacement_card_duration"
        ],
        [
            "What's the wait time for a replacement card?",
            "replacement_card_duration"
        ],
        [
            "Is my replacement card coming soon?",
            "replacement_card_duration"
        ],
        [
            "Do you know the expiration date for my visa card?",
            "expiration_date"
        ],
        [
            "What date does my capital one card expire?",
            "expiration_date"
        ],
        [
            "Please, let me know when I need to renew my credit card.",
            "expiration_date"
        ],
        [
            "During which month will my card expire?",
            "expiration_date"
        ],
        [
            "What name do you want to be called?",
            "what_is_your_name"
        ],
        [
            "Please, tell me your name.",
            "what_is_your_name"
        ],
        [
            "What's your full name?",
            "what_is_your_name"
        ],
        [
            "How would you like to be referred to?",
            "what_is_your_name"
        ],
        [
            "Play the next musical number.",
            "next_song"
        ],
        [
            "Stop the current song and play the next one on this playlist.",
            "next_song"
        ],
        [
            "Please skip this song and play the next one.",
            "next_song"
        ],
        [
            "The next song should be played.",
            "next_song"
        ],
        [
            "I creased my card today, contact the bank.",
            "damaged_card"
        ],
        [
            "Report the card has been damaged.",
            "damaged_card"
        ],
        [
            "I can not use my card since it is damaged.",
            "damaged_card"
        ],
        [
            "I need a new card because my dog chewed on it and now it does not work.",
            "damaged_card"
        ],
        [
            "Look up my total number of days off so far.",
            "pto_used"
        ],
        [
            "Including the day I missed because of snow, how much time have I take off work so far?",
            "pto_used"
        ],
        [
            "Get the details on the pto I have used.",
            "pto_used"
        ],
        [
            "Look up how many of my days off I have used so far.",
            "pto_used"
        ],
        [
            "I want to pay my tax bill.",
            "pay_bill"
        ],
        [
            "Can you help me pay my phone bill?",
            "pay_bill"
        ],
        [
            "I need help to pay my electric bill?",
            "pay_bill"
        ],
        [
            "I gotta pay my cable bill.",
            "pay_bill"
        ],
        [
            "How do I change my oil and choose the right oil?",
            "oil_change_how"
        ],
        [
            "Please tell me how to change the oil in my car.",
            "oil_change_how"
        ],
        [
            "How do you change the car oil?",
            "oil_change_how"
        ],
        [
            "What steps do i take to change the oil for my car?",
            "oil_change_how"
        ],
        [
            "Help me get access to my recent transaction history.",
            "transactions"
        ],
        [
            "I need some information on a recent transaction.",
            "transactions"
        ],
        [
            "On my card what have been my recent purchases?",
            "transactions"
        ],
        [
            "What transactions have I made on liquor in the past month?",
            "transactions"
        ],
        [
            "When does the electric bill up?",
            "bill_due"
        ],
        [
            "When do I have to pay my electric bill by?",
            "bill_due"
        ],
        [
            "What is the due date of my at&t bill",
            "bill_due"
        ],
        [
            "when do i need to pay my at&t bill",
            "bill_due"
        ],
        [
            "Tell me where I am on a map.",
            "current_location"
        ],
        [
            "How do I find my location, please?",
            "current_location"
        ],
        [
            "Tell me how to find my current location.",
            "current_location"
        ],
        [
            "How can I find my current location?",
            "current_location"
        ],
        [
            "My visa card was stolen.",
            "report_lost_card"
        ],
        [
            "I misplaced my visa and need it marked as lost.",
            "report_lost_card"
        ],
        [
            "Who do I report card theft to?",
            "report_lost_card"
        ],
        [
            "File a report for a lost american express card.",
            "report_lost_card"
        ],
        [
            "What is my bank balance for all accounts?",
            "balance"
        ],
        [
            "How much is available in my savings account?",
            "balance"
        ],
        [
            "What is the total of my bank accounts?",
            "balance"
        ],
        [
            "Can you tell me my current bank accounts balance?",
            "balance"
        ],
        [
            "Do you have any cool facts about reptiles?",
            "fun_fact"
        ],
        [
            "I want to learn a neat fact about black holes.",
            "fun_fact"
        ],
        [
            "Explain some trivia about Lebron james.",
            "fun_fact"
        ],
        [
            "Tell me a fun fact about the olympics.",
            "fun_fact"
        ],
        [
            "How do I check how many rewards I have on my master card ?",
            "rewards_balance"
        ],
        [
            "What is the reward balance on my discover card?",
            "rewards_balance"
        ],
        [
            "How would I be able to check my kohls rewards card?",
            "rewards_balance"
        ],
        [
            "How many rewards points do I have for my visa card ?",
            "rewards_balance"
        ],
        [
            "Delete my to do list.",
            "todo_list_update"
        ],
        [
            "Please, include laundry on my to do list.",
            "todo_list_update"
        ],
        [
            "Put 'laundry' on my to do list.",
            "todo_list_update"
        ],
        [
            "Please, erase everything on my to do list.",
            "todo_list_update"
        ],
        [
            "About how long before i need another oil change?",
            "oil_change_when"
        ],
        [
            "How often should the oil be changed?",
            "oil_change_when"
        ],
        [
            "How many miles can I drive before I need to change my oil?",
            "oil_change_when"
        ],
        [
            "When do I need you to change my oil?",
            "oil_change_when"
        ],
        [
            "Tell me what my day looks like today in terms of meetings.",
            "meeting_schedule"
        ],
        [
            "Is the gang getting together this afternoon?",
            "meeting_schedule"
        ],
        [
            "Do I have any meetings with Ben today?",
            "meeting_schedule"
        ],
        [
            "Do I have to meet the dev squad today?",
            "meeting_schedule"
        ],
        [
            "Please, send a text.",
            "text"
        ],
        [
            "Text Sal and tell her hi.",
            "text"
        ],
        [
            "Send a text to lisa and ask her to call me when she gets home.",
            "text"
        ],
        [
            "Compose a text message.",
            "text"
        ],
        [
            "Look for a flight out of La to chicago on March 3rd for under $500.",
            "book_flight"
        ],
        [
            "Can you find me a flight from Portland, Oregon to Portland, maine for under $500 on delta?",
            "book_flight"
        ],
        [
            "Book a flight from Tampa, fl to Baltimore, md on 11 february 2019 and returning on 19 march 2019.",
            "book_flight"
        ],
        [
            "Would you give me available flights out of dallas to miami on june 8 for under $340?",
            "book_flight"
        ],
        [
            "What is my list of reminders?",
            "reminder"
        ],
        [
            "What did I put on my list of reminders?",
            "reminder"
        ],
        [
            "I need to know the content of my list of reminders.",
            "reminder"
        ],
        [
            "Check if getting a light bulb is on my list of reminders.",
            "reminder"
        ],
        [
            "What company sponsored you?",
            "who_made_you"
        ],
        [
            "Which company programmed you?",
            "who_made_you"
        ],
        [
            "Who brought you up?",
            "who_made_you"
        ],
        [
            "Who was your creator?",
            "who_made_you"
        ],
        [
            "Can I have you call me something else?",
            "change_user_name"
        ],
        [
            "Ι'm called Τim.",
            "change_user_name"
        ],
        [
            "Please, call me by this new name.",
            "change_user_name"
        ],
        [
            "People call me Gary.",
            "change_user_name"
        ],
        [
            "I want to find out how do I schedule a meeting.",
            "schedule_meeting"
        ],
        [
            "Schedule a meeting with Tom for 6pm.",
            "schedule_meeting"
        ],
        [
            "Show me how to schedule a meeting.",
            "schedule_meeting"
        ],
        [
            "Is there a meeting room available between one and two?",
            "schedule_meeting"
        ],
        [
            "Locate my phone for me.",
            "find_phone"
        ],
        [
            "Please, help me find my cellphone.",
            "find_phone"
        ],
        [
            "Is my phone in the house?",
            "find_phone"
        ],
        [
            "Please help me find my phone, because i lost it.",
            "find_phone"
        ],
        [
            "How do I spell 'catheter'?",
            "spelling"
        ],
        [
            "Can you spell 'diatribe' for me",
            "spelling"
        ],
        [
            "Do you know how many o's are in \"honor\"?",
            "spelling"
        ],
        [
            "How many \"ss\" are in \"narcissism\"?",
            "spelling"
        ],
        [
            "Switch to british male accent.",
            "change_accent"
        ],
        [
            "Do a british male accent only.",
            "change_accent"
        ],
        [
            "Please, change to the female voice.",
            "change_accent"
        ],
        [
            "Switch from the male to the female voice.",
            "change_accent"
        ],
        [
            "When did I have my car looked at?",
            "last_maintenance"
        ],
        [
            "I need you to look up the date of my car's last visit to the shop.",
            "last_maintenance"
        ],
        [
            "I need to know when I last took my car in for a check up.",
            "last_maintenance"
        ],
        [
            "Find out when my most recent oil change occurred.",
            "last_maintenance"
        ],
        [
            "Is it too much trouble to put a stop on my bank account?",
            "freeze_account"
        ],
        [
            "Could you freeze my account, please?",
            "freeze_account"
        ],
        [
            "I'd like a block on my charles schwab account immediately.",
            "freeze_account"
        ],
        [
            "I'd like a stop placed on my bank account.",
            "freeze_account"
        ],
        [
            "What are ways to improve my credit score?",
            "improve_credit_score"
        ],
        [
            "How to protect my credit score?",
            "improve_credit_score"
        ],
        [
            "How to keep my credit score from going down?",
            "improve_credit_score"
        ],
        [
            "How can I keep my credit score from going down?",
            "improve_credit_score"
        ],
        [
            "Book me a car rental between january 1st to january 3rd in denver colorado and I'd prefer a ford.",
            "car_rental"
        ],
        [
            "I need a rental car.",
            "car_rental"
        ],
        [
            "I'd like a car rental between january 1st to the 3rd in denver, I'd like a ford",
            "car_rental"
        ],
        [
            "Are car rentals available out of new york from march 2 to march 3?",
            "car_rental"
        ],
        [
            "Do you have the date?",
            "date"
        ],
        [
            "Tell me what the date is today.",
            "date"
        ],
        [
            "In six days, what will it be?",
            "date"
        ],
        [
            "In 100 days from now, what will be the date?",
            "date"
        ],
        [
            "Set an alarm.",
            "alarm"
        ],
        [
            "Set an alarm to go to sleep and another to wake up.",
            "alarm"
        ],
        [
            "Provide assistance by setting an alarm at 8:00 and another for 11:00.",
            "alarm"
        ],
        [
            "Wake me up at 6 am.",
            "alarm"
        ],
        [
            "Let me know the exchange rate between dollars and rubles.",
            "exchange_rate"
        ],
        [
            "Exchange rate between Mexico and U.S.",
            "exchange_rate"
        ],
        [
            "What is the current going rate for exchanging dollars for pesos?",
            "exchange_rate"
        ],
        [
            "What's 50 euro in dollars?",
            "exchange_rate"
        ],
        [
            "I believe that there is some fraudulent activity on my capital one account.",
            "report_fraud"
        ],
        [
            "This costco charge looks fraudulent.",
            "report_fraud"
        ],
        [
            "I want to report fraudulent activity on my visa card, please.",
            "report_fraud"
        ],
        [
            "I have detected fraudulent activity on my account.",
            "report_fraud"
        ],
        [
            "Tell me some things to see in Tampa.",
            "travel_suggestion"
        ],
        [
            "What's the best place to just get away from it all?",
            "travel_suggestion"
        ],
        [
            "What are some interesting things to do in DC?",
            "travel_suggestion"
        ],
        [
            "Where do you suggest I plan my next vacation?",
            "travel_suggestion"
        ],
        [
            "What time is it?",
            "time"
        ],
        [
            "What is the time right now?",
            "time"
        ],
        [
            "What time is it exactly in the Νew zealand timezone?",
            "time"
        ],
        [
            "What time is it in the pacific standard timezone?",
            "time"
        ],
        [
            "What's the calorie count for tuna casserole?",
            "calories"
        ],
        [
            "How many calories in chicken?",
            "calories"
        ],
        [
            "Can you provide me the calories in the smoothie?",
            "calories"
        ],
        [
            "Add up the calories in tacos.",
            "calories"
        ],
        [
            "Is there enough fuel to make it to the Walmart?",
            "gas"
        ],
        [
            "Does my car have enough gas to get to atlantic city?",
            "gas"
        ],
        [
            "Do I have enough fuel for the drive to Tampa?",
            "gas"
        ],
        [
            "Do I have enough fuel to make it to the theater?",
            "gas"
        ],
        [
            "I need to know my cable bill minimum payment.",
            "min_payment"
        ],
        [
            "Ι would like to know the minimum payment for my credit card.",
            "min_payment"
        ],
        [
            "What is the minimum I can pay for my electric bill?",
            "min_payment"
        ],
        [
            "What is the minimum amount I can pay for my phone bill?",
            "min_payment"
        ],
        [
            "Add my birthday to my calendar for next month on the 5th.",
            "calendar_update"
        ],
        [
            "Remove from calendar jesse's bbq on June 9th.",
            "calendar_update"
        ],
        [
            "Get rid of everything on my calendar for March 2nd.",
            "calendar_update"
        ],
        [
            "Delete the hair appointment I had scheduled on may 1st please.",
            "calendar_update"
        ],
        [
            "How much money am I going to lose this year for state taxes?",
            "taxes"
        ],
        [
            "How much will I have to pay in Colorado taxes?",
            "taxes"
        ],
        [
            "What percentage do I pay in taxes?",
            "taxes"
        ],
        [
            "Ηow much do Ι pay in my taxes?",
            "taxes"
        ],
        [
            "Τranslate 'hello' in french.",
            "translate"
        ],
        [
            "How would I say \"hello\" if I were swedish?",
            "translate"
        ],
        [
            "How do they say \"hello\" in Brazil?",
            "translate"
        ],
        [
            "How would i say \"goodbye\" if I were norwegian?",
            "translate"
        ],
        [
            "How do I look up my credit score?",
            "credit_score"
        ],
        [
            "Can you reveal my credit score?",
            "credit_score"
        ],
        [
            "I wish to know my credit rating.",
            "credit_score"
        ],
        [
            "Tell me websites that share credit ratings.",
            "credit_score"
        ],
        [
            "I need some more lysol, could you order me some?",
            "order"
        ],
        [
            "Submit order for everything.",
            "order"
        ],
        [
            "Go ahead and order everything on my shoping list.",
            "order"
        ],
        [
            "Ι'd like you to purchase me canned soup.",
            "order"
        ],
        [
            "Τell me the name of the song that is playing.",
            "what_song"
        ],
        [
            "Can you look up the name of this song?",
            "what_song"
        ],
        [
            "I want to know the name of the song that's playing.",
            "what_song"
        ],
        [
            "Do you know what this song is?",
            "what_song"
        ],
        [
            "Am I allowed to increase the credit limit on my mastercard?",
            "credit_limit_change"
        ],
        [
            "Will they let me up my credit limit to $1000?",
            "credit_limit_change"
        ],
        [
            "Can I get my credit limit increased to $15,000?",
            "credit_limit_change"
        ],
        [
            "Can i get a higher limit on my american express card?",
            "credit_limit_change"
        ],
        [
            "What has my income been like?",
            "income"
        ],
        [
            "How much do I make per day?",
            "income"
        ],
        [
            "My income equals what amount?",
            "income"
        ],
        [
            "What's my pay?",
            "income"
        ],
        [
            "Is there air in my tires?",
            "tire_pressure"
        ],
        [
            "What is the air pressure in my tires?",
            "tire_pressure"
        ],
        [
            "Should I air up the tires?",
            "tire_pressure"
        ],
        [
            "Tell me how low the air in my tires is.",
            "tire_pressure"
        ],
        [
            "Does the central timezone include austin?",
            "timezone"
        ],
        [
            "What timezone is new york in?",
            "timezone"
        ],
        [
            "Timezone in miami is what like?",
            "timezone"
        ],
        [
            "What timezone is Los Angeles in?",
            "timezone"
        ],
        [
            "Tell me what I can find on the shopping list?",
            "shopping_list"
        ],
        [
            "Display shopping list.",
            "shopping_list"
        ],
        [
            "What do I need when I go shopping?",
            "shopping_list"
        ],
        [
            "Tell me what is on my shopping list.",
            "shopping_list"
        ],
        [
            "Tell me how good the apr is on my card, please.",
            "apr"
        ],
        [
            "Hey siri, tell me the apr on my disney visa.",
            "apr"
        ],
        [
            "What's my apr on this card?",
            "apr"
        ],
        [
            "Check the apr on my Disney visa, please.",
            "apr"
        ],
        [
            "I put in a credit card application, so what is the status with it currently?",
            "application_status"
        ],
        [
            "Can you check and see if my credit card application has been approved or not?",
            "application_status"
        ],
        [
            "How will I know when my application for a credit card has been processed?",
            "application_status"
        ],
        [
            "Has visa gotten back to me regarding my card app?",
            "application_status"
        ],
        [
            "Warm up my car for me.",
            "smart_home"
        ],
        [
            "What temp is the ac at?",
            "smart_home"
        ],
        [
            "What is the temperature the ac display is showing?",
            "smart_home"
        ],
        [
            "Turn on the tv",
            "smart_home"
        ],
        [
            "How long should cookies be in the oven?",
            "cook_time"
        ],
        [
            "How long should I cook the asparagus for?",
            "cook_time"
        ],
        [
            "How much time does it take to boil an egg?",
            "cook_time"
        ],
        [
            "How long will the turkey take to cook?",
            "cook_time"
        ],
        [
            "Revise the ai name.",
            "change_ai_name"
        ],
        [
            "I'm going to start calling you Alice.",
            "change_ai_name"
        ],
        [
            "Could I please change your name to Alicia?",
            "change_ai_name"
        ],
        [
            "Change the name of your system.",
            "change_ai_name"
        ],
        [
            "Change my pin number for my checking account.",
            "pin_change"
        ],
        [
            "I need to set up a new pin number for my college fund account.",
            "pin_change"
        ],
        [
            "I forgot the pin number for my college fund account.",
            "pin_change"
        ],
        [
            "I want to change my pin number for my checking account.",
            "pin_change"
        ],
        [
            "Did I have my wife and mine anniversary to my calendar?",
            "calendar"
        ],
        [
            "Tell me what my calendar looks like for March 12th.",
            "calendar"
        ],
        [
            "What's happening on May 3rd?",
            "calendar"
        ],
        [
            "When am I next having a meeting in December?",
            "calendar"
        ],
        [
            "Is it ok to eat alfredo that's been in the fridge since last sunday?",
            "food_last"
        ],
        [
            "So it seems I have had pizza in the fridge since monday, so is it safe to eat?",
            "food_last"
        ],
        [
            "When will the milk expire?",
            "food_last"
        ],
        [
            "How long can I put pizza in the fridge?",
            "food_last"
        ],
        [
            "Ι would appreciate it, if you could show me how to jump start a car battery.",
            "jump_start"
        ],
        [
            "Ηow do you jump start a subaru forester?",
            "jump_start"
        ],
        [
            "Ι need to know how to jump start my car.",
            "jump_start"
        ],
        [
            "Ιf my car battery is dead, what action do Ι need to do?",
            "jump_start"
        ],
        [
            "What day will my paycheck come?",
            "payday"
        ],
        [
            "What day do I get paid?",
            "payday"
        ],
        [
            "What is my next payday?",
            "payday"
        ],
        [
            "I need to know the date my next paycheck will be here.",
            "payday"
        ],
        [
            "Remind me in 5 hours.",
            "timer"
        ],
        [
            "Timer for 5 minutes.",
            "timer"
        ],
        [
            "Set a timer for 35 minutes.",
            "timer"
        ],
        [
            "I need you to set timer for me.",
            "timer"
        ],
        [
            "How many miles per gallon does this car get in the city?",
            "mpg"
        ],
        [
            "How does this car do on its fuel?",
            "mpg"
        ],
        [
            "Do you know what this car's mpg is?",
            "mpg"
        ],
        [
            "How many miles per gallon am I getting?",
            "mpg"
        ],
        [
            "What is the credit limit for my chase card?",
            "credit_limit"
        ],
        [
            "How high is my credit limit for my wells fargo card?",
            "credit_limit"
        ],
        [
            "Do you know my credit limit for the visa card?",
            "credit_limit"
        ],
        [
            "What is my visa card limit?",
            "credit_limit"
        ],
        [
            "What's the balance on my bills?",
            "bill_balance"
        ],
        [
            "Tell me how much my verizon and comcast bill come to together.",
            "bill_balance"
        ],
        [
            "My water bill is how much this month?",
            "bill_balance"
        ],
        [
            "What is my domain name bill?",
            "bill_balance"
        ],
        [
            "What type of gas does my car use?",
            "gas_type"
        ],
        [
            "What type of gas does this car need?",
            "gas_type"
        ],
        [
            "Tell me the gas I need to fill this car up with.",
            "gas_type"
        ],
        [
            "What gas do I need to fill the car up with?",
            "gas_type"
        ],
        [
            "When is the next scheduled day off?",
            "next_holiday"
        ],
        [
            "When will we have another day off?",
            "next_holiday"
        ],
        [
            "I need to know when the next holiday is.",
            "next_holiday"
        ],
        [
            "When is my next vacation day?",
            "next_holiday"
        ],
        [
            "What are the latest travel alerts for Dubai?",
            "travel_alert"
        ],
        [
            "Does Finland have any travel alerts I should be aware of?",
            "travel_alert"
        ],
        [
            "I am going to be traveling in Turkey, are there any alerts?",
            "travel_alert"
        ],
        [
            "What are today's travel advisories?",
            "travel_alert"
        ],
        [
            "Can I call a restaurant?",
            "make_call"
        ],
        [
            "Call home.",
            "make_call"
        ],
        [
            "Dial someone's phone number.",
            "make_call"
        ],
        [
            "Call robby.",
            "make_call"
        ],
        [
            "How old is ai?",
            "how_old_are_you"
        ],
        [
            "When did you come to exist?",
            "how_old_are_you"
        ],
        [
            "What age were you on your last birthday, ai?",
            "how_old_are_you"
        ],
        [
            "What age is the ai?",
            "how_old_are_you"
        ],
        [
            "Could you schedule car maintenance for me?",
            "schedule_maintenance"
        ],
        [
            "I need to get my tires checked out somewhere.",
            "schedule_maintenance"
        ],
        [
            "Schedule a time to get my oil changed.",
            "schedule_maintenance"
        ],
        [
            "How I do schedule car maintenance?",
            "schedule_maintenance"
        ],
        [
            "I'd like you to tell me a joke.",
            "tell_joke"
        ],
        [
            "What's the funniest thing you know about artificial intelligence?",
            "tell_joke"
        ],
        [
            "Tell me a non-offensive joke.",
            "tell_joke"
        ],
        [
            "Tell me a dirty joke.",
            "tell_joke"
        ],
        [
            "Bloomingdale's declined my card, and i'd like to know why.",
            "card_declined"
        ],
        [
            "I wish to know why my card was declined.",
            "card_declined"
        ],
        [
            "For what reason did my card get declined?",
            "card_declined"
        ],
        [
            "Tell me why was my card declined at the zoo.",
            "card_declined"
        ],
        [
            "I will be speaking chinese going forward.",
            "change_language"
        ],
        [
            "Adjust your language setting to english.",
            "change_language"
        ],
        [
            "The language I am using will now be italian.",
            "change_language"
        ],
        [
            "Can you speak to me in french?",
            "change_language"
        ],
        [
            "I'm having trouble finding my luggage I was on delta flight ab123 out of new york.",
            "lost_luggage"
        ],
        [
            "What should I do if my luggage is lost?",
            "lost_luggage"
        ],
        [
            "I think my luggage got lost.",
            "lost_luggage"
        ],
        [
            "I need assistance with my lost luggage, I was on american airlines ab123 out of Talahasse.",
            "lost_luggage"
        ],
        [
            "Can you let Ben and Jerry know my current location?",
            "share_location"
        ],
        [
            "Can you forward my location to Tom?",
            "share_location"
        ],
        [
            "Can you tell Bill and Craig where I am?",
            "share_location"
        ],
        [
            "Can you share my location with mom?",
            "share_location"
        ],
        [
            "Do you know who you report to?",
            "who_do_you_work_for"
        ],
        [
            "You work for whom?",
            "who_do_you_work_for"
        ],
        [
            "Do you work for me or is that wrong?",
            "who_do_you_work_for"
        ],
        [
            "Who do you function for?",
            "who_do_you_work_for"
        ],
        [
            "Is fixing mom's kitchen blind on my to do list?",
            "todo_list"
        ],
        [
            "Is 'cleaning the toilet' on my to-do list?",
            "todo_list"
        ],
        [
            "What do I have to do tomorrow, according to my to-do list?",
            "todo_list"
        ],
        [
            "Did I put \"unpacking groceries\" on my to do list?",
            "todo_list"
        ],
        [
            "What is your native home?",
            "where_are_you_from"
        ],
        [
            "What town were you born in?",
            "where_are_you_from"
        ],
        [
            "Where's home for you?",
            "where_are_you_from"
        ],
        [
            "Where were you manufactured?",
            "where_are_you_from"
        ],
        [
            "Convert cm to inch.",
            "measurement_conversion"
        ],
        [
            "How would you convert yards to inches?",
            "measurement_conversion"
        ],
        [
            "How many meters are in 2 inches?",
            "measurement_conversion"
        ],
        [
            "How many kilos are in 10 pounds?",
            "measurement_conversion"
        ]
    ],
    "test": [
        [
            "Tell me who made you, and who do you take orders from.",
            "who_made_you,who_do_you_work_for",
            "ellipsis"
        ],
        [
            "What company made this ai and which one do you work for?",
            "who_made_you,who_do_you_work_for",
            "anaphora"
        ],
        [
            "Can you find out how to report a damaged card? Plus, how long does it take to get a new one?",
            "damaged_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "What do I do about a card that's too scratched up to be properly scanned. Is it time to replace it?",
            "damaged_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "Help, I've lost my cellphone! Can you sync up with it?",
            "find_phone,sync_device",
            "anaphora"
        ],
        [
            "Since you found it, can you also link up with my phone now?",
            "find_phone,sync_device",
            "cataphora"
        ],
        [
            "Is there a travel alert in Spain and what is its timezone?",
            "travel_alert,timezone",
            "anaphora"
        ],
        [
            "Would I be safe if I traveled to Japan and what timezone is it in?",
            "travel_alert,timezone",
            "anaphora"
        ],
        [
            "I need to set a timer for 45 minutes and an alarm for 5am.",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "Set a 3-minute timer, and an 8am alarm.",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "Did I bring my car to the shop last week ? Also, how is its tire pressure?",
            "last_maintenance,tire_pressure",
            "anaphora"
        ],
        [
            "After you give me the date that I last got it checked, give me the tire pressure for my car.",
            "last_maintenance,tire_pressure",
            "cataphora"
        ],
        [
            "Is there a substantial credit limit on my visa and can I increase it?",
            "credit_limit,credit_limit_change",
            "anaphora"
        ],
        [
            "How high is my credit limit and how do I decrease it?",
            "credit_limit,credit_limit_change",
            "anaphora"
        ],
        [
            "Check how many days off I've taken and do I have any coming up or holidays?",
            "pto_used,next_holiday",
            "ellipsis"
        ],
        [
            "Please let me know how many days I've taken off, and what day is our next day off.",
            "pto_used,next_holiday",
            "ellipsis"
        ],
        [
            "I want to hear a joke about elephants and a fun fact about dolphins.",
            "tell_joke,fun_fact",
            "ellipsis"
        ],
        [
            "Tell me a joke about elephants and a fun fact about them.",
            "tell_joke,fun_fact",
            "anaphora"
        ],
        [
            "What is the due date for my bug bill? I need to pay it.",
            "bill_due,pay_bill",
            "anaphora"
        ],
        [
            "Is the bill due today, because I want to pay it from my bank account.",
            "bill_due,pay_bill",
            "anaphora"
        ],
        [
            "How soon does my credit card expire and what exactly is the status of my application for it?",
            "expiration_date,application_status",
            "anaphora"
        ],
        [
            "Tell me the expiration date of my credit card, then the status on my application for the hsbc credit card.",
            "expiration_date,application_status",
            "ellipsis"
        ],
        [
            "How much gas is left in my car and what kind does it take to fill it?",
            "gas,gas_type",
            "cataphora"
        ],
        [
            "Tell me my gas tank levels, and what gas this car takes.",
            "gas,gas_type",
            "ellipsis"
        ],
        [
            "Book me a rental car in Wichita, then a flight to Los angeles from Las vegas on american airlines.",
            "car_rental,book_flight",
            "ellipsis"
        ],
        [
            "I need to rent a car from may 11th to may 13th in Chicago, and a flight with jet blue to Boston from New york.",
            "car_rental,book_flight",
            "ellipsis"
        ],
        [
            "On thursday, there was an unauthorized use of my visa, and yesterday it was damaged.",
            "report_fraud,damaged_card",
            "anaphora"
        ],
        [
            "Who do I contact to report fraud on my visa? Plus, I can't use it, because I damaged it.",
            "report_fraud,damaged_card",
            "anaphora"
        ],
        [
            "Convert kilos to pounds, and 200 us dollars to british pounds.",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "Help me convert kilos to pounds, and 20 yen to dollars.",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "What do I have to do if I lost both my luggage, and my pin for my college fund account?",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "I think my luggage is lost, as well as my pin for my retirement account.",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "When were you made, and where?",
            "how_old_are_you,where_are_you_from",
            "ellipsis"
        ],
        [
            "May I ask your age, and your origin?",
            "how_old_are_you,where_are_you_from",
            "ellipsis"
        ],
        [
            "Check my calendar for march 7th, and my reminder list.",
            "calendar,reminder",
            "ellipsis"
        ],
        [
            "Check my calendar, then my reminders.",
            "calendar,reminder",
            "ellipsis"
        ],
        [
            "Remind me of the last date that I got my car checked and do I have enough gas in it to get to Dallas?",
            "last_maintenance,gas",
            "anaphora"
        ],
        [
            "Did I take my car to the mechanics recently and also how much gas is left in it?",
            "last_maintenance,gas",
            "anaphora"
        ],
        [
            "Once you text him, share location with John promptly.",
            "text,share_location",
            "cataphora"
        ],
        [
            "I want to tell susan that the meeting has been cancelled and also make my location available with her.",
            "text,share_location",
            "anaphora"
        ],
        [
            "Find me a recipe for chili, as well as the the calorie count of a burrito.",
            "recipe,calories",
            "ellipsis"
        ],
        [
            "How do you cook eggs? Plus, how many calories are in them?",
            "recipe,calories",
            "anaphora"
        ],
        [
            "Bob is my name now. Can you tell me yours?",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "Ai, my name is Deb please use my name when you talk to me. What's yours?",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "I seem to have lost my luggage, as well as my phone! What are my options now?",
            "lost_luggage,find_phone",
            "ellipsis"
        ],
        [
            "I think my luggage is lost, and my phone is, too.",
            "lost_luggage,find_phone",
            "ellipsis"
        ],
        [
            "When is the expiration date of my card? Moreover, when is my new one expected to arrive?",
            "expiration_date,replacement_card_duration",
            "anaphora"
        ],
        [
            "Let me know when my credit card expires and the phone number for my credit card company.",
            "expiration_date,replacement_card_duration",
            "ellipsis"
        ],
        [
            "What is the gas mileage of my car and when is it due for its next oil change?",
            "mpg,oil_change_when",
            "anaphora"
        ],
        [
            "Tell me the car's gas mileage, as well as the next time I ought to change my oil.",
            "mpg,oil_change_when",
            "ellipsis"
        ],
        [
            "Remind me of the last date that I got my car checked, as well of the mpg for this car.",
            "last_maintenance,mpg",
            "ellipsis"
        ],
        [
            "Before letting me know the last time it got looked at, I also want you to tell me the fuel economy of my car.",
            "last_maintenance,mpg",
            "cataphora"
        ],
        [
            "Track my order, then my cellphone.",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "I need to track my order, as well as my phone.",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "What's the amount of my income and do you know the price for my taxes in it?",
            "income,taxes",
            "anaphora"
        ],
        [
            "Can you please tell me my income and then the total of my federal taxes?",
            "income,taxes",
            "ellipsis"
        ],
        [
            "Since you know what it is playing, could you please tell me the name of the current song? Then, play the next one.",
            "what_song,next_song",
            "cataphora"
        ],
        [
            "First, tell me the song that is currently playing, then might we go to the next one?",
            "what_song,next_song",
            "anaphora"
        ],
        [
            "I have a bogus transaction from amazon on my account, so please force it to freeze.",
            "report_fraud,freeze_account",
            "anaphora"
        ],
        [
            "Well, I have a crap transaction from guitar center on my account. So, put a freeze on it, please",
            "report_fraud,freeze_account",
            "anaphora"
        ],
        [
            "Can you reserve a meeting space for 4:00 on thursday? Plus, list meetings on calendar on this day.",
            "schedule_meeting,meeting_schedule",
            "anaphora"
        ],
        [
            "First, help me set up a meeting and also is there any scheduled for today?",
            "schedule_meeting,meeting_schedule",
            "ellipsis"
        ],
        [
            "May I have your name, cause your new one would be Joe, okay?",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "What name do you go by, then can we change it to Clara?",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "I would like to know the proper way to greet an adult in portuguese and provide me with its spelling, too.",
            "translate,spelling",
            "anaphora"
        ],
        [
            "I want to learn a phrase in Mandarin and the spelling in French, too.",
            "translate,spelling",
            "ellipsis"
        ],
        [
            "What's the apr on my credit card?Also, can I increase the credit limit on it?",
            "apr,credit_limit_change",
            "anaphora"
        ],
        [
            "Can you tell me my apr on my credit card, then how to increase credit limit for chase card?",
            "apr,credit_limit_change",
            "ellipsis"
        ],
        [
            "What day did I last take my car to the shop? I need to bring it in, because the check engine light is staying lit",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "Have I recently had an oil change? Plus, can you see if I can make an appointment to have it changed?",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "Please set the oven to 350 f, then the alarm for me.",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "Set the ceiling fan to low, the alarm to 6 AM.",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "What day is payday and how many of them did I take off?",
            "payday,pto_used",
            "anaphora"
        ],
        [
            "Can you tell me the date of my last check, then the amount of days off I have taken so far since january?",
            "payday,pto_used",
            "ellipsis"
        ],
        [
            "Add \"mopping\" to the to do list and are carrots added to the grocery one?",
            "todo_list_update,shopping_list",
            "anaphora"
        ],
        [
            "Remove all the items from my to do list, then recite the ones Ι'm planning to purchase.",
            "todo_list_update,shopping_list",
            "anaphora"
        ],
        [
            "Ιs it possible to talk to you in Μandarin? Moreover, I want you to change to the male voice.",
            "change_language,change_accent",
            "cataphora"
        ],
        [
            "Change your language to russian, your voice to male.",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "Give me the point total on my visa card and what is the last transaction on it?",
            "rewards_balance,transactions",
            "anaphora"
        ],
        [
            "Tell me my debit card's rewards balance, as well as my recent visa card transaction.",
            "rewards_balance,transactions",
            "ellipsis"
        ],
        [
            "If you can tell me what's on it, can you also remove all the items from my to-do list?",
            "todo_list,todo_list_update",
            "cataphora"
        ],
        [
            "Is \"laundry\" on my todo list? Also, please remove science fair from it.",
            "todo_list,todo_list_update",
            "anaphora"
        ],
        [
            "Show me my ten most recent transactions on account xyz, then the apr of my target credit card.",
            "transactions,apr",
            "ellipsis"
        ],
        [
            "How much have I spent on my debit card this month. Futhermore, how high is the apr on it?",
            "transactions,apr",
            "anaphora"
        ],
        [
            "Was my car in the shop this past week? Can you also tell me what gas does it take, too?",
            "last_maintenance,gas_type",
            "anaphora"
        ],
        [
            "What day did I last take my car in and which gas type goes into it?",
            "last_maintenance,gas_type",
            "anaphora"
        ],
        [
            "Can you find my phone? Then, I want you to use it to make a call.",
            "find_phone,make_call",
            "anaphora"
        ],
        [
            "After you find out where I last put it, use my phone to call Alexa.",
            "find_phone,make_call",
            "cataphora"
        ],
        [
            "After you tell me the time in California, I also need to know its timezone.",
            "time,timezone",
            "anaphora"
        ],
        [
            "Tell me the time in Las vegas, as well as the timezone for L.A.",
            "time,timezone",
            "ellipsis"
        ],
        [
            "I need to know why my card got declined. Plus, do I get charged extra for using it in portland?",
            "card_declined,international_fees",
            "anaphora"
        ],
        [
            "Find out why my card got declined, as well as if my bank charges transaction fees on my american card, if I use it internationally.",
            "card_declined,international_fees",
            "ellipsis"
        ],
        [
            "How do you say please in french? Then, speak in it please.",
            "translate,change_language",
            "anaphora"
        ],
        [
            "How do you say fast in spanish? Please let's speak in it.",
            "translate,change_language",
            "anaphora"
        ],
        [
            "How long should I boil eggs and when are they expired?",
            "cook_time,food_last",
            "anaphora"
        ],
        [
            "How long does it take to bake these bananas and how long can I leave them in the freezer before I have to throw them out?",
            "cook_time,food_last",
            "anaphora"
        ],
        [
            "Will you tell me my bank balance, as well as my credit score?",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "Check my checking balance, then my credit score.",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "Tell me my chase credit card's apr, as well as my spending limit on my discover card.",
            "apr,credit_limit",
            "ellipsis"
        ],
        [
            "Could you share my credit card's apr, then my credit max.",
            "apr,credit_limit",
            "ellipsis"
        ],
        [
            "Send Jack a text saying hi, then remove his party from my calendar.",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "Get a text to Mark, then erase the meeting with him from my calendar.",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "Search steps for how to report a card lost, then tell me how much time before my new card it will be mailed to me.",
            "report_lost_card,replacement_card_duration",
            "anaphora"
        ],
        [
            "How do I report that I lost the card and how can I request a new one?",
            "report_lost_card,replacement_card_duration",
            "anaphora"
        ],
        [
            "How long ago did I take my car to the shop. Plus, its battery is dead, so what should I do?",
            "last_maintenance,jump_start",
            "anaphora"
        ],
        [
            "Tell me when my last oil change was, as well as the steps should I take, if I think my car battery is dead.",
            "last_maintenance,jump_start",
            "anaphora"
        ],
        [
            "Tell me what my credit score is and how can I increase it, please.",
            "credit_score,improve_credit_score",
            "anaphora"
        ],
        [
            "Could you give me my credit score, then tips on improving it?",
            "credit_score,improve_credit_score",
            "ellipsis"
        ],
        [
            "Can you find my phone, then my location?",
            "find_phone,current_location",
            "anaphora"
        ],
        [
            "Do you know my phone's location, as well as mine?",
            "find_phone,current_location",
            "ellipsis"
        ],
        [
            "Can I find my current location and then share it with David?",
            "current_location,share_location",
            "anaphora"
        ],
        [
            "Display my location on the map and then send it to sis.",
            "current_location,share_location",
            "anaphora"
        ],
        [
            "Tell me some fun activities to do in Oklahoma city. Oh, is it safe in it?",
            "travel_suggestion,travel_alert",
            "anaphora"
        ],
        [
            "Give me some ideas of what to do during my trip to Dallas, along with Mexico travel alerts.",
            "travel_suggestion,travel_alert",
            "ellipsis"
        ],
        [
            "My card declined, so it's time to replace it.",
            "card_declined,replacement_card_duration",
            "anaphora"
        ],
        [
            "My credit card was turned down at target and I'd like to know why. Oh, maybe it's time to order and receive a new one.",
            "card_declined,replacement_card_duration",
            "anaphora"
        ],
        [
            "Tell me my water bill please. Plus, at a minimum, what must I pay on my verizon one?",
            "bill_balance,min_payment",
            "anaphora"
        ],
        [
            "What does my cable bill look like and what is the lowest amount I can pay for my hospital one?",
            "bill_balance,min_payment",
            "anaphora"
        ],
        [
            "What's the most I can charge on my card? Oh, I don't remember its pin number,too.",
            "credit_limit_change,pin_change",
            "anaphora"
        ],
        [
            "What's the limit on my discover card? Furthermore, correct its pin to 1234 on my checking account.",
            "credit_limit_change,pin_change",
            "anaphora"
        ],
        [
            "Give me a recipe for chili, then a suggestion for chinese around here.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "Show me ideas for hamburger, and suggestions for thai food.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "How to do an oil change and when?",
            "oil_change_how,oil_change_when",
            "ellipsis"
        ],
        [
            "Can you teach me how to change my oil in my car and how soon until I will need to get it changed?",
            "oil_change_how,oil_change_when",
            "anaphora"
        ],
        [
            "Tell me the date, as well as my current location.",
            "date,current_location",
            "ellipsis"
        ],
        [
            "Show me today's date, and my location.",
            "date,current_location",
            "ellipsis"
        ],
        [
            "Is it on my shopping list? My milk is running out, so you will order me some more?",
            "shopping_list,order",
            "cataphora"
        ],
        [
            "Please let me know what is on my shopping list, as well as the price of bluetooth speakers on amazon.",
            "shopping_list,order",
            "ellipsis"
        ],
        [
            "Get mom on the phone, then share my location with her please.",
            "make_call,share_location",
            "anaphora"
        ],
        [
            "Call Mark, then let him know where I am.",
            "make_call,share_location",
            "anaphora"
        ],
        [
            "What's the current apr on my credit card and how much of a credit limit does visa allow?",
            "apr,credit_limit"
        ],
        [
            "First,you need to tell me my credit card's apr. Also, can I get my limit increased on my discover card?",
            "apr,credit_limit_change"
        ],
        [
            "Do I have money in my wells fargo account for nike's? Also, what number is my credit score currently?",
            "balance,credit_score"
        ],
        [
            "How much is my water and sewer and what must I pay, at a minimum, on my verizon bill?",
            "bill_balance,min_payment"
        ],
        [
            "I want to know when the deadline is to pay my car loan. Moreover, pay my con edison bill using my capital one account.",
            "bill_due,pay_bill"
        ],
        [
            "Is the marathon on Friday added to my calendar and what were the things I want to recall?",
            "calendar,reminder"
        ],
        [
            "I need to rent a car for may 3rd to may 5th in Indianapoli, and i'd like a mercedes. By the way, can I fly from atlanta to san francisco for less than 100 dollars?",
            "car_rental,book_flight"
        ],
        [
            "Why was my card not accepted and will I be charged a transaction fee on my discover card in Cuba?",
            "card_declined,international_fees"
        ],
        [
            "Do you know why my card got declined? Besides, can credit card companies expedite delivery of reissued credit cards?",
            "card_declined,replacement_card_duration"
        ],
        [
            "Please speak in tagalog. Also, talk to me in a different accent, too.",
            "change_language,change_accent"
        ],
        [
            "Don't call me anything besides Bailey. Also, what's your name anyway?",
            "change_user_name,what_is_your_name"
        ],
        [
            "How long will it take to cook a lasagna and also what is the longest I can leave meatballs in sauce in the freezer before it is no longer safe to eat.",
            "cook_time,food_last"
        ],
        [
            "What's the most I can charge on my card and can I increase the credit limit on my capital one card?",
            "credit_limit,credit_limit_change"
        ],
        [
            "Not only I need to increase credit limit for my chase card, but also I need the pin number for my checking account.",
            "credit_limit_change,pin_change"
        ],
        [
            "What is my credit rating and when will the credit score improve?",
            "credit_score,improve_credit_score"
        ],
        [
            "Well, show my position on the map and then give Ann and Scott my location.",
            "current_location,share_location"
        ],
        [
            "My card became damaged when I dropped it in the parking lot and it got ran over. Also, is my replacement card due to arrive in the mail today,too?",
            "damaged_card,replacement_card_duration"
        ],
        [
            "What day is today? Also, can you tell me my current location?",
            "date,current_location"
        ],
        [
            "Can you tell me what is the date of expiry for my visa card and has my application for my visa card gone through?",
            "expiration_date,application_status"
        ],
        [
            "I want to bring my card on the texas trip in june, will it be expired by then? Also, how long will it takes to get a new credit card?",
            "expiration_date,replacement_card_duration"
        ],
        [
            "I've lost my phone somewhere. Also, tell me the current location.",
            "find_phone,current_location"
        ],
        [
            "Where's my phone and computer? Furthermore, place a call to Alexa.",
            "find_phone,make_call"
        ],
        [
            "Can you help me locate my phone, please? I also want you to pair with my phone.",
            "find_phone,sync_device"
        ],
        [
            "How much gas do I have here? Oh, I want to know what kind of gas this car uses, too",
            "gas,gas_type"
        ],
        [
            "What's your age and what place are you from?",
            "how_old_are_you,where_are_you_from"
        ],
        [
            "Can you please tell me my income and what taxes will I owe from my income?",
            "income,taxes"
        ],
        [
            "Give me an exact date of when I took my car to the mechanic and tell me my gas tank levels, too",
            "last_maintenance,gas"
        ],
        [
            "Tell me when I last had my oil changed. Moreover, for this car what kind of fuel does it take?",
            "last_maintenance,gas_type"
        ],
        [
            "Well, tell me when my last oil change was. Also, what do I need to do to get my car jump started?",
            "last_maintenance,jump_start"
        ],
        [
            "Not only tell me what was the date of the last time I took my car to the shop, but also inform me about this car's highway mpg.",
            "last_maintenance,mpg"
        ],
        [
            "When did I take my car to the shop last. I also need to make an appointment for an oil change.",
            "last_maintenance,schedule_maintenance"
        ],
        [
            "I'd like to know the last time my car got looked at. Besides, I gotta know how low are my tires on air.",
            "last_maintenance,tire_pressure"
        ],
        [
            "What happened to my luggage? Plus, can you help me hunt for my missing cellphone?",
            "lost_luggage,find_phone"
        ],
        [
            "I am a bit panicked because my luggage seems to have gone missing. Also, alter the pin on my savings account to be 1234.",
            "lost_luggage,pin_change"
        ],
        [
            "I need you to phone Sal. Also, send david my location.",
            "make_call,share_location"
        ],
        [
            "How many milliliters are in 2 gallons? Plus, what is the conversion of $30 in canadian dollars?",
            "measurement_conversion,exchange_rate"
        ],
        [
            "What is the highway mpg on this car like? Find out for me when my car is next due for an oil change,too",
            "mpg,oil_change_when"
        ],
        [
            "Diy oil change and oil type and what is the recommended interval to get my oil changed?",
            "oil_change_how,oil_change_when"
        ],
        [
            "Is my order on its way? What's going on? Also, would you know where to find my phone?",
            "order_status,find_phone"
        ],
        [
            "When do I next get paid ? Plus, so far how much pto have I used?",
            "payday,pto_used"
        ],
        [
            "So, how many days did I take off and how long before the next holiday here?",
            "pto_used,next_holiday"
        ],
        [
            "How do you make fried rice? Besides, what is the calorie content in spaghetti?",
            "recipe,calories"
        ],
        [
            "Can you find me a pork recipe and do you have any suggested roman recipes, too?",
            "recipe,meal_suggestion"
        ],
        [
            "Well, I have a bogus transaction from amazon on my account. By the way, my card has become too frayed and torn to use.",
            "report_fraud,damaged_card"
        ],
        [
            "Oh, my online bill has some items that I didn't purchase from penneys. Plus, could you please put a stop on my bank account?",
            "report_fraud,freeze_account"
        ],
        [
            "Well, I lost my card and I need to report it. Plus, how long before the replacement card is mailed to me?",
            "report_lost_card,replacement_card_duration"
        ],
        [
            "How many rewards points do I have on my mastercard ? Also, can you verify my recent visa card transaction?",
            "rewards_balance,transactions"
        ],
        [
            "On Friday at 5 PM, please schedule a room for the meeting and also check my schedule for today's meetings.",
            "schedule_meeting,meeting_schedule"
        ],
        [
            "Does the shopping list have apples on it ? Oh, and can you order some more eggs for me, since i just ran out?",
            "shopping_list,order"
        ],
        [
            "Turn on the microwave for 3 minutes. Oh, I need to be up by noon, too.",
            "smart_home,alarm"
        ],
        [
            "Not only tell me something funny about horses, but also tell me the fun facts of today, please.",
            "tell_joke,fun_fact"
        ],
        [
            "Tell Jim I'm coming home soon. By the way, remove lunch with Sally that is on my calendar on tuesday the 8th.",
            "text,calendar_update"
        ],
        [
            "Well, I want you to text mark. Plus, can you indicate my location to my friend.",
            "text,share_location"
        ],
        [
            "What time is it? Also, does Denver reside in the eastern timezones?",
            "time,timezone"
        ],
        [
            "First, set a timer to go off in 1 hour, then I need to set an alarm.",
            "timer,alarm"
        ],
        [
            "I really want to know my todo list again and also put \"babysitting\" on my to do list.",
            "todo_list,todo_list_update"
        ],
        [
            "Can you vacuum my to-do list, then tell me the items in my shopping list?",
            "todo_list_update,shopping_list"
        ],
        [
            "Show my my most recent visa card transaction and then tell me my credit card's apr, please.",
            "transactions,apr"
        ],
        [
            "How would one say \"cruiser\" in China? Oh, I want to talk english, too.",
            "translate,change_language"
        ],
        [
            "What's the spanish word for pasta? I need help spelling \"exquisite\", too.",
            "translate,spelling"
        ],
        [
            "I want to know if I will be safe if I travel to europe. Also, what timezone do they use in Arizona?",
            "travel_alert,timezone"
        ],
        [
            "Fist give me some recommendations of good tourist attractions in montreal, then I would like to know the alerts for travel in Colombia.",
            "travel_suggestion,travel_alert"
        ],
        [
            "What do I call you? By the way, can I call you James instead?",
            "what_is_your_name,change_ai_name"
        ],
        [
            "What is the title of this song. Besides, play the next song please if you would.",
            "what_song,next_song"
        ],
        [
            "Can you tell me who made you and what firm do you work for?",
            "who_made_you,who_do_you_work_for"
        ],
        [
            "What company do you work for?",
            "who_do_you_work_for"
        ],
        [
            "What is the expire of milk?",
            "food_last"
        ],
        [
            "You need to tell me my credit card's apr, please.",
            "apr"
        ],
        [
            "Tell me my to-do list.",
            "todo_list"
        ],
        [
            "Are there any holidays coming and when?",
            "next_holiday"
        ],
        [
            "What time is it right now in Adelaide, Australia?",
            "time"
        ],
        [
            "Recite the items I'm planning to purchase.",
            "shopping_list"
        ],
        [
            "What is the next date for which I can get an oil change appointment?",
            "schedule_maintenance"
        ],
        [
            "I'd like to start calling you lover.",
            "change_ai_name"
        ],
        [
            "So how many days did I take off?",
            "pto_used"
        ],
        [
            "Can you explain why I couldn't use my card at target?",
            "card_declined"
        ],
        [
            "What was the date of my last oil change?",
            "last_maintenance"
        ],
        [
            "Can you tell me some strategies for raising my credit score?",
            "improve_credit_score"
        ],
        [
            "How much do I owe visa?",
            "bill_balance"
        ],
        [
            "So, how much can I use on my visa?",
            "credit_limit"
        ],
        [
            "When is my new card expected to arrive?",
            "replacement_card_duration"
        ],
        [
            "Can we move onto the next song?",
            "next_song"
        ],
        [
            "I want to report fraudulent activity on my navy federal card.",
            "report_fraud"
        ],
        [
            "How old will you be this year?",
            "how_old_are_you"
        ],
        [
            "Don't call me anything besides Bailey.",
            "change_user_name"
        ],
        [
            "When do I next get paid?",
            "payday"
        ],
        [
            "Please begin a timer.",
            "timer"
        ],
        [
            "I can't use my card because it was damaged badly.",
            "damaged_card"
        ],
        [
            "I believe that my car battery has died, what do I do next?",
            "jump_start"
        ],
        [
            "I need to give my location to Macy and George.",
            "share_location"
        ],
        [
            "Can you reserve a room for a Friday meeting at 5pm?",
            "schedule_meeting"
        ],
        [
            "What is the minimum I can pay on my cell phone bill?",
            "min_payment"
        ],
        [
            "I'm looking for flights that depart on the 3rd and return on z from Monday to Friday.",
            "book_flight"
        ],
        [
            "Show my position on the map.",
            "current_location"
        ],
        [
            "Computer, place a call to alexa.",
            "make_call"
        ],
        [
            "What's my car's mpg?",
            "mpg"
        ],
        [
            "Give me step by step instructions for changing my oil.",
            "oil_change_how"
        ],
        [
            "I need to buy something, please.",
            "order"
        ],
        [
            "How much gas do I have in the tank?",
            "gas"
        ],
        [
            "How many millimeters are in 21 centimeters?",
            "measurement_conversion"
        ],
        [
            "Tell me the number of calories in a coke.",
            "calories"
        ],
        [
            "Show my my most recent visa card transaction",
            "transactions"
        ],
        [
            "Please set the oven to 350 f.",
            "smart_home"
        ],
        [
            "Tell me some fun activities to do in Oklahoma city",
            "travel_suggestion"
        ],
        [
            "What kind of gas does your car use?",
            "gas_type"
        ],
        [
            "Let me know about the status of my credit card application.",
            "application_status"
        ],
        [
            "Please put \"babysitting\" on my to do list.",
            "todo_list_update"
        ],
        [
            "When is my meeting with invoicing scheduled?",
            "meeting_schedule"
        ],
        [
            "Spell \"Aaron\" for me.",
            "spelling"
        ],
        [
            "When should I get my car's oil changed next?",
            "oil_change_when"
        ],
        [
            "Is there a fee if I use my card in France?",
            "international_fees"
        ],
        [
            "When will I get my order?",
            "order_status"
        ],
        [
            "Give me a fun fact about kangaroo.",
            "fun_fact"
        ],
        [
            "I'm feeling like a greek meal and need some suggestions.",
            "meal_suggestion"
        ],
        [
            "I wanna have an alarm.",
            "alarm"
        ],
        [
            "Can you add an event to my calendar?",
            "calendar_update"
        ],
        [
            "When will my citi card expire?",
            "expiration_date"
        ],
        [
            "I lost all my stuff that I had packed.",
            "lost_luggage"
        ],
        [
            "How much is one us dollar in british pounds?",
            "exchange_rate"
        ],
        [
            "My tires are filled enough or no?",
            "tire_pressure"
        ],
        [
            "How much in taxes will I owe?",
            "taxes"
        ],
        [
            "Find me a rental car for next week, from friday the 5th thru monday the 8th, any kind.",
            "car_rental"
        ],
        [
            "Where do you come from?",
            "where_are_you_from"
        ],
        [
            "Please unsync from my phone right now.",
            "sync_device"
        ],
        [
            "Pay my electric bill for me.",
            "pay_bill"
        ],
        [
            "Access my checking account and update my pin to 1234.",
            "pin_change"
        ],
        [
            "How do you say \"fast\" in spanish?",
            "translate"
        ],
        [
            "Would you change your voice to the male british accent for me?",
            "change_accent"
        ],
        [
            "Can you identify this song that's playing?",
            "what_song"
        ],
        [
            "Hey, how do I call your attention?",
            "what_is_your_name"
        ],
        [
            "Where do I go for my credit score?",
            "credit_score"
        ],
        [
            "What is Texas's timezone?",
            "timezone"
        ],
        [
            "How do I report the card as lost?",
            "report_lost_card"
        ],
        [
            "Can I speak spanish to you hombre?",
            "change_language"
        ],
        [
            "Can you tell me the to do's on my reminder list.",
            "reminder"
        ],
        [
            "How do I adjust my credit limit?",
            "credit_limit_change"
        ],
        [
            "Give me the point total on my visa card",
            "rewards_balance"
        ],
        [
            "Help, I've lost my cellphone!",
            "find_phone"
        ],
        [
            "What company were you designed by?",
            "who_made_you"
        ],
        [
            "I want to tell susan that the meeting has been cancelled.",
            "text"
        ],
        [
            "What is the date of tomorrow?",
            "date"
        ],
        [
            "What amount of money do I earn?",
            "income"
        ],
        [
            "Tell me the current balance of my bank accounts.",
            "balance"
        ],
        [
            "How do you prepare taco?",
            "recipe"
        ],
        [
            "Tell me when my water bill is due.",
            "bill_due"
        ],
        [
            "What do I have going on on my calendar for march 18th?",
            "calendar"
        ],
        [
            "Lasagna takes how long to cook?",
            "cook_time"
        ],
        [
            "Let's hear a joke from you please.",
            "tell_joke"
        ],
        [
            "What are the travel alerts for the us ?",
            "travel_alert"
        ],
        [
            "I need my bank account frozen.",
            "freeze_account"
        ]
    ],
    "valid": [
        [
            "Can you tell me how good my card's apr is? Also, how much can I spend on my discover one?",
            "apr,credit_limit",
            "anaphora"
        ],
        [
            "I want to know the apr on my capital card, and the credit limit on my discover card.",
            "apr,credit_limit",
            "ellipsis"
        ],
        [
            "Can you tell me the status of my card's apr, and how to increase my credit limit?",
            "apr,credit_limit_change",
            "ellipsis"
        ],
        [
            "What is my credit card's annual percentage rate and can I increase my credit limit on it?",
            "apr,credit_limit_change",
            "anaphora"
        ],
        [
            "Can you tell me how much money I have in my bank accounts, and how high is my credit score?",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "I want to know my pnc balance, and my fico credit score.",
            "balance,credit_score",
            "ellipsis"
        ],
        [
            "Find out how much my water bill costs and the smallest amount I can pay on it.",
            "bill_balance,min_payment",
            "anaphora"
        ],
        [
            "Could you tell me the amount owed on gas and electric, and the minimum payment on my electric bill?",
            "bill_balance,min_payment",
            "ellipsis"
        ],
        [
            "When is my cellphone bill due, because I want to pay it.",
            "bill_due,pay_bill",
            "anaphora"
        ],
        [
            "What day is my telephone bill due and can I get some funds to pay my utility one?",
            "bill_due,pay_bill",
            "anaphora"
        ],
        [
            "Can you check what I have on my calendar for tuesday? Also, read my reminder list for that day.",
            "calendar,reminder",
            "anaphora"
        ],
        [
            "Check my calendar for tuesday, also my reminder list for thursday.",
            "calendar,reminder",
            "ellipsis"
        ],
        [
            "Help me find a car to rent, then a flight from Philly to Atl for june 5th to 8th.",
            "car_rental,book_flight",
            "ellipsis"
        ],
        [
            "I need a car rental this week and also a round trip flight from Denver international to New york international on the 8th to the 16th.",
            "car_rental,book_flight",
            "ellipsis"
        ],
        [
            "Why was my credit card not accepted? Also, if I am in Tulsa, will I get charged extra if I use it?",
            "card_declined,international_fees",
            "anaphora"
        ],
        [
            "Is there a reason my card was declined? Plus, will I be charged if I use it in Russia?",
            "card_declined,international_fees",
            "anaphora"
        ],
        [
            "I can't figure out why my card was declined at target and if I lose it, will I get a replacement immediately?",
            "card_declined,replacement_card_duration",
            "anaphora"
        ],
        [
            "Was there a problem with my card yesterday? Also, about how long does it usually take a new one to get mailed to me",
            "card_declined,replacement_card_duration",
            "cataphora"
        ],
        [
            "Switch language to mandarin, and voice to male,please.",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "Please change your response language to english, and your accent to british.",
            "change_language,change_accent",
            "ellipsis"
        ],
        [
            "My name is nick, what's yours?",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "Jason is my name, what exactly is yours?",
            "change_user_name,what_is_your_name",
            "ellipsis"
        ],
        [
            "I need to know how long to cook this chicken for? Plus, how long can I keep it in the freezer for, before it gets freezer burnt?",
            "cook_time,food_last",
            "anaphora"
        ],
        [
            "How long does it take to cook hot pockets and also can I keep them in the fridge for 3 days?",
            "cook_time,food_last",
            "cataphora"
        ],
        [
            "What is my credit limit on my discover card? Plus, can I make a change to my credit limit on my capital one?",
            "credit_limit,credit_limit_change",
            "anaphora"
        ],
        [
            "What is the credit limit on my victoria's secret card? Can I increase it, too?",
            "credit_limit,credit_limit_change",
            "anaphora"
        ],
        [
            "I would like to have my credit increased, then my pin changed.",
            "credit_limit_change,pin_change",
            "ellipsis"
        ],
        [
            "How can I make a change to my credit limit, as well as to my pin?",
            "credit_limit_change,pin_change",
            "ellipsis"
        ],
        [
            "What's my current credit score? Furthermore, what is the best way to keep it from going down?",
            "credit_score,improve_credit_score",
            "anaphora"
        ],
        [
            "Can you tell me my credit rating, and ways to improve it?",
            "credit_score,improve_credit_score",
            "ellipsis"
        ],
        [
            "Please tell me the address of my current location. Then, I would like to share it with Stefanie.",
            "current_location,share_location",
            "ellipsis"
        ],
        [
            "What is this place? I'd like to send it to steve, too.",
            "current_location,share_location",
            "anaphora"
        ],
        [
            "Tell me what should I do with an unusable and damaged card, as well as when I recieve my replacement card.",
            "damaged_card,replacement_card_duration",
            "ellipsis"
        ],
        [
            "I want to report my damaged card and be informed when I will recieve my replacement.",
            "damaged_card,replacement_card_duration",
            "ellipsis"
        ],
        [
            "Give me the date, then my current location.",
            "date,current_location",
            "ellipsis"
        ],
        [
            "Tell me the date, as well as the currentl location, please.",
            "date,current_location",
            "ellipsis"
        ],
        [
            "When will my card expire? Oh, has its application processed yet, too?",
            "expiration_date,application_status",
            "anaphora"
        ],
        [
            "Tell me the expiration date of my card, then the present status of its application.",
            "expiration_date,application_status",
            "ellipsis & anaphora"
        ],
        [
            "What month does my card close? Plus, how long does it usually take for a new credit card to come?",
            "expiration_date,replacement_card_duration",
            "cataphora"
        ],
        [
            "In what month does my credit card expire and will it take more than a month to get a new one?",
            "expiration_date,replacement_card_duration",
            "cataphora"
        ],
        [
            "Can you find me my phone, as well as my gps coordinates?",
            "find_phone,current_location",
            "ellipsis"
        ],
        [
            "Help me locate my phone, and the address of my current location, please.",
            "find_phone,current_location",
            "ellipsis"
        ],
        [
            "Find me my phone. Then, use it to call my boss.",
            "find_phone,make_call",
            "ellipsis"
        ],
        [
            "Help me find my phone and use it to call Jessica.",
            "find_phone,make_call",
            "anaphora"
        ],
        [
            "Tell me where I left my phone. Then sync with it, please.",
            "find_phone,sync_device",
            "anaphora"
        ],
        [
            "Track down my phone for me. Oh, connect with it, too.",
            "find_phone,sync_device",
            "anaphora"
        ],
        [
            "How much gas do I have left? Well, I need it. So what should I get?",
            "gas,gas_type",
            "anaphora"
        ],
        [
            "Can you inform me of my gas amount, as well as the kind of fuel should I put in my car?",
            "gas,gas_type",
            "ellipsis"
        ],
        [
            "What day were you born and where?",
            "how_old_are_you,where_are_you_from",
            "ellipsis"
        ],
        [
            "What is the age of this ai, as well as its birthplace?",
            "how_old_are_you,where_are_you_from",
            "anaphora"
        ],
        [
            "I need to know the amount of my income, and the tax bracket for my income.",
            "income,taxes",
            "ellipsis"
        ],
        [
            "How much is my salary? Also, I need to know its tax rate.",
            "income,taxes",
            "anaphora"
        ],
        [
            "Do you remember when I last got my car looked at? Also, should I get a gas refill for it at the next gas station?",
            "last_maintenance,gas",
            "anaphora"
        ],
        [
            "Do you know when I last took my car to get checked, and the amount of gas do I have?",
            "last_maintenance,gas",
            "ellipsis"
        ],
        [
            "When was the last time my car was worked on. Oh, what kind of gas does it need, too?",
            "last_maintenance,gas_type",
            "anaphora"
        ],
        [
            "Could you inform me of the date of my last car service, as well as its fuel type?",
            "last_maintenance,gas_type",
            "ellipsis"
        ],
        [
            "When did I last get my car checked? Also, I'm not sure how to jump start it, can you help me?",
            "last_maintenance,jump_start",
            "anaphora"
        ],
        [
            "Do you know when I last took my car to get checked, and the steps to jump start a battery?",
            "last_maintenance,jump_start",
            "ellipsis"
        ],
        [
            "How long since my car was in the shop and what is the mpg for it?",
            "last_maintenance,mpg",
            "anaphora"
        ],
        [
            "Do you remember when I last got my car looked at, and the gas mileage on a ford falcon?",
            "last_maintenance,mpg",
            "ellipsis"
        ],
        [
            "When was the last time I took my car in? Oh, schedule me an appointment to get its tires checked out, too.",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "When was the last time my car was serviced? It needs maintenance but I don't know if I can schedule an appointment for that.",
            "last_maintenance,schedule_maintenance",
            "anaphora"
        ],
        [
            "When did I last get my car checked? Also, how is its tire pressure?",
            "last_maintenance,tire_pressure",
            "anaphora"
        ],
        [
            "Do you remember the date of my last car service, and the tire pressure of my car?",
            "last_maintenance,tire_pressure",
            "ellipsis"
        ],
        [
            "Help me find my lost luggase, and my phone please.",
            "lost_luggage,find_phone",
            "ellipsis"
        ],
        [
            "What to do if I had lost my luggage, and my phone?",
            "lost_luggage,find_phone",
            "ellipsis"
        ],
        [
            "What do I do if I had lost my luggage, and my pin, too?",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "What am I supposed to do if I had lost my luggage, as well as my pin?",
            "lost_luggage,pin_change",
            "ellipsis"
        ],
        [
            "Can we call Mark? Also, let her know where I am.",
            "make_call,share_location",
            "anaphora"
        ],
        [
            "Please initiate a phone call to my boss. Then, share my location with her.",
            "make_call,share_location",
            "anaphora"
        ],
        [
            "How do I convert a cup to ml, and 100 dollars to euros?",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "I need kilograms converted to milligrams, and 500 cad to usd.",
            "measurement_conversion,exchange_rate",
            "ellipsis"
        ],
        [
            "What is the mpg for this car and when I should change its oil?",
            "mpg,oil_change_when",
            "anaphora"
        ],
        [
            "Let me know the mpg of my car and the time to change the oil.",
            "mpg,oil_change_when",
            "ellipsis"
        ],
        [
            "How do I change the oil on my car and when?",
            "oil_change_how,oil_change_when",
            "ellipsis"
        ],
        [
            "Can you teach me how to change my oil and when?",
            "oil_change_how,oil_change_when"
        ],
        [
            "Track the status of my purchase, and the location of my phone.",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "Find the stautus of my order, as well the location of my cellphone.",
            "order_status,find_phone",
            "ellipsis"
        ],
        [
            "Tell me the last check date, and the amount of vacation days I have used.",
            "payday,pto_used",
            "ellipsis"
        ],
        [
            "I am trying to find out the next payday, then the amount of pto I have used.",
            "payday,pto_used",
            "ellipsis"
        ],
        [
            "Find out the date of the next payday, and the date of the next holiday.",
            "pto_used,next_holiday",
            "ellipsis"
        ],
        [
            "Let me know the date of mt next payday and the date of my next holiday.",
            "pto_used,next_holiday",
            "ellipsis"
        ],
        [
            "Find a recipe for hamburgers, and tell me their calories, too.",
            "recipe,calories",
            "anaphora"
        ],
        [
            "I need to find a good way to make chicken soup, and the calorie content of vanilla ice cream.",
            "recipe,calories",
            "ellipsis"
        ],
        [
            "Find a recipe for hamburgers, and a good suggestion for mexican dish.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "I need a pancake recipe, as well as an idea for a french dinner.",
            "recipe,meal_suggestion",
            "ellipsis"
        ],
        [
            "Contact the bank about fraud activity on my card. and that it was damaged by bleach.",
            "report_fraud,damaged_card",
            "anaphora"
        ],
        [
            "I want to report fraudulent activity on my mastercard and that I accidentally caught it on fire.",
            "report_fraud,damaged_card",
            "anaphora"
        ],
        [
            "I need to talk to someone about a fraudulent activity on my card. Plus, I need you to act swiftly and freeze all activity on my capital one.",
            "report_fraud,freeze_account",
            "anaphora"
        ],
        [
            "Can you assist me on my fradulent activity on my chase card? Moreover, could you initiate a block on it, too?",
            "report_fraud,freeze_account",
            "anaphora"
        ],
        [
            "My card was stolen. So, how will it take for my new credit card to be here this week?",
            "report_lost_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "If I lost my card how do I report it? Also, how long does it take to get my replacement?",
            "report_lost_card,replacement_card_duration",
            "cataphora"
        ],
        [
            "What's the reward balance for my card and also what transactions did I put on it last month, too?",
            "rewards_balance,transactions",
            "anaphora"
        ],
        [
            "Can you tell me the reward balance of my visa card, then this month's transactions of my master card.",
            "rewards_balance,transactions",
            "ellipsis"
        ],
        [
            "How do I set up a meeting? Also, do I have any with tom today?",
            "schedule_meeting,meeting_schedule",
            "ellipsis"
        ],
        [
            "Is it possible for you to schedule a meeting for 3:00 on wednesday? Plus, read me my meeting schedule.",
            "schedule_meeting,meeting_schedule",
            "cataphora"
        ],
        [
            "Did I remember to put \"eggs\" on my shopping list, because I should order everything on it.",
            "shopping_list,order",
            "anaphora"
        ],
        [
            "Did I include \"butter\" in my shopping list? If so, I should probably order everything on it.",
            "shopping_list,order",
            "anaphora"
        ],
        [
            "Set the ac, then the alarm.",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "Set the the timer, as well as the alarm.",
            "smart_home,alarm",
            "ellipsis"
        ],
        [
            "Tell me a funny joke about men and show me trivia about them.",
            "tell_joke,fun_fact",
            "anaphora"
        ],
        [
            "I want to hear a joke about toddlers, then a cool fact about spiders.",
            "tell_joke,fun_fact",
            "ellipsis"
        ],
        [
            "Write a text to Kim saying no. Then, for friday, add the appointment with him to my calendar.",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "Text mom saying happy birthday. Oh, then you can remove her birthday party from my calendar fpr january 15, 2019.",
            "text,calendar_update",
            "anaphora"
        ],
        [
            "First, I need to text Joe, then share my location with him.",
            "text,share_location",
            "anaphora"
        ],
        [
            "Please send a text to Danny saying that i'm running late. Oh, show my gps location to him, too.",
            "text,share_location",
            "anaphora"
        ],
        [
            "What's the time in london right now? Give me also its timezone.",
            "time,timezone",
            "anaphora"
        ],
        [
            "First, give me the time in Paris, then the timezone in Vancouver.",
            "time,timezone",
            "ellipsis"
        ],
        [
            "Set the timer for 10 minutes, then the alarm for eight tomorrow, please.",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "Help me set the timer for 5 minutes, then the alarm for 5 pm tomorrow, please.",
            "timer,alarm",
            "ellipsis"
        ],
        [
            "Is my todo list free? Then, clear it, please.",
            "todo_list,todo_list_update",
            "anaphora"
        ],
        [
            "What do I have on my todo list? So, could you erase the items on it please?",
            "todo_list,todo_list_update",
            "anaphora"
        ],
        [
            "Will you please tell me my to do list? Oh, did I add \"salt\" to my shopping one?",
            "todo_list_update,shopping_list",
            "anaphora"
        ],
        [
            "Is \"cleaning the outside windows\" on my todo list and did I include butter in my shopping one?",
            "todo_list_update,shopping_list",
            "anaphora"
        ],
        [
            "Please tell me this month's transactions on my visa card and is its apr good?",
            "transactions,apr",
            "anaphora"
        ],
        [
            "What are my recent card purchases? Also, how does its apr compare to others?",
            "transactions,apr",
            "anaphora"
        ],
        [
            "How can I say \"thank you very much\" in chinese? Oh, change your language setting to it.",
            "translate,change_language",
            "anaphora"
        ],
        [
            "How can I say \"cancel my order\" in french. Now speak to this language.",
            "translate,change_language",
            "anaphora"
        ],
        [
            "How do I say \"goodbye\" in chinese and how do you spell it?",
            "translate,spelling",
            "anaphora"
        ],
        [
            "Tell me how to say hello in Chile, as well as how to spell malignant.",
            "translate,spelling",
            "ellipsis"
        ],
        [
            "Is traveling to France safe and what is the time zone in it?",
            "travel_alert,timezone",
            "anaphora"
        ],
        [
            "Give me the travel alerts for Antarctica, the timezone for Hong Kong.",
            "travel_alert,timezone",
            "ellipsis"
        ],
        [
            "What's the best place to visit in Arizona and is there any danger going to that state?",
            "travel_suggestion,travel_alert",
            "anaphora"
        ],
        [
            "What's the best restaurant in arizona for pizza. Oh, how safe is it to visit Spain?",
            "travel_suggestion,travel_alert",
            "cataphora"
        ],
        [
            "Do you mind if I ask your name? Because, I want to change it to Adam.",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "I'd like to know your name, then change it to Fred, please.",
            "what_is_your_name,change_ai_name",
            "anaphora"
        ],
        [
            "What's the song on the speaker now? I want the next one played.",
            "what_song,next_song",
            "anaphora"
        ],
        [
            "Name this song, and now, I want you to play the next one.",
            "what_song,next_song",
            "anaphora"
        ],
        [
            "Tell me who is your manufacturer, as well as who is your boss.",
            "who_made_you,who_do_you_work_for",
            "ellipsis"
        ],
        [
            "I need to know the name of your creator, and the name of your supervisor.",
            "who_made_you,who_do_you_work_for",
            "ellipsis"
        ],
        [
            "What is the apr on my chase card and how much can I buy on my discover card?",
            "apr,credit_limit"
        ],
        [
            "What is my card's apr ? Also, could my credit be increased to 5000 dollars?",
            "apr,credit_limit_change"
        ],
        [
            "How much is in my pnc account and what's my current credit rating?",
            "balance,credit_score"
        ],
        [
            "Well, how much do I have to pay for my shell gas card bill and what is the minimum amount due on my cable bill?",
            "bill_balance,min_payment"
        ],
        [
            "What day is my telephone bill due? Also, pay my dte bill from my checking account, please.",
            "bill_due,pay_bill"
        ],
        [
            "What is tuesday's calendar like? I want to hear my reminder list, too.",
            "calendar,reminder"
        ],
        [
            "Could I get assistance booking a car rental in Las vegas? Also, for under 700 I need a flight from denver international to New york international on the 3rd.",
            "car_rental,book_flight"
        ],
        [
            "Not only do I need to know why my credit card transaction was declined, but I also need to know if there are any international transaction fees associated with my td bank card.",
            "card_declined,international_fees"
        ],
        [
            "So, I was at Target, right? And guess what? They straight up declined my card! I mean, seriously, I have no clue why they did that. By the way, do you know if it's gonna take a short while before I get my shiny new credit card?",
            "card_declined,replacement_card_duration"
        ],
        [
            "You need to change your language setting to russian please. Besides, change your accent.",
            "change_language,change_accent"
        ],
        [
            "I want you to call me a different name so can you call me charchar. Oh, what is your names, too?",
            "change_user_name,what_is_your_name"
        ],
        [
            "How long does it take to make pho. Plus, mayonaise has been in my fridge for three years, is it still good to eat?",
            "cook_time,food_last"
        ],
        [
            "\nAfter finding out the limit for my credit, I would like my credit limit increased to 5000 dollars.",
            "credit_limit,credit_limit_change"
        ],
        [
            "How do I increase my credit limit? Besides, I want to change my bank of america account pin number.",
            "credit_limit_change,pin_change"
        ],
        [
            "First, look up my fico credit score. Also, what are the top 10 ways to build my credit score?",
            "credit_score,improve_credit_score"
        ],
        [
            "Please tell me the address of my current location, and if possible, share my location with Google.",
            "current_location,share_location"
        ],
        [
            "When my house burned down, so did my card. Oh, also if I lose my credit card, will i get a replacement immediately?",
            "damaged_card,replacement_card_duration"
        ],
        [
            "What day of the week are we on and where exactly am i at the moment?",
            "date,current_location"
        ],
        [
            "I'm interested in knowing when my credit card from Visa expires. However, I'm also eager to learn the present status of my credit card application.",
            "expiration_date,application_status"
        ],
        [
            "Will my card expire on a certain month ? Moreover, if I lose my credit card, will I get a replacement immediately?",
            "expiration_date,replacement_card_duration"
        ],
        [
            "Help me, I don't know where my phone is. Please, tell me my coordinates, too.",
            "find_phone,current_location"
        ],
        [
            "Can you find me first my phone? Then, siri, please call Jacob!",
            "find_phone,make_call"
        ],
        [
            "I need assistance in finding my lost phone; however, it's important to note that I do not want any syncing with my phone.",
            "find_phone,sync_device"
        ],
        [
            "If you could let me know what's left in the tank, that would be awesome. Oh, and by the way, do you happen to know what kind of gas this car takes?",
            "gas,gas_type"
        ],
        [
            "Hey! How old are you and what place were you actually born at?",
            "how_old_are_you,where_are_you_from"
        ],
        [
            "Well, what's my income before taxes? Plus, what do I get taxed at my income level?",
            "income,taxes"
        ],
        [
            "How long since I swapped oil and how much gas does it take to get to Jackson?",
            "last_maintenance,gas"
        ],
        [
            "Hey, do you remember when I last got my car checked? Also, do you know what kind of fuel my car takes?",
            "last_maintenance,gas_type"
        ],
        [
            "What was the date of my last car service and teach me how to jump start my car, too.",
            "last_maintenance,jump_start"
        ],
        [
            "Could you inform me when I last got my car checked? Then, I need to know this car's mpg.",
            "last_maintenance,mpg"
        ],
        [
            "How long since my car was in the shop? Oh, help me find somewhere to schedule a check up on my car's tires, too",
            "last_maintenance,schedule_maintenance"
        ],
        [
            "When did I change my oil and how much psi is in my car tires?",
            "last_maintenance,tire_pressure"
        ],
        [
            "Who can I call about my luggage? Plus, could you find me my phone?",
            "lost_luggage,find_phone"
        ],
        [
            "I think my luggage is missing. Also, I want to change my bank of america account pin number.",
            "lost_luggage,pin_change"
        ],
        [
            "Call Aj please, then share my gps with Tom.",
            "make_call,share_location"
        ],
        [
            "What is the total number of pints in two quarts and how much is usd vs cad?",
            "measurement_conversion,exchange_rate"
        ],
        [
            "While, I need to tell me the mpg of my vehicle, could you also remind me when to change oil?",
            "mpg,oil_change_when"
        ],
        [
            "What kind of oil do I need for my ford truck? Plus, how can I change it and when do I need to change my motor oil?",
            "oil_change_how,oil_change_when"
        ],
        [
            "Did my order get here yet? Oh, help me, i don't know where my phone is, too.",
            "order_status,find_phone"
        ],
        [
            "When do I get my paycheck and how many days off have i used?",
            "payday,pto_used"
        ],
        [
            "Can you tell how many days I already took off this year and when do we have free day?",
            "pto_used,next_holiday"
        ],
        [
            "Not only I need a recipe for chicken cordon bleu, but also I want to know how many calories are in powdered donuts.",
            "recipe,calories"
        ],
        [
            "Pull up ramen recipes please. Plus, what would you suggest having for dinner?",
            "recipe,meal_suggestion"
        ],
        [
            "First, I want to report fraudulent activity on my Visa. Additionally, please be aware that my card has a burn on it.",
            "report_fraud,damaged_card"
        ],
        [
            "I want to report fraudulent activity on my mastercard. Also, put a block on my US bank account immediately.",
            "report_fraud,freeze_account"
        ],
        [
            "If my card was stolen, where do i report it and what is the eta on getting a replacement card?",
            "report_lost_card,replacement_card_duration"
        ],
        [
            "How many points on my chase unlimited card and what items do I have on my amex card this month?",
            "rewards_balance,transactions"
        ],
        [
            "How do I set up a meeting and do I have any meetings today between 9:30 and 10:30?",
            "schedule_meeting,meeting_schedule"
        ],
        [
            "Will you please read the things on my shopping lis. Also aquire me them kyrie 4s.",
            "shopping_list,order"
        ],
        [
            "Turn on the tv please, then create alarms for 8 pm and 9 pm.",
            "smart_home,alarm"
        ],
        [
            "I want to hear something hilarious. Plus, tell me something interesting about elephants.",
            "tell_joke,fun_fact"
        ],
        [
            "Robbie needs to know about this, so would you text robbie to let them know? Also, I need to add iep meeting to my calendar on april 15th",
            "text,calendar_update"
        ],
        [
            "First, text joe, then I would like Brenda to have my location.",
            "text,share_location"
        ],
        [
            "What hour is it in london? Also, what timezone is paris in?",
            "time,timezone"
        ],
        [
            "Create a timer that is set to go off after 25 mins. Moreover, set an alarm for 05:00 and one for 16:00.",
            "timer,alarm"
        ],
        [
            "What do I need to do and can you also delete my todo list please?",
            "todo_list,todo_list_update"
        ],
        [
            "Please delete the items on my to do list. Oh, plus is \"waffles\" on my list for shopping?",
            "todo_list_update,shopping_list"
        ],
        [
            "What are my recent purchases and how does my card's apr compare to others?",
            "transactions,apr"
        ],
        [
            "How do you say hello in mexico? I want you to speak german, too",
            "translate,change_language"
        ],
        [
            "How do I say dinner in spanish ? Also, tell me how to spell malignant.",
            "translate,spelling"
        ],
        [
            "Is traveling to France safe and what timezone Do ho chi minh use?",
            "travel_alert,timezone"
        ],
        [
            "I want to know where to visit in Bangkok and is there any danger going to brazil?",
            "travel_suggestion,travel_alert"
        ],
        [
            "Do you mind if I ask your name. Also, will you respond to Adam instead of the current name?",
            "what_is_your_name,change_ai_name"
        ],
        [
            "First, name this song and then I want you to play the next one.",
            "what_song,next_song"
        ],
        [
            "Well, who formed you? Then, tell me who your boss is.",
            "who_made_you,who_do_you_work_for"
        ],
        [
            "Well, what can I do to get a better credit score?",
            "improve_credit_score"
        ],
        [
            "Tell me the procedure to change oil in car.",
            "oil_change_how"
        ],
        [
            "I'd like to know if my capital one credit card has international transaction fees.",
            "international_fees"
        ],
        [
            "How do I say \"thank you\" in spanish?",
            "translate"
        ],
        [
            "Give me the location for tourist destination in Bangkok, please.",
            "travel_suggestion"
        ],
        [
            "How long does it take a new card to arrive in the mail to me?",
            "replacement_card_duration"
        ],
        [
            "Let me know how many vacation I have utilized.",
            "pto_used"
        ],
        [
            "What's london's timezone?",
            "timezone"
        ],
        [
            "Tell me something interesting about New York state.",
            "fun_fact"
        ],
        [
            "Can you skip this song and go to the next one?",
            "next_song"
        ],
        [
            "Please pay my utility bill from my wells fargo checking account.",
            "pay_bill"
        ],
        [
            "Well, you can remove the wedding from my calendar for march 12, 2019.",
            "calendar_update"
        ],
        [
            "My card was damaged by bleach.",
            "damaged_card"
        ],
        [
            "Please check my tires and let me know if I have sufficient air in them.",
            "tire_pressure"
        ],
        [
            "Do I have any meetings today between 9:20 and 10:30?",
            "meeting_schedule"
        ],
        [
            "Find a recipe for hamburgers.",
            "recipe"
        ],
        [
            "Do I have enough gas to get to buffalo?",
            "gas"
        ],
        [
            "My card is lost and I need to know how to report it.",
            "report_lost_card"
        ],
        [
            "Send a text to Joe.",
            "text"
        ],
        [
            "How many calories are in a serving of deans french onion dip?",
            "calories"
        ],
        [
            "Where do you hale from?",
            "where_are_you_from"
        ],
        [
            "When is my order coming?",
            "order_status"
        ],
        [
            "How many ounces is 2 and half cups?",
            "measurement_conversion"
        ],
        [
            "Set the timer for 10 minutes.",
            "timer"
        ],
        [
            "How long since my oil had a refresh?",
            "last_maintenance"
        ],
        [
            "When do I need to change my oil next?",
            "oil_change_when"
        ],
        [
            "Please help me in finding my phone.",
            "find_phone"
        ],
        [
            "I wanted to remember something, what was it?",
            "reminder"
        ],
        [
            "How many times do I get paid in march?",
            "payday"
        ],
        [
            "I need a flight from Denver international to New york international round trip for the 4th though the 8th.",
            "book_flight"
        ],
        [
            "What is your current age?",
            "how_old_are_you"
        ],
        [
            "What's my schedule like for thursday the 14th?",
            "calendar"
        ],
        [
            "Can you read the things on my shopping list?",
            "shopping_list"
        ],
        [
            "What's your name?",
            "what_is_your_name"
        ],
        [
            "I would like to know if my visa card application has been approved.",
            "application_status"
        ],
        [
            "What kind of gas mileage does this car get when going through a city?",
            "mpg"
        ],
        [
            "Set an alarm for me please.",
            "alarm"
        ],
        [
            "When is the end month of my card?",
            "expiration_date"
        ],
        [
            "Could you tell me the amount owed on gas and electric?",
            "bill_balance"
        ],
        [
            "Tell me something to make me laugh",
            "tell_joke"
        ],
        [
            "Look up my fico credit score.",
            "credit_score"
        ],
        [
            "Call Aj now.",
            "make_call"
        ],
        [
            "I need to rent a car from the 10th to the 15th in Zimbabwe, preferably a BMW.",
            "car_rental"
        ],
        [
            "What gas type is needed for this car?",
            "gas_type"
        ],
        [
            "What's the name of the song playing right now?",
            "what_song"
        ],
        [
            "Tell me how to spell the word \"dessert\".",
            "spelling"
        ],
        [
            "Connect with my phone.",
            "sync_device"
        ],
        [
            "Let me know what date it will be in 3 days.",
            "date"
        ],
        [
            "Can you tell me how much money I have in my bank accounts?",
            "balance"
        ],
        [
            "I need to arrange an appointment to have my car's tires examined.",
            "schedule_maintenance"
        ],
        [
            "Tell me my tax rate.",
            "taxes"
        ],
        [
            "Can you send my exact location to Laura?",
            "share_location"
        ],
        [
            "List all purchases of video games.",
            "transactions"
        ],
        [
            "Can you tell me where I am?",
            "current_location"
        ],
        [
            "Please schedule a meeting with Kim at 10 am.",
            "schedule_meeting"
        ],
        [
            "I need to know why my credit card transaction was declined.",
            "card_declined"
        ],
        [
            "I want to call you Maggie.",
            "change_ai_name"
        ],
        [
            "What should I do if I lost my luggage?",
            "lost_luggage"
        ],
        [
            "Please call me Charlile from here on out ok?",
            "change_user_name"
        ],
        [
            "I want to know when is the next holiday here.",
            "next_holiday"
        ],
        [
            "I need an italian dinner idea.",
            "meal_suggestion"
        ],
        [
            "Can you tell me how good my card's apr is?",
            "apr"
        ],
        [
            "How do I find out when my visa bill is due?",
            "bill_due"
        ],
        [
            "Do you work for a different person?",
            "who_do_you_work_for"
        ],
        [
            "How can I jump start my car?",
            "jump_start"
        ],
        [
            "Is the dollar worth a lot in country b?",
            "exchange_rate"
        ],
        [
            "I need your accent to be changed.",
            "change_accent"
        ],
        [
            "Could my credit be increased to 5000 dollars?",
            "credit_limit_change"
        ],
        [
            "Mayonaise has been in my fridge for three years, is it still good to eat?",
            "food_last"
        ],
        [
            "Is it safe to travel to mexico?",
            "travel_alert"
        ],
        [
            "What was my income last year?",
            "income"
        ],
        [
            "What's the recommended cooking time for steak?",
            "cook_time"
        ],
        [
            "Is there anything on my todo list for taking out the trash?",
            "todo_list"
        ],
        [
            "How do I report fraud on my chase bank card?",
            "report_fraud"
        ],
        [
            "I need my savings account placed under a block as soon as possible.",
            "freeze_account"
        ],
        [
            "I'm finished with my to do list.",
            "todo_list_update"
        ],
        [
            "What is my kohls card's rewards balance?",
            "rewards_balance"
        ],
        [
            "Secure the doors.",
            "smart_home"
        ],
        [
            "I can't remember my pin for my first national debit account.",
            "pin_change"
        ],
        [
            "I ran out of bread, order more.",
            "order"
        ],
        [
            "Who is your manufacturer?",
            "who_made_you"
        ],
        [
            "What's the time in london right now?",
            "time"
        ],
        [
            "Tell me the highest amount I can spend on my discover card.",
            "credit_limit"
        ],
        [
            "Speak german.",
            "change_language"
        ],
        [
            "Tell me the least I can pay.",
            "min_payment"
        ]
    ]
}